{"title": "What do do with a old MacBook Pro? - Hardware - 0x00sec - The Home of the Hacker", "users": ["http://0x00sec.org/u/rndm_stranger", "http://0x00sec.org/u/oaktree", "http://0x00sec.org/u/fxbg", "http://0x00sec.org/u/Ninja243", "http://0x00sec.org/u/pry0cc", "http://0x00sec.org/u/Kage", "http://0x00sec.org/u/MagisterQuis", "http://0x00sec.org/u/afiskon", "http://0x00sec.org/u/MagisterQuis", "http://0x00sec.org/u/yehgdotnet", "http://0x00sec.org/u/Techno_Forg", "http://0x00sec.org/u/alphaEncryption", "http://0x00sec.org/u/system"], "data": [{"author": "rndm_stranger", "speak": "Hey,I have an old MacBook Pro (Late 2010) laying around since it got me an new one in September. The battery drains pretty fast, but otherwise it is in very good conditions. Does anyone have a idea what project I might can realise with it? I don´t want to throw a perfectly fine computer away just because I don’t need it anymore.Thanks"}, {"author": "oaktree", "speak": "@pry0cc put Arch on his!"}, {"author": "fxbg", "speak": "burn it live on youtube."}, {"author": "Ninja243", "speak": "What about hosting a site on it?That’s what I’ve done to my Pentium 4 tower"}, {"author": "pry0cc", "speak": "I actually have Late 2011, regardless, this era of MBP’s run Arch amazing. I went one step further and installed an SSD as well, and boy is it nippy.You might find the battery is dying because it is old, mine is starting to go as well. You can get a brand new battery on ebay for these models for around 30 GBP.If you want to get fancy, you could mess around with this box as a hacking machine. Something you can potentially throw away if things get sticky."}, {"author": "Kage", "speak": "I also have an old mid 2010 MacBook Pro lying around and would like to hear what you did with your if you can find something to do…"}, {"author": "MagisterQuis", "speak": "I had one slightly older, runs OpenBSD like a champ.  I use it for just about everything.At one point I had a honeypot on there, it was funny to watch scriptkiddies try to h4x0r Linux and get very confused."}, {"author": "afiskon", "speak": "Usually I use an old laptop:As a backup in case something happens with my primary laptop.For experiments like installing FreeBSD and figuring out how to debug the FreeBSD kernel.For portability testing, e.g. figuring out whether OpenGL projects runs on this OS/hardware as expected.Also if you have any spare hardware just lying around it always fun to take it apart, look on chip markings, google them, trying to figure out what they do and they work, replacing stuff (using soldering fan and soldering iron, i.e. modding), etc."}, {"author": "MagisterQuis", "speak": "It really depends on the sort of stuff you like to do.  When my battery (and keyboard, and fan) died from water damage, I left it plugged in and got an external keyboard and turned it into a desktop before going server."}, {"author": "yehgdotnet", "speak": "I used it dedicatedly for mobile app pentest (not server side). It serves well."}, {"author": "Techno_Forg", "speak": "Oh lordy… simple, BURN IT!!!On a more serious note… play with it. The limit is the sky (?)"}, {"author": "alphaEncryption", "speak": "I think that you should put a linux distro like ubuntu on it, then use it for streaming and some programing."}, {"author": "system", "speak": "This topic was automatically closed after 30 days. New replies are no longer allowed."}]}