{"title": "Like i clearly said...remove my profile/account and all my threads and info - Linux - 0x00sec - The Home of the Hacker", "users": ["http://0x00sec.org/u/salvation", "http://0x00sec.org/u/FFY00", "http://0x00sec.org/u/salvation", "http://0x00sec.org/u/alco", "http://0x00sec.org/u/FFY00", "http://0x00sec.org/u/salvation", "http://0x00sec.org/u/ricksanchez", "http://0x00sec.org/u/FFY00", "http://0x00sec.org/u/fxbg", "http://0x00sec.org/u/salvation", "http://0x00sec.org/u/_py", "http://0x00sec.org/u/fraq"], "data": [{"author": "salvation", "speak": "Like i clearly said…remove my profile/account and all my threads and info"}, {"author": "FFY00", "speak": "Why do people need to make everything so 1337? That only makes you look bad."}, {"author": "salvation", "speak": "I think you should keep your negative ass comment to yourself …first offsecond … I am sorry that’s just my style nobody told me you were the sole judge and jury on whats 1337 and whats not…lolthird … not everything needs to be as plain as white bread and not everything is cliso again keep your negativity to yourselfyou don’t like it…dont comment…don’t downloadit’s that simple and your comment is that sadCHEERS"}, {"author": "alco", "speak": "hey man, looks cool. It’d be nice if you added some large screenshots though, you can’t really appreciate it at that res.Cheers"}, {"author": "FFY00", "speak": "salvation:so again keep your negativity to yourselfyou don’t like it…dont comment…don’t downloadit’s that simple and your comment is that sadI didn’t meant it like that. It did came out a bit aggresive and negative, but that was not what I was trying to do."}, {"author": "salvation", "speak": "this is exactly why I hate people and society…i try to be myself and do something nice and this is the result"}, {"author": "ricksanchez", "speak": "Please keep it civil here.Otherwise this thread is locked/removed.Thanks"}, {"author": "FFY00", "speak": "In case it wasn’t clear, I was trying to say that I am sorry. So, I am sorry. I wasn’t trying to offend you.If you have anything you want to say to me, please come by the irc.Thanks,FFY00"}, {"author": "fxbg", "speak": "There is nothing wrong with being yourself but modifying a kali distro doesn’t really need its own tutorial. And to be fair, this IS the kind of tutorial you would see on l33t h4x0r sites like hackforums and the like. Also, I didn’t see a tutorial anywhere on this thread, just screenshots and a link (that I didn’t click).There is nothing wrong with “making it look cool”, although most of us (I’m sure I’m not the only one) believe that less is better. I use a chromebook with Xenial for pen testing, all the tools on kali are pretty much found in aptitude, and those that aren’t, install just as easy.Maybe some tutorials about using some of the tools? Otherwise, I think this thread is selfish and unnecessary."}, {"author": "salvation", "speak": "remove the thread and my account and all my threads."}, {"author": "_py", "speak": ""}, {"author": "fraq", "speak": ""}]}