{"title": "[Pwnable] Heap of Secrets - Exploit Development - 0x00sec - The Home of the Hacker", "users": ["http://0x00sec.org/u/_py", "http://0x00sec.org/u/Sirius", "http://0x00sec.org/u/_py", "http://0x00sec.org/u/Sirius", "http://0x00sec.org/u/_py", "http://0x00sec.org/u/0x00pf", "http://0x00sec.org/u/Sirius", "http://0x00sec.org/u/ricksanchez", "http://0x00sec.org/u/exploit", "http://0x00sec.org/u/_py", "http://0x00sec.org/u/_py"], "data": [{"author": "_py", "speak": "Time to step up the game. Keep in mind there is more than one way to solve it. Good luck.RulesFeel free to pwn the binary on Ubuntu 16.04 or 17.04. Extra credits if you pwn it on 17.04.Don’t ask me for hints. Hints will only be given 1 month after the challenge’s release as long as there are still 0 solves and demand for a hint.Don't post your exploit below (with or without the spoiler tags)! This will not help those who still struggle. If you do pwn the binary, make sure to pm me your exploit with an explanation, and once I evaluate it, I’ll post in the comment section that you successfully pwned it providing your alias.Binarysecret_heap~ hf"}, {"author": "Sirius", "speak": "Hints will only be given 1-2 months after the challenge’s releaseHmmmm, seems like you haven’t even solved it yourself yet. =p"}, {"author": "_py", "speak": "I don’t get it. Why would I create and post a pwnable if I haven’t made sure it’s solvable?"}, {"author": "Sirius", "speak": "If i’m not mistaken, I believe @0x00pf did that at one point in the past 2 yrs."}, {"author": "_py", "speak": "I can pm you my PoC if you’re in such doubt."}, {"author": "0x00pf", "speak": "I think I have done that a couple of times… You may be referring to this one:Case:GBC-17/124 Challenges    The Greedy Brothers Corp. has approached you, young wannabe, to solve a pretty nasty issue. Many machines have been infected by a mysterious ransomware. The IT department from the Greedy Brothers Corp. have found a dropper in some of the machines but no track of the actual malware... except, of course, the ransom notes all over the place. The company has paid to release one of the machines and captured all the network traffic during the process in the hope to get some further information on th…"}, {"author": "Sirius", "speak": "Yup, that’s the one."}, {"author": "ricksanchez", "speak": "There will be a time when I finally pick up heap shenanigans and I will do all those challenges @_py!Promised"}, {"author": "exploit", "speak": "Got 'em."}, {"author": "_py", "speak": "That’s. Mah. Boy!"}, {"author": "_py", "speak": "This topic was automatically closed after 30 days. New replies are no longer allowed."}]}