{"title": "Introducing 0x00sec/Leap Security CTF 2018! - 0x00sec Announcements - 0x00sec - The Home of the Hacker", "users": ["http://0x00sec.org/u/pry0cc", "http://0x00sec.org/u/pry0cc", "http://0x00sec.org/u/ricksanchez", "http://0x00sec.org/u/Rain", "http://0x00sec.org/u/pry0cc", "http://0x00sec.org/u/vict0ni", "http://0x00sec.org/u/Leeky", "http://0x00sec.org/u/BLuef0x", "http://0x00sec.org/u/vimicasa", "http://0x00sec.org/u/dkimber", "http://0x00sec.org/u/jl3", "http://0x00sec.org/u/vanquish"], "data": [{"author": "pry0cc", "speak": "Welcome to the inaugural Leap Security and 0x00sec CTF!! We have teamed up with the guys at Leap Security to bring you this challenging fun-filled event. The CTF has no limitations on participants as it is open to anyone (no registration required) – think of it as our gift back to the community!twitter-ctf.png750x500 520 KB$ timedatectlTime: Saturday, 15 December 2018, 12:00pm (EST)/1544875200 (Unix)Location: Remote, anyone can participate.The CTF ends 24 hours after the start date on Sunday, 16 December 2018, 12:00pm (EST) / 1544875200 (Unix)$ L00tParticipants must register on 0x00sec and reach Trust Level 1 to qualify for a prize.1st Place: Burp Pro + Shodan Pro License2nd Place: Shodan Pro3rd Place: Shodan Pro4th Place: CTF Runner up Badge on 0x00sec.org5th Place: CTF Runner up Badge on 0x00sec.orgTo make awarding prizes easier, use your 0x00sec username when registering for the CTF. If you are unable to do that, put your 0x00sec profile link in the Website tab.$ man CTF.0x00The start of the CTF and hint for the first challenge will be released on Leap Security’s twitter page (@LeapSecurity).The Leap Security 0x00sec CTF is a remote CTF dedicated to the community.You can create your accounts right now at ctf.0x00sec.org!Leap Security shirts will be available in limited quantities throughout the duration of the CTF. 0x00sec swag is also available for purchase through their site.$ countdown --nowExcited for the upcoming CTF? Follow @LeapSecurity and make this page your landing page!"}, {"author": "pry0cc", "speak": ""}, {"author": "ricksanchez", "speak": "Awesome to see that project going down now! I hope everyone who participates will enjoy it a lot  !Good luck and have fun in advance to everyone thinking about joining!"}, {"author": "Rain", "speak": "Signed up! I think. I got an error 403 foribidden, but when I tried to make a team again it said that the email and team name were already registered. Anyway, my team name is Team Name. Looking forward to the competition!"}, {"author": "pry0cc", "speak": "Yes that seems to be an error we were having last year.It still works, just navigate away."}, {"author": "vict0ni", "speak": "i’m looking forward to it!"}, {"author": "Leeky", "speak": "Awesome! Really cool to see another ctf this year!"}, {"author": "BLuef0x", "speak": "HackMiami is created and looking forward to play n learn."}, {"author": "vimicasa", "speak": "Awesome Initiative!! Great job!!Registered!!"}, {"author": "dkimber", "speak": "This sounds really cool!"}, {"author": "jl3", "speak": "Sneaky one, hello world"}, {"author": "vanquish", "speak": "Looking forward to this!"}]}