{"user": "0xDE4DB33F", "history": ["DISCLAIMER: Article originally published on immunIT. Hi fellas, Today, I will introduce you to a new tool, developed for the sake of one of my pentesting engagement, named XIP. XIP claims to provide an efficient way to generate a list of IP addresses, using a set of mutations, in order to bypas&hellip;", "Running and Mining from CoinHive in the Linux Command LineAs you may be aware, 0x00sec has begun offering Monero Mining in the browser via Javascript. If you’re like me, you have some server somewhere that can happily take the load, but it’s headless, and you don’t want to be leaving a web browser &hellip;", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "NULL Pointer dereferenceIn the name of Allah, the most beneficent, the most merciful. Hello everyone to a boring article once again. I’ve found a bit of freetime, so i decided to write this article, it isn’t really well done, but i hope you guys like it and learn much !Kernel Exploitation ?&hellip;", "Hello folks! I hope you’re all doing great! Today’s topic is by far my most favorite heap exploitation technique I’ve ever dealt with until now (as far as Linux is concerned). I can’t stress enough how much I love this technique. It’s super smart, technical, and even though malloc has been hardened &hellip;", "Hey! A very quick little tutorial here, (really not advanced at all), but may save you a tonne of time. Big scary disclaimer: I don’t advise pirating blah blah, I cannot be held responsible for the billions of dollars of “theft” you do with this. Blah Blah. Don’t sue me. Here’s the deal - You’re a&hellip;", "LYNXI have been into web scraping for a long time, since the first time I realized people will pay for large neatly organized data. I came across something interesting and wanted to pass some knowledge onto others. Lynx is a command line based browser. I first discovered it when I had my first Linu&hellip;", "As it doesn’t look that @dtm is going to cover linux stuff, I have wrote a quick and dirty version of the great PE File Infector paper from @dtm but targeting ELF binaries specifically under GNU/Linux systems. The process I will describe is slightly different from the one explained in the PE counte&hellip;", "The following paper documents a possible PE file infection technique which covers a high level overview and the low level code of how both the infection and the resulting payload is executed. Please note that some of the following material may not be suited for beginners as it requires: Proficiency&hellip;", "Greetings, all. The following paper will be documenting an example of executable compression, AKA packers which I have developed over the past couple of days. Like crypters, I feel as though they are some form of hidden dark art of the underground communities. Though there are many publicly availabl&hellip;", "#Introduction to the Android Malware Series - 0x00Hey everyone and welcome to the introduction of my Android Hacking series! Nowadays, who doesn’t have a smarphone? People have their eyes fixed on their phone, what makes them vulnerable : Malware and Exploit. This series will aid you in the proces&hellip;", "Solving a ROP on 64-bit challenge In the name of Allah, the most beneficent, the most merciful. ###Before i begin this article, i want to thank @_py for showing me this beautiful community … This article is for learning purposes… Hello everybody, this my first article ever, i’m not really go&hellip;", "Sigreturn Oriented ProgrammingIn the name of Allah, the most beneficent, the most merciful. Hello everyone to a new boring article, after we took a small look on normal ROP stuff, I decided to write something more fun !@_py is the one that started that idea! for learning purposes …I hope yo&hellip;", "Sup folks! I hope you are all doing great. It’s been a long time since my last CTF write-up. The main reason is because I was trying to master the beast called heap exploitation and I’ve yet to learn a ton about it. To showcase one of the modern ways to pwn a heap-based vulnerable binary, I’ll use a&hellip;", "So it’s been a while since I last wrote an article and I think it’s time for a new one. Since the straight forward smash stacking has already been covered plenty, I decided to start this serie with ret2libc. It is assumed that you already understand the normal exploiting techniques, so make sure y&hellip;", "Hi 0x00ers. This is my first post and my goal in it is to share and detail how you can exploit a buffer overflow by doing a detailed analysis of the executable and for that I will solve a challenge proposed by ricnar in its reversing course, it is clear that i just started on the subject of reversi&hellip;", "As promised, here is the shellcode tutorial once again RequirementsAlright so this isn’t going to be msfvenom tutorial. (shellcodes are payloads). This tutorial will focus on writing shellcodes using Assembly. Knowledge of C and Assembly is highly recommend. Also knowing how the stack works is a&hellip;", "Hey folks! this topic details how to overflow a buffer, bypass DEP (Data Execution Prevention) and take control of the executable Recommended PrerequisitesC/C++ language, a basic level would be finex86 Intel AssemblyFamiliarity with Buffer OverflowDebuggers/DisassemblyThe binaryFile Virust&hellip;", "OSINT - Passive Recon and Passive Discovery Of AssetsSup 0x00’ers, to kick this badass series off, I am going to begin with the most important aspect of pentesting. Passive Recon and OSINT. Now, do not let the word ‘passive’ fool you. This is no light recon, you can uncover vast amounts of infomati&hellip;", "Knowledge is Power But like all power, there are those who want to keep it for themselves but em not one of them. I was feeling bored and I start checking my bookmarks and I found these linked in my bookmarks so I thought I should make a list and share with others because knowledge should be free .&hellip;", "Recently I moved into a new suburban neighborhood littered with default router access points. One day, I decided I wanted to test my luck and see what I could get by using a simple but very effective Wordlist A few years ago I use to work as a cable installation technician. I’ve noticed most techni&hellip;", "IntroductionIt was 7:20 pm on my small city, I just buyed a new computer so I was installing Kali, and browsing Vulnhub for a cool and fast CTF.  I stumbled upon a CTF called DEFCON Toronto: Galhad it’s difficulty was on easy, so I guessed It was time for me to play a little.  Warning: EVERYTHI&hellip;", "Like i clearly said…remove my profile/account and all my threads and info", "At this point, it should basically be “Stupid SSH tricks™”, but whatever. Prerequisites:  Basic understanding of *nix and SSH ScenarioYou have a server behind a firewalled network and you need to connect. You could just do something like ssh first-server and from there ssh internal-server. Not to&hellip;", "Awesome write-up as usual!", "Awesome write-up as usual!", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "Tutorial: Creating Yara Signatures for Malware DetectionIntroductionWe all know it’s way more fun to hack shit than to patch shit. That said, not all employers will be satisfied with a hacker who can only compromise systems. Some companies want security researchers that are able to apply patches b&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "You should put this on github. That way everyone can view the code without being required to download it first. Nothing against you, but this is the internet after all.", "What’s good, peeps? Before I start this topic, I’d like to sincerely apologise for the huge delay. At the time (before my exams started), I was hyped to deliver a second instalment of game hacking to the forums but I had lost interest due to the exhaustion gathered from exam preparation and particip&hellip;"]}