{"user": "0xE02B7", "history": ["Hello, 0x00’ers! Welcome to my third (Yes 3rd) instalment of Paranoia and a Terminal! In this episode we will explore URL Forensics - for the Paranoid. In other terms, viewing a site or viewing a link, without falling victim to a social engineering attack if our spidey sense rings alarm bells. Scen&hellip;", "Below is a curated list of member projects. These are not officially endorsed by 0x00sec. Instead, it’s merely a collection of software projects our members contribute to or own. If you’re looking for something to get involved with, here’s a great place to start. Want to see your name on this list? &hellip;", "simple, but good. Have to try this out on my Arch. Thanks!", "As requested by @pry0cc, well, not really a request… more like I threw out there a idea and pry volunteered me to do a tutorial. Ok, fine, I guess. Anyways, with that all being said and done as the name suggests this is how to securely connect to IRC using Hexchat and ToR. It isn’t that complicated,&hellip;", "My Introduction First, I would like to thank 0x00sec for providing such a great community. I would also like to thank Arrogant Bastard, Sierra Nevada and Deathwish Coffee for providing the sustenance necessary for starting and completing the following series. Not only should you get drunk while com&hellip;", "I don’t really have much in terms of a fancy desktop, I spend most of my life in Vim anyway.  [screenFetch-2018-06-01_12-06-06]The screenshot there is from my laptop, a 2015 MacBook Pro - in my opinion still the best model. Anyway, onto the software I use! My config is not quite as consolidated a&hellip;", "I feel super lame here because I don’t actually pimp my setup all that much, but I am very particular about my workspace and workflow. I also don’t think of my setup in terms of one box. It’s all about a workflow and an infrastructure for me. I don’t operate a computer; I harness the power of cloud &hellip;", "Well, first, thanks for the summon @pry0cc. I will take this opportunity to explaining you guys what is the perfect setup for me. I’m not caring so much about fancy widgets or shiny desktop, I’m well more concerned about the maintainance and enhancement aspect of my workingstations. Through this m&hellip;", "@pry0cc, share your dot files… I want to see your i3wm config file specifically.", "1.) Connect VPN + TOR in this arrangement: You -&gt; TOR + VPN -&gt; VPN -&gt; destination 2.) do some google dorks for stolen credit card dumps. 3.) Buy BTC with them 4.) Send the BTC to another address in your wallet. Do this atleast 3 times. 5.) Send your BTC through a mixer service. 6.) Again, send &hellip;", "@pry0cc and @fraq  recently announced that 0x00sec will be reformed. They did this in an internal thread in the VIP loungue. I am not the right person to explain it to the big public (the staff will do in the near future probably), but basically we want 0x00sec to be more varied instead of being sol&hellip;", "Good day all, Seeing as this is my first real post here, and I’m fairly certain a few of you know me, but the large majority don’t, I’ll introduce myself a little, and then continue from there. Names Mike, I go by L0k1 online, which is what most of you will come to know me as. I’ve been involved i&hellip;", "OSINT 0x02 - LinkedIn is not just for jobsSup 0x00’ers, that’s right, I am back with another banger of an article, ready? If you read my last article on OSINT, you’ll know a little bit on how to find dirt on companies, their assets, and how to do all of that passively. Well now I am going to show &hellip;", "Another one on me.  [image]@Sirius", "Here are some of mine…  [image] [image]", "Hello 0x00’ers. I have made some wallpapers with the 0x00sec logos. I hope you enjoy them. I have attached a compressed tar archive with the full album. (MEGA link, The files are huge because I didn’t compress them.) Enjoy   https://mega.nz/#!7BRQBTyZ!AjsIxERCVe0_l0Ub2jl49vSZ8HViwKtJi2idTuGKESo –F&hellip;", "Are you hijacking my post with your wallpapers? I’ll have you know my mommy works for AOL and she will turn your internet off.", "Has anyone read Learning Linux Binary Analysis? It covers a lot of what is covered here. In addition, it gives an excellent overview of the ELF format and goes over how to write Linux malware", "We have already seen how to infect a file injecting code into the binary so it gets executed next time the infected program is started. But, how to infect a process that is already running?. Well, this paper will introduce the basic techniques you need to learn in order to fiddle with other processe&hellip;", "I was already there, but somehow my client is not able to connect…therefore - after my vacation - I thought it is freenode. FML!", "I was already there, but somehow my client is not able to connect…therefore - after my vacation - I thought it is freenode. FML!", "Note: We&#39;re not on freenodeThe network is  irc.0x00sec.org:6697 . It’s up and running and inhabitated", "Continuing the discussion from Spawning reverse shells: I was about to reply on (Spawning reverse shells), but my reply has got so long that I decided to made it into a post. Please first read the original thread from @RickSanchez and the comments there, before you continue. The discussion here, i&hellip;", "is it possible that nobody is in there the whole last week  ?", "That is really cool! Nice share. I might add it later.", "I think there’s a tool written in Python that can do this job… let me see if I can find it (it’s saved to my drive)… (Five hours later) Alright, I’m back… found the github link after saving the world from aliens. On a more series note… this I think should be worth  looking into. It does ALMOST &hellip;", "Dope article mate. Love it. Didn’t know about shodan nmap script  Could be useful to import result whithin metasploit which provides a nice way to handle detected services. By the same token, have you ever heard about virustotal passive DNS replication? It’s redoubtable, you will thanks me later  h&hellip;", "Love it! Gonna need one once I get paid…", "Two questions about the swag. First, can you get polo shirts with the logo on it? My company has a dress code, so T-shirts aren’t allowed, but I’d still love to show some love at work. Second, if you can get polos, could you do a poll/survey to see if anyone else would buy them? I’d hate for you to &hellip;", "No. Not yet  Stay tuned…", "That is a really cool article. I have to admit, I have never done a pentest - ok, maybe because I am a Linux System Engineer and not a security consultant / *hacker. Sometimes our customers hire some to do black box tests. Most of the times those people are totaly bad.", "OSINT - Passive Recon and Passive Discovery Of AssetsSup 0x00’ers, to kick this badass series off, I am going to begin with the most important aspect of pentesting. Passive Recon and OSINT. Now, do not let the word ‘passive’ fool you. This is no light recon, you can uncover vast amounts of infomati&hellip;", "Ok here is my setup! I run ArchLinux with the i3 tiling window manager. This is configured by myself using a very heavily modified version of OxHak’s config. I am using conky for the top bar. My anonymity setup is fairly simple. I have a collection of VPN’s and I connect to a different one every da&hellip;", "Hey! A very quick little tutorial here, (really not advanced at all), but may save you a tonne of time. Big scary disclaimer: I don’t advise pirating blah blah, I cannot be held responsible for the billions of dollars of “theft” you do with this. Blah Blah. Don’t sue me. Here’s the deal - You’re a&hellip;"]}