{"user": "AnonimTR", "history": ["I’ve been lurking on the forum quite a bit now and after some thought, I decided to share this cool hack with you. As the name suggest, we are gonna try running Linux on Android without Root. No this is not a Debian No Root app that you can see in the playstore, but instead a Limbo PC Emulator. Lim&hellip;", "Hello guys, I have been using ubuntu for 15 months than i want to use dual boot OS so 1 week ago formatted my disk and firstly i installed Windows 8.1 then i installed Ubuntu.I used both with not problem but today i wanted to write some code so i opened Ubuntu but i  tried to connect wifi but i got&hellip;", "Hello guys , i have some problem about Network pentest.I read lots of security books for 1 year and i am working to be  Network Security intern in a bank but i don’t think i am improving my self.I have created my own security lab in virtual box.I installed metasploitable and i am trying to find vuln&hellip;", "Hello guys.I am working on basic project on Django.This project wants 2 values.One of them is target domain name and other value is count. After user click Attack button i take value from user i create process and this process send ping target amount count (i mean ping target -c count).But this atta&hellip;", "Hello guys.I am working on basic project on Django.This project wants 2 values.One of them is target domain name and other value is count. After user click Attack button i take value from user i create process and this process send ping target amount count (i mean ping target -c count).But this atta&hellip;", "import subprocess import time from multiprocessing import Process import os def Run(): proc = subprocess.Popen(’ping www.google.com -c 2000’.split(), stdout=subprocess.PIPE) output ,err = proc.communicate() print proc.pid if name == “main”: p = Process(target=Run) p.start() print “Attack&hellip;", "import subprocess import time from multiprocessing import Process import os def Run(): proc = subprocess.Popen(’ping www.google.com -c 2000’.split(), stdout=subprocess.PIPE) output ,err = proc.communicate() print proc.pid if name == “main”: p = Process(target=Run) p.start() print “Attack&hellip;", "Hey guys i had a problem so i need your help.I want to install opencv for ubuntu 16.04 , i read lots of tutorial and i tried a lots of method but i failed all time.Is there any tutorial you know is working for ubuntu 16.04. (English is my second language sorry for bad english)", "nothing happened like, no output?", "For example i followed bellow tutorial i did what i saw but after installed i run cmake command then i run make command but nothing has happened http://www.daslhub.org/unlv/wiki/doku.php?id=opencv_install_ubuntu&amp;s[]=opencv", "Hey guys i had a problem so i need your help.I want to install opencv for ubuntu 16.04 , i read lots of tutorial and i tried a lots of method but i failed all time.Is there any tutorial you know is working for ubuntu 16.04. (English is my second language sorry for bad english)", "Use send() instead of sr1().", "Thank you bro i didn’t realise that", "Hi guys.I am trying to write script which creates dns request packet using spoofed source ip adress.But scapy is waiting dns response packet.You know this packet’s response will not get back my computer because of source ip address was spoofed. How can i stop scapy to not wait response ?For exam&hellip;", "Hi guys.I am trying to write script which creates dns request packet using spoofed source ip adress.But scapy is waiting dns response packet.You know this packet’s response will not get back my computer because of source ip address was spoofed. How can i stop scapy to not wait response ?For exam&hellip;", "Thank you for helping.I am searching and learning new module.If i face any problem i will send message you", "Thank you for helping.I am searching and learning new module.If i face any problem i will send message you", "Hello guys.Before tell my problem i want to introduce myself.I am student at Computer Science department.I am interested in Security and Programing so I am coding python for months.I wrote lots of script about security(Port Scanner , DDOS , Reverse Shell etc.).This year i want coding Web Based Vulne&hellip;", "Hello guys.Before tell my problem i want to introduce myself.I am student at Computer Science department.I am interested in Security and Programing so I am coding python for months.I wrote lots of script about security(Port Scanner , DDOS , Reverse Shell etc.).This year i want coding Web Based Vulne&hellip;", "Guys i want to create tools like that but i want my project is based on Django Framework.I have beeing coing on python for 1 years.This project will be my finish project so How can i do ? is it posible  ? Have you got any tutorial to suggest me ?", "Guys i want to create tools like that but i want my project is based on Django Framework.I have beeing coing on python for 1 years.This project will be my finish project so How can i do ? is it posible  ? Have you got any tutorial to suggest me ?", "Hey guys my name is Adam and I am brand new to the area of linux and pentesting in general. I am starting my journey in pentesting by learning linux and some of the tools that pen testers use. I came across this site while looking for labs to do online and thought I would share it. If it has alread&hellip;", "Hi fellas, This article follows my previous post about Hacking operating system assessment, providing a complet review and my personal feedback apropos of Katoolin tool. Basically, once your setup ready, you probably want to get tools, wordlists and frameworks in order to be able to do your usual &hellip;", "Today well be learning how to do a simple ARP Spoof or ARP Poison in python. ARP spoofing can be used for a few things, DoS, MitM, Session Hijacking,Stripping SSL(technically mitm). Today well be using it for a basic Man in the Middle attack. So lets get started with some quick background info. &hellip;", "I have never heard of any of the tools you mentioned but nmap and tor. I use proxychains for scans through nmap that I want anonymous. You can route just about anything through tor using proxychains. You can also use whatever proxies you want, not just tor, when using proxychains.", "Seems like a great idea except what you’re asking is probably primarily should be asked to the Window’s guru: @dtm (Yes I summoned you). Anyways… feel free to ask whatever you wish and I’m sorry that’s how you feel like this. I personally don’t think as a community we have a lack of understanding of&hellip;", "*Question, whats up with my syntax highlighting? Every module you write has a  __name__ , but its mainly used for when you would be importing your module from another file. Setting __name__ to __main__ would make it so the defined block would get ran, only if the program was ran by itself. Otherwi&hellip;", "I managed a little the code to run better in Python3. Deleted the dependecy on xxd. Useful code. #!/usr/bin/env python# check_sigs.py - EnergyWolf 2016# Take a file path as argument, and check it for known file# signatures using www.filesignatures.net# pickling the signatures file makes subse&hellip;", "Thank you for sharing with us", "Knowledge is Power But like all power, there are those who want to keep it for themselves but em not one of them. I was feeling bored and I start checking my bookmarks and I found these linked in my bookmarks so I thought I should make a list and share with others because knowledge should be free .&hellip;"]}