{"user": "Archangel9", "history": ["0x00sec GuidelinesCore PrinciplesActions have consequences.You can learn anything from anyone.Ask good questions, not lazy ones.Everybody makes mistakes.Freedom of information is a right.ForumsWhen posting something on the forums, consider these points. Will this be helpful to users othe&hellip;", "These interviews are great! I am new to the community, and this gives me something to strive for!", "I always thought that the incognito mode was just to keep your gf from seeing your porn history.", "@RYUZ4KI @foxmulderx Cool Project! Also in addition to whatever service/VPN you use to go anonymous, you can also use different search engines while inside private browsing (incognito) mode, for example: https://duckduckgo.com/ or any type of search engine that allows additional security measures t&hellip;", "@RYUZ4KI Consider making/getting a planner that has a schedule in it and write down/type in where your deadlines are set. If it is on a phone, set an alarm to remind you of what you have. I recommend trying every other person’s way above. I personally find writing my schedule down is my better way &hellip;", "@RYUZ4KI Consider making/getting a planner that has a schedule in it and write down/type in where your deadlines are set. If it is on a phone, set an alarm to remind you of what you have. I recommend trying every other person’s way above. I personally find writing my schedule down is my better way &hellip;", "Here is what worked for me… I took a notebook and well, almost everyday I wrote down a To Do List. The only flaw is that I never looked at the list again. XD", "Make a work plan and stick to it for long enough to make it a habit. Repeat, repeat, repeat. Leave a generous portion of down-time to prevent burn out.  Isolate what’s important and use them as the foundation to build upon.", "I did a pretty comprehensive post on this in another thread.", "Yea I relaized how old the post was, however, I just didn’t have any closure on the topic. Also, I had found remnants of the site on… “the dark web”… lol (tor) and was just wondering if nobody just updated the thread with a new url or if it was dead, but now I know", "@Archangel9 I tend to be cautious with regard the short-term impact of AI-powered robots. There’s a generalized concerned about the fact that such a thing will happen shortly but looking at it from a “insider’s perspective”, things look quite different. Full-disclosure, several of us at Alias Robot&hellip;", "@Archangel9 I tend to be cautious with regard the short-term impact of AI-powered robots. There’s a generalized concerned about the fact that such a thing will happen shortly but looking at it from a “insider’s perspective”, things look quite different. Full-disclosure, several of us at Alias Robot&hellip;", "@alias How long do you think before AI is completely integrated into robots/machines? Obviously, they are touching base with it now, but overall like say until AI can independently work on its own, without the need of assistance???  -Archangel", "@alias How long do you think before AI is completely integrated into robots/machines? Obviously, they are touching base with it now, but overall like say until AI can independently work on its own, without the need of assistance???  -Archangel", "You’re really only limited here by your creativity, but here are a couple of examples off the top of my head: Quick and disposable C2 infrastructureReusable/sharable lab VMs (such as demonstrating an exploit)Creating a poisoned image and tricking someone into running it in their infra", "Although I’m late to this thread, I enjoy challenges a lot. So I’m going to put this on my to-do list. -Archangel", "This is a PoC-style test run for an application that I am currently developing as a personal project. Should anything weird happen, please report it to me and I’ll try to fix it. This is just a simple crackme so it shouldn’t be too hard once you start to figure out what’s happening… maybe…?  Diffic&hellip;", "", "Photoshop, running in wine, on Arch", "@fxbg Errrr… You realize you are posting this 2 years later, right?  Just Wondering. -Archangel", "Unfortunately not. This is literal and it only keeps getting worse.", "Did you paraphrased those statements? Otherwise they sound scary as hell.", "@Techno_Forg Photoshop…  …Adobe Illustrator possibly -Archangel", "@fxbg Errrr… You realize you are posting this 2 years later, right?  Just Wondering. -Archangel", "To kickstart this, I am going to share my setup: This is the imgur album if you wish to peruse, but I am going to post it below anyway:                                                                                  [Album] This is Croc0, and this is my i3wm setup.                          &hellip;", "Let’s not call BS on it quite yet… the scripts thus far could incomplete. I still need to study a bit longer. Please bear with me.", "f0rg, Run it first. It looks good so far. If you want you can try to create an ‘elif statement’ to make sure there aren’t any duplicate IP addresses in your code. It would go in between the ‘if statement’ and the ‘else statement’. But if you want to get even more complicated: use TRUE with the ‘if&hellip;", "f0rg, Run it first. It looks good so far. If you want you can try to create an ‘elif statement’ to make sure there aren’t any duplicate IP addresses in your code. It would go in between the ‘if statement’ and the ‘else statement’. But if you want to get even more complicated: use TRUE with the ‘if&hellip;"]}