{"user": "bl4ckbo7", "history": ["What’s up, everyone? This tutorial will show you how to configure your own vulnerable CTF server manually. There exist some scripts which do this job for you but it’s much better when you understand why these vulnerabilities work.  Before we start I recommend you document every change/step. Write &hellip;", "you are only permitted to be on 1 team at a time", "I’m thinking of creating a IRC channel for this except I don’t want to be OP… lol. @0x6e756c6c should be the OP since he is the creator of this thread (I also don’t know how to setup the IRC channel). Will talk to fraq about this being a potential and will update in the comments of this thread if I &hellip;", "The #htb channel on IRC is going to be the better place to ask these questions. This thread is solely for spreading info about joining the team.", "The bot is such a genious… undetectable… simply awesome!", "Damn dude… this is cool. Nice share. As pry0cc suggested, please do a write up. That would be awesome!", "Really nice tool! Can’t wait to look over and play with it! Besides that I totally agree with @pry0cc. A write up would be phenomenal! Especially, I would like to read more about your design and development process (e.g. what was your initial idea, how has it changed during development, what kind o&hellip;", "In fact mate @colental, you should definitely do a write-up here on your tool. How to use it and how you’ve designed it. That would be amazing.", "Glad to hear you’re interested in it man - I’m getting started on a write-up now!", "I’ll prolly read through your code and merge ZeroSpy with it. Good job and forget the haters. #Sergeant", "Same here. Actually, I was pretty surprised when I saw that this project belongs to someone from 0x00sec. I’ll check the source code as soon as I can. Thanks for such a great project.", "Good question - support for python3 may be implemented in the future, and my reasoning for choosing python2 may be flawed, so please let me know if I have over-looked something. One goal I had for this project was for it to “just work” without needing to install/configure anything - so basically th&hellip;", "Well Done bro , I’ve made my own botnet long time ago and after reading your source code i think you really made it well . it would be fun to work with you bro just tell me if u need any help .", "Well to my knowledge it’s installed on all major distros. Guess the exception is RHEL/CentOS and a lot of servers run that. So you have definitely made the right decision. Great work!", "What do you all think is the best botnet available at the moment? would you consider this one? What are some of the harder botnets to detect ?", "Nice write-up man! @pry0cc", "The bot is such a genious… undetectable… simply awesome!", "Nice write-up man! @pry0cc", "Clientside Exploitation - Tricks of the Trade 0x01 - Sharpshooter + SquibblyTwoHi! I hope you’re well, today I am going to show you something that is common knowledge in the red teaming community, people use this kind of thing every day without thinking about it. However, if you’re new to security,&hellip;", "The bot is such a genious… undetectable… simply awesome!", "https://github.com/colental/byob Built this to teach myself Python. Any thoughts?", "I spoke about my thoughts on this project on twitter and I disagree with what a lot of people are saying. Learning this kind of thing is really useful to understanding how a C2 works. This is the entire thing of offensive security. Good job dude! This could even be used for engagements to demons&hellip;", "Sure… that’s perfect!", "Sure… that’s perfect!", "Ya not looking for hand outs, reason i am on HTB is to sharpen my skills and keep me active obviously i wont turn down flags/walk trough/hints/tips", "We now have a newly created 0x00sec team on HackTheBox. Direct message me on 0x00sec or join #htb on IRC and leave a message with the regulars if you want to be added to the team. Notes: You cannot join more than one team on HTBThere is zero entry requirements to join our team. Just being an 0x&hellip;", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;"]}