{"user": "bluretrece", "history": ["Gracias por el aporte, compa!", "Hey folks! this topic details how to overflow a buffer, bypass DEP (Data Execution Prevention) and take control of the executable Recommended PrerequisitesC/C++ language, a basic level would be finex86 Intel AssemblyFamiliarity with Buffer OverflowDebuggers/DisassemblyThe binaryFile Virust&hellip;", "Hi 0x00’ers! If you had seen the last ‘show off your setup’ thread, Show off your setup! You’ll notice it was a huge success, and there was a tonne of beautiful systems and setups. Since it was a little while ago and a lot of people have already renewed their existing setup, got new hardware, jump&hellip;", "Are you trying to master the ELF format and you need some stuff to try your new skills?.. well, this is a simple challenge for you to try. The ChallengeA colleague that works as Network Engineer for an important company has captured a piece of malware that somebody was trying to use against the co&hellip;", "Those of you that are following me on twitter may have heard about STAN. This is my pet project to learn about reverse engineering. It was born as an experiment with the capstone disassembly framework (http://www.capstone-engine.org/), and it evolved in something usable for simple projects. If you &hellip;", "have been looking for Bind shell written in python and i found 2 scripts that look fine and the problem is that i dont know where to put my IP in both scripts in order to listen and get a connection… console.py is the attacker (the question is where to put my IP) server.py is the victim (the quest&hellip;", "Hello all again!It’s been a while since the  Python Package for creating backdoors thingie and all that time I have been researching a way to properly create a stager for a Python backdoor script that has dependencies. *You know stagers! The lil’ things that set the stage for the real thing to run&hellip;", "Suh doods, got another challenge which will probably be my last one for a while due to my lack of knowledge of the Linux system. I may make some Windows challenges if anyone wishes. If anyone would like the source code to this, please tell me! DifficultyDepends on your current knowledge. Persona&hellip;", "Hey 0x00sec! I’ll be taking a pause from my Data Structures series to introduce this community to Graph Theory with Dijkstra’s Algorithm. I only just barely understand this, so bare with me. Graph Theory (Brief)There are two main types of graphs: Directed Graphs are graphs whose edges go a cert&hellip;", "Alright! After receiving positive responses to my proposal, I’m ready to start this [C] Dynamic Memory series. Here are some suggested prerequisites: Basic Understanding of Imperative ProgrammingBasic C Programming KnowledgeConfidence with PointersAnd what pointers representWhether or no&hellip;", "Hello 0x00sec! Welcome to the maiden article of my series on Data Structures. Today, I’ll be talking about Linked Lists. What is a Linked List? Since, you can all read Wikipedia, I don’t really have to go into much detail. But, a Linked List is a datastructure with the following characteristics: &hellip;", "PrefaceAfter a break because life kept me busy the next part of this beginner series is here. I will try to finish these articles rather quick now if they are staying on the this level, since I wanna dive deeper into different waters but in the end I dislike unfinished projects. As always: I st&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "Here’s another fun Programming Challenge: Service Lane Source: https://www.hackerrank.com/challenges/service-lane Calvin is driving his favorite vehicle on the 101 freeway. He notices that the check engine light of his vehicle is on, and he wants to service it immediately to avoid any risks. Luck&hellip;", "Welcome back my trainee command-line ninjas! In this guide we will be covering some basic concepts and tricks to sending files to computers in the Linux shell. This can be extremely useful when you’re trying to share a backdoored executable to a machine on the same network, but don’t want to have t&hellip;", "The hardest GNU/Linux reverse engineering in the 0x00sec CTF 2017 event was OBFTEANATION. Only 2 person solved this challenge during the competition, so I guess some of you have been waiting for this write up. I just wrote it to be hard but I didn’t try to solve it myself until now. Of course it is&hellip;", "Shuffled Love (you need to register) was one of the Linux 64bits reverse challenges available to be solved during the recent 0x00Sec CTF Winter 2017 edition. This challenge was intended to be easy and at the end 42 persons were able to solve it. Before continuing, I’d like to say that there are man&hellip;", "Hi all! My first contribution in this community  I coded a small crackme for you, don’t know if this crackme is for advanced users or not, depending on the results I will change the difficult for future crackmes GOALGuess and post here the correct serial/key for this crackmeYou can crack or pat&hellip;", "BackstoryedgyReggie and DownerDanny of edgeS0ft have reviewed the results of the cracking attempts in the previous thread and are quite happy that there is progress in deterring crackers’ attempts at pirating the software. edgyReggie has also noticed that people have been able to share registration&hellip;", "Anyone who calls him/herself a hacker, should know about binary formats, especially if you are a low-level wizard. How well do you know the ELF? ###Difficulty Meh, probably easy. ###Rules Though it’s easy to identify what’s up, do justify why you patched the binary that way. ###Hints Hell &hellip;", "I solved it as it was intended. Feeling no glory now anymore with that hint being given by @_py tho  … Anyways…  First things first impressive solution  @ATGC . As in the extended solution above I first used tools like gdb readelf objdump xxd/hexdump on that file. I came to the s&hellip;", "PrefaceThis is a write-up for solving the devil-swapper RE challenge by @0x00pf . It was mostly intended for my personal archive but since it may be interesting to all of you I will try to format it in a clear and most importantly scrub friendly way for people like myself… Since I got stuck along&hellip;", "@bluretrece I replaced the link. You can download the binary from there", "@bluretrece I replaced the link. You can download the binary from there", "Hi @ricksanchez, thank you very much for this post! Any chance you still have a link for the binary for this tutorial? The link seems to be dead  Thanks in advance!", "In the name of Allah, the most beneficent, the most merciful. Hello everyone, i’ll be writing how it was expected for the tasks I made to be solved.  I finally found some free time, sorry for the late post. So, this article will be splitted to two main parts: I. babyheap II. left I. babyheap&hellip;", "Realmode Assembly - Writing bootable stuffPart 1: Theory and ConceptsWhat is this?This is going to be a walk-through in writing  Operation Systems in assembly which operate purely in Realmode. Goal will be writing different kernels from a simple “Hello World” over small terminal programs to gr&hellip;", "We have already seen how to infect a file injecting code into the binary so it gets executed next time the infected program is started. But, how to infect a process that is already running?. Well, this paper will introduce the basic techniques you need to learn in order to fiddle with other processe&hellip;", "Learning assembly takes a while, and it is a bit hard to jump straight into a modern processor and start coding… So, if you do not have any experience with the bare metal, it is good to start with a pretty simple assembly. And the simplest assembly I can recall is called RedCode Despite of being &hellip;", "Hello Hackers ! I’m back for a new tutorial on scripting with python, here I will teach you how to do web scraping. I needed to grab some proxy on internet to test proxychain so I decided to do a python script who will scrape the proxy for me. ProxyScrapingFirst of all you’ll need python and som&hellip;", "So recently I’ve been re-motivated to do some more game hacking and I thought that I’d do another article to introduce more aspects on top of what I’ve already shown from my previous ones. In the following document, I’ll be detailing the usage of DLL injection and its advantages, a fundamental conce&hellip;", "As @SmartOne suggested. It would be really cool to have a wiki with useful links. Simply edit this topic and away you go! Blogs Security blog(s) overviewPenetration Testing Blog by @hkh4cksNews The Hacker News Security Affairs WIRED (Security Category) SANS Newsletter(s) (For&hellip;", "Hello 0x00’ers! @zSec gave us the idea to make a Wiki with working services for things such as email relays, SMS spoofing and the like. Feel free to edit this and add things you have tried and tested. The more we add in useful things, with a very quick way to access them, the more useful this page w&hellip;", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "Hello peeps! Been a while. I hope you’re all doing great. This write-up was supposed to be up way sooner to be honest. Recently, @oaktree coded an IRC bot with dynamic linking features which motivated me to finally take the initiative and finish this god damn paper. So without further ado, @oaktree &hellip;", "Hi fellas, A few days ago, I decided to start my adventure in the reverse engineering domain. I was quickly overwhelmed by a bunch of information and op codes that confused me a lot, even with solid knowledge in assembly and programming. Reverse engineering can seem complex at the first glance, ho&hellip;", "As promised, here is the shellcode tutorial once again RequirementsAlright so this isn’t going to be msfvenom tutorial. (shellcodes are payloads). This tutorial will focus on writing shellcodes using Assembly. Knowledge of C and Assembly is highly recommend. Also knowing how the stack works is a&hellip;", "Welcome to this new series intended to explain the guts of all those hacker’s tools out there you use or want to use… Basically, we are going to explain you how does they work and how do you can build your own… Keep reading if you do not want to be a Skid ;). We will start the series with Proxychai&hellip;", "Hello everyone of 0x00! I figured why not make my first contribution, so heres a quick one  Today, im going to brush the topic of proxies, followed by how to set up ProxyChains to make being tracked a bit harder. So first things first. What is a proxy? In computer networks, a proxy server is a s&hellip;", "Since I’ve noticed quite a lot of interest in low-level stuff from the community recently, especially on IRC when it comes to reversing/exploit dev, below you’ll find some pwning/reversing challenges that I’ve enjoyed playing over the past months. Note: I won’t be referring to the ones everyone is &hellip;", "In a connected world, remotely accessing computers is happening all the time. You use services like ssh or telnet for that purpose but, sometimes, they are not available or it is not possible to even deploy those services in the target device. In those cases you can easily write your own remote shel&hellip;", "That’s what you get for making a binary so user-dependent. ###Diffuclty 4/10 ###Objective Get a shell. ###Rules ASLR on. No libc this time, it’s statically linked, thus its size. Full exploit + demo (i.e asciinema) are accepted as valid solutions. Just a screenshot of the shell does&hellip;", "Suh peeps! Another pwnable challenge! ###Difficulty Easy, but could be debatable. ###Objective Get a shell. ###Rules ASLR should be turned on!Since no libc is provided, all you have to do is pwn the binary locally.Full PoC is accepted as a solution. Just a screenshot of the shell doesn’t&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "In our walk in linux, there comes a point where we need to hack ( pentest ) in a safe environment. The first thing we usually do is install Virtualization Softwares and install all the distros our system can take. In stages of hacking, to compromise the victim machine, we need some sort of program t&hellip;", "In this paper I will present an elegant technique (it’s my opinion, indeed) to get shell access to a vulnerable remote machine. It is not my own technique but I found it very interesting. The focus of this paper is on this technique and not in the way to exploit the vulnerability. Setting your envi&hellip;", "Hello Hackers ! In this topic, I will share you some link and some tips on how to find good resources to learn “Hacking” The first thing to do is maybe learn a programming language I start in learning C when I was younger but I didn’t go too  deep in this programming language. A good starting poi&hellip;", "PrefaceThis write up are my thoughts and steps to analyze a given unknown binary. I want to understand the binary to a point where I can freely write about it. So here it is. I’m always open for you pointing out mistakes or giving feedback to me Disclaimer:I won’t look at the assembly code to p&hellip;", "What’s good, peeps? Before I start this topic, I’d like to sincerely apologise for the huge delay. At the time (before my exams started), I was hyped to deliver a second instalment of game hacking to the forums but I had lost interest due to the exhaustion gathered from exam preparation and particip&hellip;", "IntroductionAs a hacker or anything else related to security or hacking, you should know the most famous hacking attack a.k.a The Man in the middle Attack. This attack is the easiest attack that should be known by all of security engineer and hackers. I’ve seen a lot of people (mainly script kidd&hellip;", "Sup folks! I hope you are all doing great. It’s been a long time since my last CTF write-up. The main reason is because I was trying to master the beast called heap exploitation and I’ve yet to learn a ton about it. To showcase one of the modern ways to pwn a heap-based vulnerable binary, I’ll use a&hellip;", "Alright, 0x00 community! Here we go… Bubble Sort. What Is Bubble Sort?Bubble Sort is a certain sorting algorithm that is often used as an introduction to sorting. It is not the best sorting algorithm, but it is very easy to implement and works fast with small sample sizes. Bubble Sort works like&hellip;", "This was incredibly helpful. Thank you very much!", "Hi 0x00ers. This is my first post and my goal in it is to share and detail how you can exploit a buffer overflow by doing a detailed analysis of the executable and for that I will solve a challenge proposed by ricnar in its reversing course, it is clear that i just started on the subject of reversi&hellip;", "This was incredibly helpful. Thank you very much!", "BackstoryAfter reviewing some of the analysis of his software from the previous thread, edgyReggie thinks he knows where he went wrong. This time, he has made sure that no one will be able to find the new serial number after invalidating the previous one. Can you prove him wrong? DifficultyAuthor&hellip;", "Here’s some feedback: ELF isn’t a format only for executable files. There are also shared libraries and object files. Quoting every section of the book regarding ELF shows me that either you don’t understand the material in depth, or you didn’t bother trying to simplify the terms. Some drawing&hellip;", "Suhdudes. I’m back with another challenge but it will be different because this will be designed for Windows! Another thing I will be doing is a kind of “series” with these crackmes where each successive one will get incrementally more difficult. I will also supply research material (to replace hint&hellip;", "If you are reading this is because you want to be a hacker. Therefore, you are automatically a wannabe. It does not sound that cool, but it is actually pretty cool. It means that you still have a lot of exciting things to discover!!! First things first. This is going to be a joint course on C and a&hellip;"]}