{"user": "Bowlslaw", "history": ["Lots of “cool” books on hacking. Disturbing lack of low-level fundamentals.", "Has anyone read Learning Linux Binary Analysis? It covers a lot of what is covered here. In addition, it gives an excellent overview of the ELF format and goes over how to write Linux malware", "Perl master race: # Return binary representation of each integer, separated by a single space, given as a command line argument.sub binary {    my ($n) = @_;    return $n if $n == 0 || $n == 1;        my $k = int($n / 2);    my $b = $n % 2;    my $e = binary($k);    reverse $e.$b;}for&hellip;", "As @dtm has explained us how to write a crypter for Windows, and @TheDoctor has done the same for C#, I’m going to talk about how to build similar stuff for GNU/Linux. This post is kind of based on something else I wrote some months ago for a different community. I had tried to make a twist of the o&hellip;", "Hello, On lines 15-18, why does the author use big wise operators in that way? What, exactly, is the purpose? Here is a description of the program in the author’s own words: “ In Linux, the default ptrace() behavior is such that it allows you to write Using PTRACE_POKETEXT to segments that are &hellip;", "Hi @Bowlslaw Check section Understanding Paging in", "Hi @Bowlslaw Check section Understanding Paging in", "Hello, On lines 15-18, why does the author use big wise operators in that way? What, exactly, is the purpose? Here is a description of the program in the author’s own words: “ In Linux, the default ptrace() behavior is such that it allows you to write Using PTRACE_POKETEXT to segments that are &hellip;", "WWW::Mechanize library is what I use in Perl. Basically WWW::Mechanize is kind of like a browser in a script. (@nugget please correct me if I’m wrong). Documentation: http://search.cpan.org/~oalders/WWW-Mechanize-1.86/lib/WWW/Mechanize.pm This is quick and dirty as @pry0cc stated, but I would thi&hellip;", "Userland API Monitoring and Code Injection DetectionAbout This PaperThe following document is a result of self-research of malicious software (malware) and its interaction with the Windows Application Programming Interface (WinAPI). It details the fundamental concepts behind how malware is able to&hellip;", "@pry0cc, you really have to check this… code injection using ROP without ptrace from BASH! Do not underestimate the power of the shell!!", "I must say, this is the coolest thing I have ever seen. An ELF file injector in bash. I feel as if this needs its own topic. I have to share this nonetheless. Mind == Blown.", "For the LuLZ  This is a 17 LoC, multi-architecture virus (works on x86 -32/64bits-, ARM, MIPS, PowerPC,…). It increases the infected binary in less than 350 bytes!!!. Feel the power of Bash! Best language ever for virus development!! #!/bin/bash#AMiINFECTEDfor f in *; do        if [ ! -z `fi&hellip;", "I wanna join the next one and blow your minds", "Oopsie daisie…", "But How about bitwise?", "This isn’t going to be specifically about OpenBSD, because without taking Linux in comparison, you’ll miss details on how things have turned out to be. I have been spending some time lately following what the situation is on the BSD front and in the Linux community, and I apologise in advance if I h&hellip;", "#0x00ctf 2017Hello fellow nullers and lurkers alike, today we are very pleased to announce the biggest 0x00sec CTF of 2017! 0x00ctf will have challenges focussed mainly on Pwning and Reverse Engineering. timedatectl&gt;&gt; 12:30pm December 15th 2017 UTC-50x00ctf will begin at 12:30 pm US Eastern tim&hellip;", "Perl master race: # Return binary representation of each integer, separated by a single space, given as a command line argument.sub binary {    my ($n) = @_;    return $n if $n == 0 || $n == 1;        my $k = int($n / 2);    my $b = $n % 2;    my $e = binary($k);    reverse $e.$b;}for&hellip;", "In college at a liberal arts school and am “subjected” to diversity requirements. They’re annoying and take away from my technical education, but I do think I become a more well rounded and socially conscious person.", "Are you a newbie who’d like to get into web penetration testing? This might be of help: https://pentesterlab.com/bootcamp", "I think it’s only worth going to college for two reasons: You need access to equipment you would otherwise be unable to access, financially, legally, or otherwise, such as the Large Hadron Collider, or a lab full of deadly microbes. Your professional requires some kind of state license, like m&hellip;", "IntroductionI have noticed that many beginners have trouble understanding binary, hex, octal, etc. I will attempt to show you how to use and understand any number system mainly using your pre-existing knowledge of how numbers work. Author Assigned Level: NewbieCommunity Assigned Level:Newbie&hellip;", "Love this. Want me to weaponize pine too and then we can have an IRC bot arms race? (Only for giggles, obviously)", "Running Nmap from Chat with LegobotChatops for hackers! For those of you who saw my shenanigans in IRC earlier, this is the promised post on what I was doing. For those who missed it or don’t hang out in IRC, shame! This is an announcement of a new package I released today, description of how to u&hellip;", "Hello! Welcome to my first tutorial about the ELF format, the ARM processor, and how to code a debugger for it. Ever wondered how a debugger works? Ever wondered how a debugger works on an ARM processor? In this series of articles, I am going to go from start to finish on how to code a simple debu&hellip;", "#Intro Hello fellow nybbles Null Bytes and Nullers! Today we are going to be discussing a fairly trivial exploit (FUSION level0) written in a language with very few pre-written hacking toolsets and libraries. We are a bit spoiled by pwntools and all of the SO questions on “how to implement a buffe&hellip;", "Hello! Random-man reporting. So this is gonna be a quick write up on some basic neural network stuff, and I’ll probably divide it in 2 parts. First off, let me say that I’m not a professional computer scientist or mathematician. I want to head down that route when I get to the point in life, but for&hellip;", "Hello! Welcome to my first tutorial about the ELF format, the ARM processor, and how to code a debugger for it. Ever wondered how a debugger works? Ever wondered how a debugger works on an ARM processor? In this series of articles, I am going to go from start to finish on how to code a simple debu&hellip;", "It was my understanding that memory is “freed” on exit when the process is taken out of memory. The whole point of free is to be able to reuse memory… After all, memory is finite – scarce on Windows.", "Hello! Welcome to my first tutorial about the ELF format, the ARM processor, and how to code a debugger for it. Ever wondered how a debugger works? Ever wondered how a debugger works on an ARM processor? In this series of articles, I am going to go from start to finish on how to code a simple debu&hellip;", "Heh, I’ve got the books to go with this. This post you got off of machacking looks like a rip from said manuals. Here’s what the schematics of those look like (The Second schem. &amp; PC board are nonexistent in my copies though): Materials:---------1 1.8K 1/2 Watt Resistor1 1.5V LED1 SPST Switch&hellip;", "Is it true that the exit library function frees memory as part of its functionality?", "Hello! Welcome to my first tutorial about the ELF format, the ARM processor, and how to code a debugger for it. Ever wondered how a debugger works? Ever wondered how a debugger works on an ARM processor? In this series of articles, I am going to go from start to finish on how to code a simple debu&hellip;", "Yeah, I feel like Android and IOS exploitation and reverse engineering is a seldom talked about topic considering most people keep their entire lives on these devices, couple that with the fact it has a GPS and you are talking about basically getting inside that person’s mind, seeing what they see /&hellip;", "Hello! Welcome to my first tutorial about the ELF format, the ARM processor, and how to code a debugger for it. Ever wondered how a debugger works? Ever wondered how a debugger works on an ARM processor? In this series of articles, I am going to go from start to finish on how to code a simple debu&hellip;", "Thanks a lot for the feedback. I will take it under consideration.", "Here’s some feedback: ELF isn’t a format only for executable files. There are also shared libraries and object files. Quoting every section of the book regarding ELF shows me that either you don’t understand the material in depth, or you didn’t bother trying to simplify the terms. Some drawing&hellip;", "Hello! Welcome to my first tutorial about the ELF format, the ARM processor, and how to code a debugger for it. Ever wondered how a debugger works? Ever wondered how a debugger works on an ARM processor? In this series of articles, I am going to go from start to finish on how to code a simple debu&hellip;", "Hello! Welcome to my first tutorial about the ELF format, the ARM processor, and how to code a debugger for it. Ever wondered how a debugger works? Ever wondered how a debugger works on an ARM processor? In this series of articles, I am going to go from start to finish on how to code a simple debu&hellip;", "Hello! Welcome to my first tutorial about the ELF format, the ARM processor, and how to code a debugger for it. Ever wondered how a debugger works? Ever wondered how a debugger works on an ARM processor? In this series of articles, I am going to go from start to finish on how to code a simple debu&hellip;", "Hello! Welcome to my first tutorial about the ELF format, the ARM processor, and how to code a debugger for it. Ever wondered how a debugger works? Ever wondered how a debugger works on an ARM processor? In this series of articles, I am going to go from start to finish on how to code a simple debu&hellip;", "I’d actually really like to see a generalized phone hacking section with everything for old touch-tone phone phreaking to Android / iPhone rooting and hacking.", "https://ghostbin.com/paste/6kho7 https://pastebin.com/BMb543G9 On July 5, 2015, Hacking Team’s Twitter account was compromised by an unknown assailant who ended up publishing 400GB of data including alleged e-mails, invoices, and source code of the company. Zero days for Adobe Flash( CVE-2015-5119&hellip;", "This is for Deshi, welcome to the early-mid 90s, Original txt file from Machacking.net (&gt;Introduction&lt;)What is a BLACK BOX? A BLACK BOX is a device that is hooked up to your phone that fixes your phone so that when you get a call, the caller doesn’t get charged for the call. This is good for call&hellip;", "Hey guys my name is Adam and I am brand new to the area of linux and pentesting in general. I am starting my journey in pentesting by learning linux and some of the tools that pen testers use. I came across this site while looking for labs to do online and thought I would share it. If it has alread&hellip;", "Realmode Assembly - Writing bootable stuff - Part 3Part 3: Building &amp; RunningWhat is this?This is going to be a walk-through in writing an Operation System in assembly which operates purely in Realmode. Goal will be writing different kernels from a simple “Hello World” over small terminal progr&hellip;", "Check out this awesome repo of material, it’s got something for everyone! http://index-of.es/ ~ IoTh1nkn0t", "Interesting idea. A bit weird. Interesting. What is the goal with this method of encoding?", "#Continued Fraction Data Encoding I’m learning to program and some time ago while thinking about a new project I came up with an idea to use continued fraction as an method to encode data that would produce unique result each time even if the input was always the same. I would like to hear your th&hellip;", "Fret not! Part 3 is being worked on.", "Fret not! Part 3 is being worked on.", "It’s been a while since the last edition (I do say this every time). Behold, a seventh article! Allow me to restate the prerequisites: Proficiency in CUnderstanding of the Stack vs HeapFamiliarity with this article’s predecessors (all of them).Disclaimer: what follows are my findings, and my &hellip;", "It’s been a while since the last edition (I feel like I say this every time). What you’re looking at is the sixth installment of my [C] Dynamic Memory Series. I’ll start this paper by enumerating some prerequisites: Proficiency in CUnderstanding of the Stack vs HeapUnderstanding of sbrk and br&hellip;", "#0x00sec CTF Writeup - Forward then ReverseSo yeah, I finally got time to write a writeup for @Deshi’s CTF but I sadly only have stuff written down for the RE challenge (mainly because the other stuff I solved was pretty easy and didn’t require more than a quick google search or simple stuff like &hellip;", "needs moar IIS", "For Pentesting, a lot of corporate networks are going to be using Windows Server at some point in their stack. Usually a domain controller or even just a samba file share. Thus, my post-exploitation skill in the windows environment is woefully subpar when compared with Linux. I think a live CTF on &hellip;", "For Pentesting, a lot of corporate networks are going to be using Windows Server at some point in their stack. Usually a domain controller or even just a samba file share. Thus, my post-exploitation skill in the windows environment is woefully subpar when compared with Linux. I think a live CTF on &hellip;", "I’d say being able to set up our own, members-only lab environment would be incredible, and push the community to another level. It would facilitate more(and different) CTF events, teach people about Windows(Linux is drastically over represented), etc.", "I’d say being able to set up our own, members-only lab environment would be incredible, and push the community to another level. It would facilitate more(and different) CTF events, teach people about Windows(Linux is drastically over represented), etc.", "I’d say being able to set up our own, members-only lab environment would be incredible, and push the community to another level. It would facilitate more(and different) CTF events, teach people about Windows(Linux is drastically over represented), etc.", "I’d say being able to set up our own, members-only lab environment would be incredible, and push the community to another level. It would facilitate more(and different) CTF events, teach people about Windows(Linux is drastically over represented), etc.", "[image]", "In Part I of this series we learn how to enable a very basic remote shell access to a machine. In this second part we are going to modify the code to support some level of manipulation of the data transmitted over the link. Specifically, we are going to encrypt the data stream… :o LEVEL: Beginner H&hellip;", "Hello 0x00’ers! @zSec gave us the idea to make a Wiki with working services for things such as email relays, SMS spoofing and the like. Feel free to edit this and add things you have tried and tested. The more we add in useful things, with a very quick way to access them, the more useful this page w&hellip;", "Reverse Engineering and Crackme challengesThis topic is an aggregation of Crackme and reverse engineering challenges developed for 0x00sec. Please discuss the challenges in the thread they were originally posted or on IRC in #challenges This curation is based entirely on my own whim and not a comp&hellip;", "The CTF is now over. There would of been 4 hours remaining but somehow the platform took a crap and i can’t even export the team scores so i will post the teams that actually scored anything and following that the specifics of who captured a challenge first. Thanks to all the teams that participated&hellip;", "if you created a team and had problems i promise you your team is there ctf is now open and underway. the reason for confusion is because i disabled logins till the game start", "He’s correct; my team was created. Thanks for putting this awesome CTF together for us!", "Thanks!. Beginners are the future", "In a connected world, remotely accessing computers is happening all the time. You use services like ssh or telnet for that purpose but, sometimes, they are not available or it is not possible to even deploy those services in the target device. In those cases you can easily write your own remote shel&hellip;", "If you have been following this series, you may remember that I started Part I with an use case involving remote access to an Android Phone. This part will cover how to get a remote shell access to your phone and other devices. Actually, deploying our remote shells in a device is nothing special, b&hellip;", "Realmode Assembly - Writing bootable stuff - Part 2Part 2: Hello World BootloaderWhat is this?This is going to be a walk-through in writing an Operation System in assembly which operates purely in Realmode. Goal will be writing different kernels from a simple “Hello World” over small terminal p&hellip;", "Same Problem for the 2nd name turning red when I fill out all of my team information!!!", "I am having the same problem. I have tried inputting emails and no email tried all types of names,nothing I’ve tried has worked", "I am having the same problem. I have tried inputting emails and no email tried all types of names,nothing I’ve tried has worked", "[image]Holy shit dude this is awesome!!! &lt;3", "The following paper documents a possible PE file infection technique which covers a high level overview and the low level code of how both the infection and the resulting payload is executed. Please note that some of the following material may not be suited for beginners as it requires: Proficiency&hellip;", "UPDATE: Please refer to Linux Internals - The Art Of Symbol Resolution for a more detailed and updated analysis of the concept. Hey peeps! I hope you’re all doing great. It’s been a long time since my last post. Anyway, today I present to you something completely different from what you’ve been use&hellip;", "Hello folks! I hope you’re all doing great. After a disgusting amount of trial and error, I present to you my solution for the console pwnable. Unfortunately, I did not solve the task on time but it was fun nevertheless. I decided to use this challenge as a way to introduce to you one of the ways yo&hellip;", "I can’t seem to register. I fill out all of the information, but the 2nd name turns red and it does not let me continue. I have tried all sort of names, but it won’t let me register. What am I doing wrong? I wanna play ;-(", "Anyone who calls him/herself a hacker, should know about binary formats, especially if you are a low-level wizard. How well do you know the ELF? ###Difficulty Meh, probably easy. ###Rules Though it’s easy to identify what’s up, do justify why you patched the binary that way. ###Hints Hell &hellip;", "This place is so awesome. I was like, “hey, let’s google how to do that” and the VERY FIRST LINK was an 0x00sec tutorial. You guys rock. Edit (by oaktree):", "The Greedy Brothers Corp. has approached you, young wannabe, to solve a pretty nasty issue. Many machines have been infected by a mysterious ransomware. The IT department from the Greedy Brothers Corp. have found a dropper in some of the machines but no track of the actual malware… except, of course&hellip;", "Hello 0x00sec! This is the fifth installment of my Dynamic Memory series. In my last article, I went through using brk and sbrk to alter a process’s program break. After a decent amount of studying, I have some code to show all of you. I set out to roughly implement malloc and free and I have done&hellip;", "Hi everyone! It’s been a while since Part 3, but rest assured that the wait has been worth it! (I hope) This paper will cover the Linux versions of two system calls that are paramount in memory management. The same system calls, possibly different in implementation, exist on *BSD and its derivative&hellip;", "The last two (1 and 2) articles covered the main differences between stack/heap as well as using arrays on the heap. Now, I’m going to walk you guys through resizing these heap-allocated arrays. See, you might not always know – at compile time – how much memory you will need. Thus, we can write cod&hellip;", "Alright. Because I like doing these and find this topic to be “okay”, difficulty-wise, I’m doing two articles in two days. This is Part 2.0, the followup to Part 1.0, which was about using malloc and free on pointers. In this article, we’ll be using the same functions (malloc and free), but with ar&hellip;", "Hello peeps! Been a while. I hope you’re all doing great. This write-up was supposed to be up way sooner to be honest. Recently, @oaktree coded an IRC bot with dynamic linking features which motivated me to finally take the initiative and finish this god damn paper. So without further ado, @oaktree &hellip;", "Alright! After receiving positive responses to my proposal, I’m ready to start this [C] Dynamic Memory series. Here are some suggested prerequisites: Basic Understanding of Imperative ProgrammingBasic C Programming KnowledgeConfidence with PointersAnd what pointers representWhether or no&hellip;", "I’d be interested on such a tool whenever is ready", "Thanks for the help and advice! I want to do something useful in which I will learn a lot. I have no idea how long this may take me, hehe, but it would just be sooo useful for ARM processors", "Thanks for the help and advice! I want to do something useful in which I will learn a lot. I have no idea how long this may take me, hehe, but it would just be sooo useful for ARM processors", "@Leeky pointed out some of the issues. After looking a bit into ftrace, you will really have to change quite some code. Most of the ELF related stuff should be fine, but in addition to the jump opcodes you may also have to rework the break points (that uses a different instruction on ARM) and specia&hellip;", "Hello! I have a problem. I have been going through Ryan “elfmaster” O’Neill’s Learning Linux Binary Analysis, and have found two of his tools to be clever and very useful. Namely, ftrace and Extended Core File Snapshot. I want to use these on an ARM processor. Can anyone point me in the right dire&hellip;", "If you’re talking about assembly, converting it would most likely require a port… This is pretty much why higher-level languages, like C, were made.", "Actually all of this can be read from the ELF File header.", "Well yeah but you would need to change alot more things (I’ve only looked at the ftrace). for example the branch_table would need ARM opcodes instread of x86 opcodes. Also like you noticed the user_regs_struct needs adjustments to be ARM compatible (usage of ARM registers instead of x86).You also &hellip;", "This code, for example: #ifdef __x86_64__    esp = pt_reg.rsp;    eip = pt_reg.rip;    eax = pt_reg.rax;    ebx = pt_reg.rbx;    ecx = pt_reg.rcx;    edx = pt_reg.rdx;    esi = pt_reg.rsi;    edi = pt_reg.rdi;    #else    esp = pt_reg.esp;    eip = pt_reg.eip;    e&hellip;", "Hello! I have a problem. I have been going through Ryan “elfmaster” O’Neill’s Learning Linux Binary Analysis, and have found two of his tools to be clever and very useful. Namely, ftrace and Extended Core File Snapshot. I want to use these on an ARM processor. Can anyone point me in the right dire&hellip;", "Hello! I have a problem. I have been going through Ryan “elfmaster” O’Neill’s Learning Linux Binary Analysis, and have found two of his tools to be clever and very useful. Namely, ftrace and Extended Core File Snapshot. I want to use these on an ARM processor. Can anyone point me in the right dire&hellip;", "Realmode Assembly - Writing bootable stuffPart 1: Theory and ConceptsWhat is this?This is going to be a walk-through in writing  Operation Systems in assembly which operate purely in Realmode. Goal will be writing different kernels from a simple “Hello World” over small terminal programs to gr&hellip;", "broadpwn is a heap overflow on Broadcom Wi-Fi chips. It’s triggered when a device receives a WME (Quality-of-Service) information element with a malformed length from a connected network : http://boosterok.com/blog/broadpwn/ and http://boosterok.com/blog/broadpwn2/ for the exploitation", "Nice article. I would just like to add one more point for choosing a vpn (be it for masking geolocation and traffic or for business purposes); Types of vpns differ extensively in implementations: protocols and stacks which support them. Take into account which protocols are supported by a vpn prov&hellip;", "What Is a VPN?VPN = Virtual Private NetworkIt’s a service that offers you anonymity to a certain extent. It creates a tunnel from your PC, to the server you are connecting to, and encrypts that tunnel so nobody can read whatever data is being transmitted. So you will be safe from eavesdropping, &hellip;", "I have 1 main workstation PC that I dual-boot Win7 or Linux from. I have a laptop. I also use my Raspberry Pi configured for ssh and VNC. It gives me a good variety. I can practice with ARM, x86, and x64. I recently bought a great wireless dongle to plug into my pi(for use of Kali with it) or my&hellip;", "tl;dr, don’t necrobump please. We allow it so that discussions aren’t arbitrarily limited. Please don’t abuse it. The UD defines Necrobumping as “[reviving] a long dormant forum thread by adding a new post, thus bringing it to the top of the forum list.” In the format of forums, this is bad etiqu&hellip;", "https://webchat.anonops.com/ Though this is the surfaceweb/NSA?/FBI? Anon chat Anonymous is scattered and not centralized. You can find the most of  Anonymous on Tor / I2P. Any group calling themselves Anonymous Official or whatever, is either feds or money making company.", "Good job perl -e ‘print &quot;t&quot;x 0x10’ &gt; keyfile.dat", "I agree, except for the college part. College ,as a whole, is a corrupt waste of money and, most importantly, time. With intelligent use of the internet, one can find everything one needs to teach themselves. Also, find a good hackerspace or something.", "Actually I often read and heard people talk about it as well that they might prefer people with a good CS degree over someone who pursued a degree like “IT-Sec” or “Net-Sec” for the sole reason that CS lays a broader foundation and makes people gather different experiences and approaches to things. &hellip;", "Buy a laptop, cash, download tails in an internet café. Install it. Tada.", "I would assume it’s the more “intense” technical fields, like malware research and cryptography, right? Malware research requires an enormous breadth and depth of skills and how to apply theory, and cryptography requires specialized mathematics knowledge and a thorough understanding of higher mathe&hellip;", "Now that I am getting ready to graduate soon with a Comp. Sci. degree I have started to see that the companies have been talking to are more impressed at what I’ve taught myself (literally all my knowledge on networking and security) then what I learned in class. @Bowlslaw Is absolutely right , but &hellip;", "Buy a laptop, cash, download tails in an internet café. Install it. Tada.", "I think it’s only worth going to college for two reasons: You need access to equipment you would otherwise be unable to access, financially, legally, or otherwise, such as the Large Hadron Collider, or a lab full of deadly microbes. Your professional requires some kind of state license, like m&hellip;", "Now that I am getting ready to graduate soon with a Comp. Sci. degree I have started to see that the companies have been talking to are more impressed at what I’ve taught myself (literally all my knowledge on networking and security) then what I learned in class. @Bowlslaw Is absolutely right , but &hellip;", "With regard to the VPN: Wouldn’t the NSA be able to track your progress and searches for things like, “VPN service in China” or something?", "I think it’s only worth going to college for two reasons: You need access to equipment you would otherwise be unable to access, financially, legally, or otherwise, such as the Large Hadron Collider, or a lab full of deadly microbes. Your professional requires some kind of state license, like m&hellip;", "The best way to learn is to be self taught. IMO. Self taught hackers often run circles around somebody who just took the class, because they have a passion and drive to learn their topic. College is a necessary evil for many, since jobs often require degrees, now a days especially.", "I agree, except for the college part. College ,as a whole, is a corrupt waste of money and, most importantly, time. With intelligent use of the internet, one can find everything one needs to teach themselves. Also, find a good hackerspace or something.", "I agree, except for the college part. College ,as a whole, is a corrupt waste of money and, most importantly, time. With intelligent use of the internet, one can find everything one needs to teach themselves. Also, find a good hackerspace or something.", "U have to learn Low levels in college, before taking on pen testing.", "The CTF I have been developing will be launched as is, with 15 challenges. There are no web challenges on this one. It is mostly forensics type categories,  since I lost some help when I first started this project. This will be for 0x00sec members only for final scoring to count, otherwise, open to&hellip;", "Stealing the Network: The Complete Series Collector’s Edition, Final Chapter, and DVD : https://www.amazon.com/Stealing-Network-Complete-Collectors-Edition/dp/159749299X the art of electronics : https://www.amazon.fr/Art-Electronics-Paul-Horowitz/dp/0521809266 modern operating system : www amazon &hellip;", "Hello, 0x00sec! Before discussing my project, I want to introduce myself a little; if you’re more interested in xcreds, feel free to skip to the bottom. Introduction I’ve been reading 0x00sec for a while, but have held off from creating an account until I had something interesting to share. I use&hellip;", "Trail of Bits’ CTF Field Guide I think this has been out there for a while. I searched this site and couldn’t find anything for this, so I apologize if I am repeating something. This thing is like a full course…extremely interesting. BTW, I would recommend some understanding of C, specifically po&hellip;", "Unless you have inflammatory bowel disease, it’ll take a while to finish everything if you do the exercises xD", "Thanks for sharing this, looks like a nice read while on the throne, where I do all my reading", "Trail of Bits’ CTF Field Guide I think this has been out there for a while. I searched this site and couldn’t find anything for this, so I apologize if I am repeating something. This thing is like a full course…extremely interesting. BTW, I would recommend some understanding of C, specifically po&hellip;", "Trail of Bits’ CTF Field Guide I think this has been out there for a while. I searched this site and couldn’t find anything for this, so I apologize if I am repeating something. This thing is like a full course…extremely interesting. BTW, I would recommend some understanding of C, specifically po&hellip;", "Trail of Bits’ CTF Field Guide I think this has been out there for a while. I searched this site and couldn’t find anything for this, so I apologize if I am repeating something. This thing is like a full course…extremely interesting. BTW, I would recommend some understanding of C, specifically po&hellip;", "Hello fellas, this is my first thread where I will show you T50 one powerful tool that can send lot of packets (tested on my own server and hitting fine). First you can download T50  here. If you want to run a stress test, run t50 (IP) -flood -S(this is protocol)(optional --turbo) in a termina&hellip;", "Oh yeah, I remember seeing this CTF Guide when I wasn’t very interested in CTFs. Now I’m very interested in them and this would be a nice resource. Thanks for sharing", "Trail of Bits’ CTF Field Guide I think this has been out there for a while. I searched this site and couldn’t find anything for this, so I apologize if I am repeating something. This thing is like a full course…extremely interesting. BTW, I would recommend some understanding of C, specifically po&hellip;", "Thank you for your post. I’m 6 months into the journey to learn pen testing on my own, and I’m attempting to lay foundational groundwork (networking, security, programming, OS, etc… i want all the knowledge) over the next couple years. I only recently immersed myself in this world. I’ve always staye&hellip;", "Hi fellas, Following my last article, RE for beginners: Methodology and tools, I decided to do this write up in order to present you another common issue that people, exercising in this area, should be quickly confronted to, anti-debugger technologies. For the sake of this article, I picked a chal&hellip;", "Keeping this post open for promo codes  Check back soon!", "HeadingHello 0x00’ers. I thought it would be cool to make a post specific to XOR encryption. At the moment my main focus is getting the basics of python down but, that doesn’t mean I don’t have the time for a little fun with c++  I’m not the most knowledgeable person so I apologize if I make a mis&hellip;", "Please don’t post solutions / walkthroughs. I STRONGLY recommend everyone to read this: https://www.hackthebox.eu/en/home/rules Especially Rule 7. I think it’s not fair to participate in such an awesome learning experience, that is - on top of that - offered for FREE and then shit all over their &hellip;", "I think below books can be useful The_Art_of_Human_Hacking | Social EngThe-shellcoders-Handbook | ShellcodeWiley.Android.Hackers.HandbookAnd bladerf instead of hackrf", "I added an ARM programming/architecture book and some windows internals.", "I added an ARM programming/architecture book and some windows internals.", "Well, please add some then…", "Lots of “cool” books on hacking. Disturbing lack of low-level fundamentals.", "Funny. I just purchased an Alfa for my Pi", "Wow, how a phone like this can go fluid after 5 years, we are talking of Android 2 right? You reminded me of my old smartphone (LG L7 II), that phone was light and strong, and I broke the phone while I was demonstrating to a friend that was indestructible ahahaha Very good purchase!", "Funny. I just purchased an Alfa for my Pi", "Funny. I just purchased an Alfa for my Pi", "They have the ability, that does not mean they should be used. An Alfa card is far better at it. A Pi with an Alfa card connected and a power supply in your backpack is the best device you could have.", "Hi There, I have been looking in Google Reset Recovery Method for gmail for quite some time. Before April 2017 Anyone could have reset gmail password using correct account creation date and month with a tolerance value of 4 months if you are initiating recovery process from a trusted home network&hellip;", "Has anyone read Learning Linux Binary Analysis? It covers a lot of what is covered here. In addition, it gives an excellent overview of the ELF format and goes over how to write Linux malware", "Welcome to my first challenge! If you’re interested in becoming a reverse engineer, it’s important that you have a strong background with low level data and can understand the process of disassembly and debugging. Details of the ChallengeA friend of yours is an arts major but he hasn’t been making&hellip;", "@Nitrax Great introduction to that huge chapter of reversing. On a side note you mentioned PEDA. Maybe you wanna check out GEF. As a reference from ther wiki: ###But why not PEDA? Yes! Why not?! PEDA is a fantastic tool to do the same, but only works for x86-32 or x86-64x whereas GEF supports&hellip;", "You could hire spiderman out. I’m sure he does kids parties and the odd red team engagment. [image]", "With the announcement of pupper and a few other things over these last few months, our collaborative effort is off to a nice start. Many of us regulars have been working together on a handful of projects. We’re now offering a place to put all those projects! In order to draw in more of you, the Adm&hellip;", "I will have to be a red teamer at least for a while in my life. It’s absolutely a dream job of mine, and I can imagine it being very fun !  It would be nice if you could share, of course anonymized, experiences/stories in your job. (You know, these stories one tells everyone to feel cool )", "Most drones make enough noise to be recognized. Do you know any that wont?", "Suh doods, got another challenge which will probably be my last one for a while due to my lack of knowledge of the Linux system. I may make some Windows challenges if anyone wishes. If anyone would like the source code to this, please tell me! DifficultyDepends on your current knowledge. Persona&hellip;", "Hi fellas, A few days ago, I decided to start my adventure in the reverse engineering domain. I was quickly overwhelmed by a bunch of information and op codes that confused me a lot, even with solid knowledge in assembly and programming. Reverse engineering can seem complex at the first glance, ho&hellip;", "reads doesn’t see perl ️", "Hey Mates, I wanted to support this community with a new series about cracking self-made applications. In this series I’ll give you some applications especially made for cracking the password, license mechanism, etc. in different languages like Python (Easy for RE), C# (An interesting language for &hellip;", "reads doesn’t see perl ️", "Your weekend challenge is here! This is a simple challenge. Do not look for very sophisticated stuff. You know… the devil’s in the details. Boring to deathEasyInterestingWTF0voters Show results#Objective You have to find the secret key and the secret message. That’s it Extra&hellip;", "Just reorganised my e-book and other PDF resources and uploaded them onto my GitLab. Entry-level stuff here, mostly RE or malware or AV detection evasion content since I don’t dabble much in the other areas so if any of you are interested in that stuff, go nuts. I might update the READMEs in a futur&hellip;", "Ello Badass 0x00’ers! “Use a VPN!”, “Use Tor!”, “What, you don’t use a VPN?” These are probably just some of the phrases you have heard thrown about privacy. Using a VPN will help you stay safer from adversaries attempting to discover your identity. Perhaps you wish to remain anonymous from corpor&hellip;", "[image]  Note: I am not suggesting this as replacement of your Linux shell, simply for learning purposes without having to boot into Windows, another tool in your belt. Here is an article by OTW on the subject of PowershellSo, Microsoft went to bed and bumped their head and now Powershell is ope&hellip;", "What about some kind of drone? A small, quiet one? You film difficult-to-access, or inaccessible, areas quickly and safely. You could also, say, drop a prepared RPi or something similar into an area to extend your range.", "What about some kind of drone? A small, quiet one? You film difficult-to-access, or inaccessible, areas quickly and safely. You could also, say, drop a prepared RPi or something similar into an area to extend your range.", "What about some kind of drone? A small, quiet one? You film difficult-to-access, or inaccessible, areas quickly and safely. You could also, say, drop a prepared RPi or something similar into an area to extend your range.", "Some people say that there are three things you have to do before you die: Write a book, have a child and plant a tree. Actually, the three things you have to do before you die are: write your own IRC bot, create a massive framework that only you will ever use and code an awesome  Linux kernel modul&hellip;", "What’s in a Red Team?If you’re interested in information security, you’ve probably heard “penetration testing” and “red teaming” used interchangeably. However, for those of us actually doing red teaming, they’re not necessarily the same. So what do they mean? Penetration TestingPenetration testi&hellip;", "What about some kind of drone? A small, quiet one? You film difficult-to-access, or inaccessible, areas quickly and safely. You could also, say, drop a prepared RPi or something similar into an area to extend your range.", "If any of you folks are interested in what I carry for my red team engagements: NOTE: Entry tools are not legal everywhere. Before I go on an engagement, I make sure I know the relevant laws. BagGoRuck GR1 - This bag is tough as nails, and big enough to carry all the gear I need. Whether I’m snea&hellip;", "Intro to the Hackers labA new series about hacker hardware coming to a computer near you! Hello there 0x00sec! I’m going to be starting a new series based off of my EDC bag post and a suggestion from @ricksanchez that I should do something like this. To start things off, I’ll be discussing the Ra&hellip;", "Hello fellow 0x00sec h4x0rz!! Today I’m coming to you with a discussion topic on EDC bags. An EDC bag is something that you carry with you every day, I.E, an &#39;E’very &#39;D’ay &#39;C’arry bag. The Bag.Alright, so, what’s an EDC bag without the bag part?! Personally, I don’t think you need an expensive, s&hellip;", "I started this thread for anyone else interested in pwning this network. if you’re able to get passed the log in page you will have access to the rest of the network. I’m still trying to get passed the log in page myself. I just found out about this site. Feel free to join in on the discussion and &hellip;", "IntroductionAs a hacker or anything else related to security or hacking, you should know the most famous hacking attack a.k.a The Man in the middle Attack. This attack is the easiest attack that should be known by all of security engineer and hackers. I’ve seen a lot of people (mainly script kidd&hellip;", "Hi, You should have searched through the site before asking this question. @dtm recently posted a “guide” on how to get into Malware Analysis (use the search bar) for the Windows platform. We also have a bunch of learning resources for Assembly (use the search bar). You seem to be sort of rushing&hellip;", "I believe many of us have read that book. It is a great book! https://0x00sec.org/t/hacking-related-books/849", "Recently I have been reading a bit about different IoT/embedded malwares and I have found the reading very interesting and instructive so I have decided to share with you what I have found. Author Assigned Level: NewbieCommunity Assigned Level:NewbieWannabeHackerWizardGuru0voters &hellip;", "I believe many of us have read that book. It is a great book! https://0x00sec.org/t/hacking-related-books/849", "Has anyone read Learning Linux Binary Analysis? It covers a lot of what is covered here. In addition, it gives an excellent overview of the ELF format and goes over how to write Linux malware", "Here’s my version: #include &lt;stdio.h&gt;#include &lt;stdlib.h&gt;#include &lt;string.h&gt;#include &lt;stdint.h&gt;#include &lt;sys/ptrace.h&gt;#include &lt;sys/types.h&gt;#include &lt;sys/wait.h&gt;#include &lt;sys/stat.h&gt;#include &lt;unistd.h&gt;#include &lt;sys/user.h&gt;#include &lt;sys/reg.h&gt;#include &lt;errno.h&gt;#include &lt;elf.h&gt;#include &lt;s&hellip;", "Has anyone read Learning Linux Binary Analysis? It covers a lot of what is covered here. In addition, it gives an excellent overview of the ELF format and goes over how to write Linux malware", "Necrobumping can be bad. But in this case I think it’s fully acceptable. This article is super relevant, and interesting, and I can’t believe I missed it.", "We have already seen how to infect a file injecting code into the binary so it gets executed next time the infected program is started. But, how to infect a process that is already running?. Well, this paper will introduce the basic techniques you need to learn in order to fiddle with other processe&hellip;", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "Nice post @ricksanchez ! This is my proposal for section 6 (What’s next) #6. Chuck Norris’ way Chuck Norris is not a hacker but he pwns any computer just walking close to it Chuck Norris writes his own reverse shells directly in machine code and types it in hex by heartChuck Norris writes IPs &hellip;", "Let’s put away the serious stuff for a while and let’s have some fun. What about some hacking pranks!. Let’s start with something simple, the so called nervous mouse. Note: The code is a modification of some example from internet. I cannot recall where I got it, but it is, let’s say, the default ex&hellip;", "Awesome related REcon and DEFCON talks: Don’t give ideas to @0x00pf please.", "For those who want to fuck a reverse engineer’s day up, prepare yourself… @IoTh1nkN0t @_py", "Bit of a self promo but I somewhat recently finished an in-browser ARM assembler and simulator that might aid in some understanding of ARM. Features the full GAS syntax but it has its crashes here and there.  [image]", "Over The Wire: Narnia1 - Popping a shell.Ok, now that we’ve gotten past narnia0, it’s time to do narnia1. Go ahead and ssh into the narnia server with username narnia1 and the password acquired from level 0. 123loaded@redhat ssh narnia1@labs.overthewire.org ssh narnia1@narnia.labs.overthewire.o&hellip;", "As promised, here is the shellcode tutorial once again RequirementsAlright so this isn’t going to be msfvenom tutorial. (shellcodes are payloads). This tutorial will focus on writing shellcodes using Assembly. Knowledge of C and Assembly is highly recommend. Also knowing how the stack works is a&hellip;", "There are at least a million+ ARM processors around us. That being said, the following link is an intro to ARM assembly from an exploit dev perspective. The author starts off by explaining the basics and in the next “pack” of series, she’ll introduce ARM pwning. I figured it’d be a neat reference f&hellip;", "http://doctrina.org/How-RSA-Works-With-Examples.html These were helpful to me… Especially those videos.", "Zup folks, for the picoCTF we (dtm, pysec, kowalski and me), had to solve several crypto challenges. RSA being the most common subject. So here I thought it’s time to share what I know about RSA, because it’s one of the most common algorithms seen in public key crypto. First let’s start with a li&hellip;"]}