{"user": "br0wn", "history": ["Is it possible to join a team if I already have created one ?", "Hi A while ago I did a presentation on reverse engineering for a group at a local uni. I thought the slides and binaries I used could be useful, so I’m posting it here. I’d like to point out that many of the binaries I used are not mine, many came from skidophrenia which was hosted on ctfd.io by @&hellip;", "Is it possible to join a team if I already have created one ?", "I am just now experimenting with htb, so I cannot say for sure. However, I have it on good authority that many htb machines are similar in difficulty to a lab machine, and possibly exam machines as well. One thing I do not know if htb replicates well are a few things PWK does especially well, such a&hellip;", "I am just now experimenting with htb, so I cannot say for sure. However, I have it on good authority that many htb machines are similar in difficulty to a lab machine, and possibly exam machines as well. One thing I do not know if htb replicates well are a few things PWK does especially well, such a&hellip;", "Have you tried to solve HackTheBox machines ? if yes, could you compare them ? (How much htb is similar or easy). Thx!", "Have you tried to solve HackTheBox machines ? if yes, could you compare them ? (How much htb is similar or easy). Thx!", "I’m curious what everyones favorte go to site for new vulns are. One of my favorites is https://cxsecurity.com/ just easier to browse through via web browser than exploitdb IMO.", "So a lot of people seem confused about where we are, let’s just go through exactly where our IRC is. We are not on freenode anymore. We were, and then we were kindly donated a server by @L0k1 We are however at: irc.0x00sec.org 6697+. And cloaks are enabled by default. If you want to access the we&hellip;", "This post is part two of a multi-part series. If you haven’t already, please read part one here: Encrypted Chat: Part I Welcome BackAfter gaining an understanding of the concepts behind my encrypted chat server, we’re now ready to take a closer look at the code to see how the client and server ope&hellip;", "The ProjectI started programming an encrypted chat client and server to learn more about encryption and how it’s implemented in network protocols (e.g. SSH or HTTPs over TLS). Now that it’s almost complete, I wanted to share what I learned with you. I’m splitting up this series into two posts. The&hellip;", "You can also try to test fuzzing the inputs. Here is the nice tips : https://dl.packetstormsecurity.net/papers/general/PHP_Fuzzing_In_Action.pdf", "Hi 0x00’ers! If you had seen the last ‘show off your setup’ thread, Show off your setup! You’ll notice it was a huge success, and there was a tonne of beautiful systems and setups. Since it was a little while ago and a lot of people have already renewed their existing setup, got new hardware, jump&hellip;", "Welcome to my first challenge! If you’re interested in becoming a reverse engineer, it’s important that you have a strong background with low level data and can understand the process of disassembly and debugging. Details of the ChallengeA friend of yours is an arts major but he hasn’t been making&hellip;", "As requested by @pry0cc, well, not really a request… more like I threw out there a idea and pry volunteered me to do a tutorial. Ok, fine, I guess. Anyways, with that all being said and done as the name suggests this is how to securely connect to IRC using Hexchat and ToR. It isn’t that complicated,&hellip;", "Yeah, this is a great idea with caveats. Let’s call this what it is: A mentorship program. I’d love to see labels by names that call people out as mentors who can help people with the things you mentioned such as suggesting topics, providing editorial assistance, etc.", "Post Coherency and Adherence to Good EnglishHey, everyone! I thought I’d take just a little time to talk about how posts should be written. #Formatting Formatting should follow something like posts by @dtm or me (@oaktree). Example 1 by dtmExample 2 by meI would advise that you learn some b&hellip;", "0x00sec has used Cloudflare for a while; mainly for security reasons. Cloudflare is great. And it’s secure as well. But one thing is a little annoying. Captchas. I use Tor on a daily basis, and the two biggest problems with Tor are Exit Nodes and Captcha’s, Exit nodes have been notorious for runnin&hellip;", "if i can run metasploit on vultr that’s will be great ! so all i have to do is buying the vps with ubuntu then install metasploit ?", "Hello 0x00’ers! As you may understand, this site does cost us money at the present. It is the sacrifice we have to make while we don’t use ads. (Ads suck). However we have multiple donation platforms available at the present. To add to this list of possible methods, we are pleased to announce our n&hellip;", "Knowledge is Power But like all power, there are those who want to keep it for themselves but em not one of them. I was feeling bored and I start checking my bookmarks and I found these linked in my bookmarks so I thought I should make a list and share with others because knowledge should be free .&hellip;", "I came accross this pretty good URL scanner called urlscan. It is still in beta but it works pretty good and is accurate and can obtain a lot of information. Plus it is a passive recon tool, meaning you don’t touch the target directly. +5 stealth! Just a quick find I wanted to share https://urlsca&hellip;", "Hello everyone. I have made some minor edits since first posting this as to further clarify a couple of points. I joined this community a while ago; I have/had been a lurker for even longer.  A huge part of what made the hacker community what it was (and what it is here) involves a willingness to &hellip;", "Hoodies are cool. 0x00sec is cool. You know what is even cooler? 0x00sec Hoodies.We get it, you’re a badass, and you love hacking + computers. But you would look even more badass with one of these bad boys. [image][image]Do you want something more understated? Okay. We gotcha.  [image] [i&hellip;", "OSINT - Passive Recon and Passive Discovery Of AssetsSup 0x00’ers, to kick this badass series off, I am going to begin with the most important aspect of pentesting. Passive Recon and OSINT. Now, do not let the word ‘passive’ fool you. This is no light recon, you can uncover vast amounts of infomati&hellip;", "Hey guys! Here’s a list of around 60+ sources I’ve gotten together for 10 programming languages. These sources will help you, so I recommend you check &#39;em out! If the link does not work please copy paste the address into your browser. SOURCES: HTML5 http://www.w3schools.com/html/html5_intro.asp &hellip;", "OSINT 0x02 - LinkedIn is not just for jobsSup 0x00’ers, that’s right, I am back with another banger of an article, ready? If you read my last article on OSINT, you’ll know a little bit on how to find dirt on companies, their assets, and how to do all of that passively. Well now I am going to show &hellip;"]}