{"user": "byakuganIII", "history": ["From what I understand the original file was clean?", "We didn’t spend as much time analyzing the keygen that it dropped, however I think it is probably not infected (I didn’t see anything obviously bad in my quick looks). I have seen the keygen on the internet without the malware dropper. I think it is likely that the malware author found the keygen an&hellip;", "We didn’t spend as much time analyzing the keygen that it dropped, however I think it is probably not infected (I didn’t see anything obviously bad in my quick looks). I have seen the keygen on the internet without the malware dropper. I think it is likely that the malware author found the keygen an&hellip;", "This is a good chance to go as far as you can, document your work, share it, and just ask, “Hey, what’s my next step?” We love those kinds of journeys and helping people out!", "This is a good chance to go as far as you can, document your work, share it, and just ask, “Hey, what’s my next step?” We love those kinds of journeys and helping people out!", "Yes this was an absolutely amazing malware reversing/analysis and I learned a lot of stuff from it specially reversing obfuscation scripts, and I’m sorry if my previous comment bother you guys and I didn’t mean to ask for support by any means, all I want was to discover if this man edit the original&hellip;", "This was an absolutely amazing example of catching malware in the wild and reversing it. However, I’d like to address what i’m seeing in the comments: Let’s discuss the work that @lkw and friends performed here and not use this as a support thread to ask for help with the malware you discovered. Ta&hellip;", "READMEIf your antivirus detects this page as malicious, it is most probably because I have pasted some scripts into the article. Do not be alarmed! IntroductionVery recently I’ve (finally) set up a proper malware analysis VM and so I thought that it would be super fun to download some samples fro&hellip;"]}