{"user": "Cawa", "history": ["Thats what i thought! “Knowing Null” is great! I love it! Thank you bros", "Many good links! Well done and thank you for sharing. Maybe it would be better to remove the previews and have text links only - Atleast with this amount of content?! Text links only would also simplify, combining all the wikis around here…if someone is willing to do so…(would be awesome) One big&hellip;", "Thats what i thought! “Knowing Null” is great! I love it! Thank you bros", "Thats what i thought! “Knowing Null” is great! I love it! Thank you bros", "Thats what i thought! “Knowing Null” is great! I love it! Thank you bros", "Hello, 0x00ers! As you may have heard me talk about before, I am a strong advocate of using labs and CTF platforms for learning to hack and learning the skills involved in performing pentests from day to day. I believe they’re a great way to learn new skills, practice and validate your enumeration&hellip;", "Welcome to the inaugural Leap Security and 0x00sec CTF!! We have teamed up with the guys at Leap Security to bring you this challenging fun-filled event. The CTF has no limitations on participants as it is open to anyone (no registration required) – think of it as our gift back to the community!  [&hellip;", "Thats what i thought! “Knowing Null” is great! I love it! Thank you bros", "Bro, about damn time. @0x00pf is a long living legend, and he’s given so much to this community. Without members like Pico, this place wouldn’t exist today.", "I knew @0x00pf was an absolute titan but I didn’t know he was actually a God.", "Hello again!It’s been a while since the last Knowing Null. For those of you knew to the series, my name is skidd0 and Knowing Null is an interview series where I pester and prod the top minds of 0x00sec about themselves and then post it all publicly–a dream come true for us paranoid hackers! Today&hellip;", "Hey! You could open http://gen.lib.rus.ec/ and search for “python network” and download hundreds of books to this Topic. I tried “python scrapy” and it found: Learning Scrapy: Learn the art of eficient web scraping and crawling with PythonIf you want to build a botnet, don´t rely on those “how t&hellip;", "Many good links! Well done and thank you for sharing. Maybe it would be better to remove the previews and have text links only - Atleast with this amount of content?! Text links only would also simplify, combining all the wikis around here…if someone is willing to do so…(would be awesome) One big&hellip;", "This is a writeup on the simplest exploitable binary (buffer overflow, 32 bit, no ASLR, executable stack) but with (I think) a different approach with respect to the usual writeups. In particular, how to calculate the address of a buffer knowing the environment variables contents. The post is here&hellip;", "Github Open-source tool I wrote that uses Shodan (a search-engine for the Internet of things) to automate the discovery of potentially vulnerable routers running outdated firmware which can be exploited in order to target every device on the network. Any thoughts?", "I don’t know who you’re replying to, but since I created the thread, I’ll address this. A hackers setup is something that they show off. Is it serious? No. Is it fun? Yeah! It’s like putting stickers on your laptop. It gives you some sort of individuality with your setup, right down to the experien&hellip;", "I spoke about my thoughts on this project on twitter and I disagree with what a lot of people are saying. Learning this kind of thing is really useful to understanding how a C2 works. This is the entire thing of offensive security. Good job dude! This could even be used for engagements to demons&hellip;", "https://github.com/colental/byob Built this to teach myself Python. Any thoughts?", "Hey boys and girls, On this part of guide you will be able to see and repeat the installation of a debian-based operating system called Kali Linux and to learn some about: ###Content: x86 &amp; x64 architectureSHA256SumChecksumVirtualBoxCreate a VMInstallation of Kali Linu&hellip;", "Ok, I’m done customizing my final setup. Here are some screenshots. Would like to hear @pry0cc’s and @fi6uh’s rating especially! I run ArcoLinuxB, which is basically Arch Linux with some themes and configs included. I debloated it using their BYOI project and further customized my shell with zsh an&hellip;", "how to setup a lab that is similar to oscp labs. what all things should be known just for setting up the lab  [offsec-playground-thumb-21]", "and another proof that this is made for nerds…  look at the names of their networks and clients Starting network, all clients are named after chracters from Final Fantasy Starfleet network… obvious", "Hey! You could open http://gen.lib.rus.ec/ and search for “python network” and download hundreds of books to this Topic. I tried “python scrapy” and it found: Learning Scrapy: Learn the art of eficient web scraping and crawling with PythonIf you want to build a botnet, don´t rely on those “how t&hellip;", "Hey! You could open http://gen.lib.rus.ec/ and search for “python network” and download hundreds of books to this Topic. I tried “python scrapy” and it found: Learning Scrapy: Learn the art of eficient web scraping and crawling with PythonIf you want to build a botnet, don´t rely on those “how t&hellip;", "Hey! You could open http://gen.lib.rus.ec/ and search for “python network” and download hundreds of books to this Topic. I tried “python scrapy” and it found: Learning Scrapy: Learn the art of eficient web scraping and crawling with PythonIf you want to build a botnet, don´t rely on those “how t&hellip;", "Hey! You could open http://gen.lib.rus.ec/ and search for “python network” and download hundreds of books to this Topic. I tried “python scrapy” and it found: Learning Scrapy: Learn the art of eficient web scraping and crawling with PythonIf you want to build a botnet, don´t rely on those “how t&hellip;", "Hey! You could open http://gen.lib.rus.ec/ and search for “python network” and download hundreds of books to this Topic. I tried “python scrapy” and it found: Learning Scrapy: Learn the art of eficient web scraping and crawling with PythonIf you want to build a botnet, don´t rely on those “how t&hellip;", "[olddd]", "Oh yes, @Cawa is back! I’m no longer the only electrical technician! By the way, my setup is coming too, i’m also still setting it up before showcasing it!", "I’m very much interested to have a look at you dotfiles, I’m currently setting up my arch and coincidentally using I3 WM, tmux and ranger, too Maybe “github” your dotfiles? recently did that! So nice to manage them all in one place + version control. bye", "Didnt realize that this post is allrdy 2 month old. I was so busy with studies last 3 month i rarely visited the forum. i beg your pardon. your setup changed much lately? i know arch is always work in progress, but your setup seems pretty finished", "Oh yes, @Cawa is back! I’m no longer the only electrical technician! By the way, my setup is coming too, i’m also still setting it up before showcasing it!", "Didnt realize that this post is allrdy 2 month old. I was so busy with studies last 3 month i rarely visited the forum. i beg your pardon. your setup changed much lately? i know arch is always work in progress, but your setup seems pretty finished", "My old dotfiles are still on my github, under Ghost2?", "I’m very much interested to have a look at you dotfiles, I’m currently setting up my arch and coincidentally using I3 WM, tmux and ranger, too Maybe “github” your dotfiles? recently did that! So nice to manage them all in one place + version control. bye", "Welcome back to Knowing NullKnowing Null is a series of interviews randomly conducted on the 0x00sec IRC server and compiled here for your convenience. Today’s guest is the ever present pry0cc! But, first, a poll! Who do you want to see next time?fraqdtmricksanchezzSecsprtn0x00pfPhoenix&hellip;", "As @johnmarston mentioned above, developing your Linux skills is probably the best start. This could help with that: Linux Fundamentals - Part 1 Linux Fundamentals - Part 2 Linux Fundamentals - Part 3 Linux Fundamentals - Part 4 For me, as a former Windows-only user ( ya ya i know…  ) having &hellip;", "Thanks Mate, I rly like your challenges! Its nice to see so many different solutions! keep on your good work", "Thanks Mate, I rly like your challenges! Its nice to see so many different solutions! keep on your good work", "Hey Mates, as I said in my last post we’re coming to license key cracking. Note: I also said to make a challenge about nag removing but I think I cancel this because it’s just too easy (Think of a program with a message box at start; just remove the MessageBox() in code…). When we come to C++ this &hellip;", "Yeah… the Wiki category allows the community to collaborate and edit the Wikis together. I haven’t edited my wiki in a while and will add more links soon (been busy), but… please feel free to combine some of the content and please give credit to those that deserve it. –Techno Forg–", "Many good links! Well done and thank you for sharing. Maybe it would be better to remove the previews and have text links only - Atleast with this amount of content?! Text links only would also simplify, combining all the wikis around here…if someone is willing to do so…(would be awesome) One big&hellip;", "Knowledge is Power But like all power, there are those who want to keep it for themselves but em not one of them. I was feeling bored and I start checking my bookmarks and I found these linked in my bookmarks so I thought I should make a list and share with others because knowledge should be free .&hellip;", "As @johnmarston mentioned above, developing your Linux skills is probably the best start. This could help with that: Linux Fundamentals - Part 1 Linux Fundamentals - Part 2 Linux Fundamentals - Part 3 Linux Fundamentals - Part 4 For me, as a former Windows-only user ( ya ya i know…  ) having &hellip;", "As @johnmarston mentioned above, developing your Linux skills is probably the best start. This could help with that: Linux Fundamentals - Part 1 Linux Fundamentals - Part 2 Linux Fundamentals - Part 3 Linux Fundamentals - Part 4 For me, as a former Windows-only user ( ya ya i know…  ) having &hellip;", "Hello 0x00’ers! @zSec gave us the idea to make a Wiki with working services for things such as email relays, SMS spoofing and the like. Feel free to edit this and add things you have tried and tested. The more we add in useful things, with a very quick way to access them, the more useful this page w&hellip;", "As @SmartOne suggested. It would be really cool to have a wiki with useful links. Simply edit this topic and away you go! Blogs Security blog(s) overviewPenetration Testing Blog by @hkh4cksNews The Hacker News Security Affairs WIRED (Security Category) SANS Newsletter(s) (For&hellip;", "This is my solution to the Basic Pentesting: 1 challenge by Josiah Pierce. His challenge can be found on VulnHub at: https://www.vulnhub.com/entry/basic-pentesting-1,216/ Let’s get started. 0x00 DetailsWe are not provided the IP address of our target machine, so we had to use other means to look&hellip;"]}