{"user": "chaos_knight", "history": ["@chaos_knight’s answer is far for being pointless. Indeed, whatever the method used, WPS Pin Cracking or social engineering, the end goal is still the same. Moreover, such SE attacks have a better chance to succeed in the wild. As @pry0cc said, and according to my own experience, it’s been a while s&hellip;", "Never had a luck with it tbh.I found simple things like FakeAP or EvilTwin lot more efficient for some real wardriving.", "EvilTwin Attack is an attack completely different from WPS Attack. That is a social engineering attack. To explore it you can use some scripts such as Fluxion Linset or wifiphisher. Your comment is off topic", "We now have a newly created 0x00sec team on HackTheBox. Direct message me on 0x00sec or join #htb on IRC and leave a message with the regulars if you want to be added to the team. Notes: You cannot join more than one team on HTBThere is zero entry requirements to join our team. Just being an 0x&hellip;", "Never had a luck with it tbh.I found simple things like FakeAP or EvilTwin lot more efficient for some real wardriving.", "Wow i really like your setup . what os and theme do you use ?", "Some of you should definitely do autoconf script for your setups, so much of great work! I like it simple and consistent, and Im lazy   [Screenshot%20from%202018-07-11%2008-24-22][Screenshot%20from%202018-07-11%2008-00-34][2018-07-11-081755_1280x800_scrot] [Screenshot%20from%202018-07-11%2008-02-&hellip;", "[Album] Imgur                                                  [Imgur]                           Thread over, best setup.Yes, that’s a legit pad of graphing paper and a real Pilot Acroball pen. Contain your &hellip;", "Some of you should definitely do autoconf script for your setups, so much of great work! I like it simple and consistent, and Im lazy   [Screenshot%20from%202018-07-11%2008-24-22][Screenshot%20from%202018-07-11%2008-00-34][2018-07-11-081755_1280x800_scrot] [Screenshot%20from%202018-07-11%2008-02-&hellip;", "Some of you should definitely do autoconf script for your setups, so much of great work! I like it simple and consistent, and Im lazy   [Screenshot%20from%202018-07-11%2008-24-22][Screenshot%20from%202018-07-11%2008-00-34][2018-07-11-081755_1280x800_scrot] [Screenshot%20from%202018-07-11%2008-02-&hellip;", "Some of you should definitely do autoconf script for your setups, so much of great work! I like it simple and consistent, and Im lazy   [Screenshot%20from%202018-07-11%2008-24-22][Screenshot%20from%202018-07-11%2008-00-34][2018-07-11-081755_1280x800_scrot] [Screenshot%20from%202018-07-11%2008-02-&hellip;", "Here’s all the malware I’ve been collecting from my honeypot. Enjoy the Park! [image]", "Hey guys, as you may or may not know, I developed an application dubbed “NoREpls” for the purposes of teaching Windows reverse engineering as a side project. It’s been a while since its debut here so I’ve decided to finally upload its source on my GitHub page here: https://github.com/NtRaiseHardErro&hellip;", "Ok here is my setup! I run ArchLinux with the i3 tiling window manager. This is configured by myself using a very heavily modified version of OxHak’s config. I am using conky for the top bar. My anonymity setup is fairly simple. I have a collection of VPN’s and I connect to a different one every da&hellip;", "IntroductionThis paper is how to setup your own Honeypot (dionaea). I would say most of us like Reverse Engineering binaries. Many of us have a fascination with malware. Why not combine them and RE some Malware that’s actively being used for exploitation? My tutorial is how to setup a honeypot on &hellip;", "There is a huge array of topics that underlies the working innards of a modern computer. Please free to share your favorite references/books on any topic relating to Computer Science. EDIT: PROVIDE A SMALL DESCRIPTION/REVIEW if you’ve read the book or know it had helped others Discrete Mathematic&hellip;"]}