{"user": "direnjie", "history": ["Hello, 0x00ers! As you may have heard me talk about before, I am a strong advocate of using labs and CTF platforms for learning to hack and learning the skills involved in performing pentests from day to day. I believe they’re a great way to learn new skills, practice and validate your enumeration&hellip;", "I’m curious what everyones favorte go to site for new vulns are. One of my favorites is https://cxsecurity.com/ just easier to browse through via web browser than exploitdb IMO.", "I suggest any and all members attending Defcon/Blackhat/BSidesLV meet up?! Who’s going? Roll call! I get in Wednesday Morning, and leave with regrets Sunday Afternoon. Might be staying at the Flamingo, but also open to dropping cash on an Airbnb. I got about 4 other buddies coming as well, so we &hellip;", "Hi 0x00’ers! If you had seen the last ‘show off your setup’ thread, Show off your setup! You’ll notice it was a huge success, and there was a tonne of beautiful systems and setups. Since it was a little while ago and a lot of people have already renewed their existing setup, got new hardware, jump&hellip;", "Hi A while ago I did a presentation on reverse engineering for a group at a local uni. I thought the slides and binaries I used could be useful, so I’m posting it here. I’d like to point out that many of the binaries I used are not mine, many came from skidophrenia which was hosted on ctfd.io by @&hellip;", "A few months ago I wrote up a silly project to implement purely in memory SO (shared object) loading via the memfd_create syscall. I forgot to include y’all in the fun and I am sorry . Sho’ nuff’ this is possible in just a few lines of python. I wrote it up as a class and it still is less than 20&hellip;", "How do I or you make a living? Good question and there’s number of answers. I’ve been looking at jobs for several companies and most of them surprisingly only require that you’re 18 or older and at least willing to learn, but of course the ignorant require BS. There’s also such thing as freelancing &hellip;", "Userland API Monitoring and Code Injection DetectionAbout This PaperThe following document is a result of self-research of malicious software (malware) and its interaction with the Windows Application Programming Interface (WinAPI). It details the fundamental concepts behind how malware is able to&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "In Part I and Part II we manage to reverse the dropper and extract the malware. We have already got the first flag from the malware sample. Now it is time to analyse the sample and get the rest of the flags. The sample we are going to analyse has a moderate complexity and a manual approach as we ha&hellip;", "Reverse Engineering and Crackme challengesThis topic is an aggregation of Crackme and reverse engineering challenges developed for 0x00sec. Please discuss the challenges in the thread they were originally posted or on IRC in #challenges This curation is based entirely on my own whim and not a comp&hellip;", "Yes, that’s right. Haha!", "i see Chinese chopper ；）", "Freestyle February: A 0x00sec Article ContestHello 0x00ers! The 0x00sec Staff is happy to announce our first annual Freestyle February! Here’s how it works: Take up until the last day of February to research something technical, something from which the 0x00sec community might benefit. Then, po&hellip;", "i have follow the forum sometime and learned a lot，but  has never post a topic，today，i am wonder how a independently security researcher to make a living，there may may be some one can share the experience or your “story“  about you  how to earn  money？ like bug boundary？", "Some weeks ago I found [this interesting article] (https://blog.gdssecurity.com/labs/2017/9/5/linux-based-inter-process-code-injection-without-ptrace2.html), about injecting code in running processes without using ptrace. The article is very interesting and I recommend you to read it, but what caugh&hellip;", "nice share！！！！！！！！！！", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "I think that it would be a good exercise for y’all (myself included) to write some decent malware. I’ve been rolling the concept for one around in my head for a few weeks and it would be fun to implement, especially with a small team of people working on it. Here’s a basic concept that is in no wa&hellip;", "Thanks for you share. I’ll try to make a cli version  https://dnsdumpster.com/ is another very good tool.", "Dude! Second time where I’m about to write up a paper on a certain topic and you wrote it sooner xD Either way, great explanation as always, ptrace is really powerful. Maybe we can collaborate on a similar topic in the future since our ideas seem to be alike.", "Hello everyone. I have made some minor edits since first posting this as to further clarify a couple of points. I joined this community a while ago; I have/had been a lurker for even longer.  A huge part of what made the hacker community what it was (and what it is here) involves a willingness to &hellip;", "Hi 0x00ers. This is my first post and my goal in it is to share and detail how you can exploit a buffer overflow by doing a detailed analysis of the executable and for that I will solve a challenge proposed by ricnar in its reversing course, it is clear that i just started on the subject of reversi&hellip;", "Hello guys, Hope everyone is okay  It’s been a while since my last post here So I have something simple to share with you Malware Decompiling and Unpacking (Loda Keylogger) The sample: https://www.hybrid-analysis.com/sample/9300e6bbdb4bd12e1a1f58a5a50759811d39437e3cbe2769164d5d04e199656c", "UPDATE: Please refer to Linux Internals - The Art Of Symbol Resolution for a more detailed and updated analysis of the concept. Hey peeps! I hope you’re all doing great. It’s been a long time since my last post. Anyway, today I present to you something completely different from what you’ve been use&hellip;", "It isn’t that hard ^.^ Here’s how: When we enter to register, we can see that it asks for invite-code… Let’s see the source: [image] Uhmm… This one seems interesting, when we enter it we get: [image] Ohh obsfucated… I’ll use jsbeautifier.org: [image] So, there are two functions, one to c&hellip;", "I started this thread for anyone else interested in pwning this network. if you’re able to get passed the log in page you will have access to the rest of the network. I’m still trying to get passed the log in page myself. I just found out about this site. Feel free to join in on the discussion and &hellip;", "", "Greetings, all. The following paper will be documenting an example of executable compression, AKA packers which I have developed over the past couple of days. Like crypters, I feel as though they are some form of hidden dark art of the underground communities. Though there are many publicly availabl&hellip;", "Since we’ve recently covered DLLs and, in a timely manner, @0x00pf has given us a brilliant paper on infecting processes, I thought that I’d contribute my piece on IAT hooking using a method called DLL injection. In this paper, I will be detailing an implementation of a simple user mode rootkit as a&hellip;", "Recently I have been reading a bit about different IoT/embedded malwares and I have found the reading very interesting and instructive so I have decided to share with you what I have found. Author Assigned Level: NewbieCommunity Assigned Level:NewbieWannabeHackerWizardGuru0voters &hellip;", "Preach it! IoT hacking is one of my favorite things at the moment! I’d love to get a semi-private group of people together for the purposes of embedded device hacking, mutual learning, sharing our finds, etc.  if anyone is interested.", "Good morning, this is my first tutorial and I hope it will serve to the purpose. This is a practical one because I think that if it’s really nice to read about all that Calc and Notepad spawning around - of course these articles have a really great educational value, it’s not my intention to belitt&hellip;", "good article,thanks share", "As @SmartOne suggested. It would be really cool to have a wiki with useful links. Simply edit this topic and away you go! Blogs Security blog(s) overviewPenetration Testing Blog by @hkh4cksNews The Hacker News Security Affairs WIRED (Security Category) SANS Newsletter(s) (For&hellip;"]}