{"user": "Evalion", "history": ["1.) Connect VPN + TOR in this arrangement: You -&gt; TOR + VPN -&gt; VPN -&gt; destination 2.) do some google dorks for stolen credit card dumps. 3.) Buy BTC with them 4.) Send the BTC to another address in your wallet. Do this atleast 3 times. 5.) Send your BTC through a mixer service. 6.) Again, send &hellip;", "While hackthebox is a great platform, I also feel I should warn you about some “risks”. Unlike vulnhub, htb is an online platform, meaning other, more skilled hackers, can be on the same box as you while you are still on it. Htb certainly takes measures to protect you, but they can’t do everything. &hellip;", "While hackthebox is a great platform, I also feel I should warn you about some “risks”. Unlike vulnhub, htb is an online platform, meaning other, more skilled hackers, can be on the same box as you while you are still on it. Htb certainly takes measures to protect you, but they can’t do everything. &hellip;", "While hackthebox is a great platform, I also feel I should warn you about some “risks”. Unlike vulnhub, htb is an online platform, meaning other, more skilled hackers, can be on the same box as you while you are still on it. Htb certainly takes measures to protect you, but they can’t do everything. &hellip;", "While hackthebox is a great platform, I also feel I should warn you about some “risks”. Unlike vulnhub, htb is an online platform, meaning other, more skilled hackers, can be on the same box as you while you are still on it. Htb certainly takes measures to protect you, but they can’t do everything. &hellip;", "While hackthebox is a great platform, I also feel I should warn you about some “risks”. Unlike vulnhub, htb is an online platform, meaning other, more skilled hackers, can be on the same box as you while you are still on it. Htb certainly takes measures to protect you, but they can’t do everything. &hellip;", "While hackthebox is a great platform, I also feel I should warn you about some “risks”. Unlike vulnhub, htb is an online platform, meaning other, more skilled hackers, can be on the same box as you while you are still on it. Htb certainly takes measures to protect you, but they can’t do everything. &hellip;", "Did you collect this with your honeypot you made some time ago?", "https://tinyurl.com/REalMalware Zipped. 43 GB Enjoy.", "Hello everyone. I have made some minor edits since first posting this as to further clarify a couple of points. I joined this community a while ago; I have/had been a lurker for even longer.  A huge part of what made the hacker community what it was (and what it is here) involves a willingness to &hellip;", "Performing a MITM attack on the .NETGuard desktop applicationAuthors:Washi, 766F6964 Abstract:Code obfuscation is a method of preventing third parties from reverse engineering the inner workings of software. One cloud-based service that provides this kind of protection for .NET applications is .&hellip;", "I already met the project thanks to this guy on twitter, he doesn’t think highly of it. But hey, look at this way: bad publicity is still publicity . And he has been put in his place by various commenters, so you got that going for you. But seriously, good job man!", "Ahh, finally: tutorials aimed to the beginner. Excellent work @0x00pf. -Phoenix750", "I make all sorts of improvised weapons to introduce “the militarized hacker”, which is basically a hacker that has a more aggressive &amp; direct approach (like in Watch Dogs/Watch Dogs 2). This goes from long-lasting molotov cocktails, to plastic explosives to breach walls &amp; smoke bombs for distraction&hellip;", "@zSec Ofcourse it is better than CEH when you look at it technically because CEH is a joke. But ironically many jobs require you to have the cert. I’m not interested in his certs, but more in his articles on SCADA hacking because I work in EE in industrial environments. -Phoenix750", "Thanks, I use Ayu EDIT: The text editor is VScode.", "I’m not a fan of that setup myself but if it works for him, what is the problem? A setup is someone’s personal choice, his/her way of using their own system, and we definitely should never judge anyone’s performance and productivity based on the way they made their system look. @pry0cc is very prod&hellip;", "Thanks, I use Ayu EDIT: The text editor is VScode.", "Nice setup, I like the colors of your terminal. Is the text editor you use VScode?", "My web dev setup.  [49%20PM]The setup she told you not to worry about. (I’m trying to get into vim)  [01%20PM]I use all browsers for testing, but my main browser is Chrome.", "I’m not a fan of that setup myself but if it works for him, what is the problem? A setup is someone’s personal choice, his/her way of using their own system, and we definitely should never judge anyone’s performance and productivity based on the way they made their system look. @pry0cc is very prod&hellip;", "The total amount of time it cost me to customize my system: a little under 20 minutes. What I got from it: not having the urge to hang myself everytime I open a text editor.", "The total amount of time it cost me to customize my system: a little under 20 minutes. What I got from it: not having the urge to hang myself everytime I open a text editor.", "0x00sec is full of us young people with various talents, now that i think of it.", "I 100% want to see a writeup for this. I got a little way through, but got stuck on the second level. Real world malware is so useful to read about and learn from. If you did that, it would be awesome!", "0x00sec is full of us young people with various talents, now that i think of it.", "If you want to see young and talented check out the work of @exploit, he’s 16, and has been doing this since he was 13.", "Thanks. This categorization makes sense. Never thought of cons that way before.", "YES PLEASE! A websec noob like me could use such a thing.", "Everything on that list is a bad norm of Vegas except “corporatism”. I usually judge hacker gatherings on six spectrums. Who is the gathering intended for? Underground Anon Hackers to Watchlist HackersNon-Anon Hackers to Well-Known HackersHackers to Hacker Businesses and Hacker Businesses to H&hellip;", "Vegas as unwanted sexual advances all the time, that’s just vegas, as well as drugs. The thing I hated about it, was how everything is impossible to get into if you’re under 21 (in the evenings). Hotel security was also an issue for a lot.", "I was not at defcon so I can’t speak for it, but here is a list of the most notable complaints I’ve heard from some people who went to defcon corporatismunwanted sexual advances (especially true for women)Vegas as a wholedrugsmost of it is aimed at people who work in the field.I don’t know h&hellip;", "I was not at defcon so I can’t speak for it, but here is a list of the most notable complaints I’ve heard from some people who went to defcon corporatismunwanted sexual advances (especially true for women)Vegas as a wholedrugsmost of it is aimed at people who work in the field.I don’t know h&hellip;", "Hi there!  Thanks for a fun challenge! I’m sharing here the clear-text code in its final stage  As a malware researcher, I encounter tons of examples as this. My main method is to clean the noise and let the malicious code to decrypt itself. If there’ll be a request I’ll write you a write-up of how&hellip;", "YES PLEASE! A websec noob like me could use such a thing.", "Clientside Exploitation - Tricks of the Trade 0x01 - Sharpshooter + SquibblyTwoHi! I hope you’re well, today I am going to show you something that is common knowledge in the red teaming community, people use this kind of thing every day without thinking about it. However, if you’re new to security,&hellip;", "Thank you for the very well written guide, I didn’t know sharpshooter until now. This goes straight to my favorites for later testing", "Ooooh interesting. @ricksanchez check this out. Who wants some reverse engineering of real malware? @Cry0l1t3 @fraq @Evalion", "Exactly 100 days ago from my writing this, my lab access for Penetration Testing With Kali (PWK) began. PWK is a course offered by Offensive Security intended to prepare you for the OSCP certification exam, a grueling 24 hour endeavor where you must hack roughly 4 out of 5 computers assigned to you &hellip;", "Exactly 100 days ago from my writing this, my lab access for Penetration Testing With Kali (PWK) began. PWK is a course offered by Offensive Security intended to prepare you for the OSCP certification exam, a grueling 24 hour endeavor where you must hack roughly 4 out of 5 computers assigned to you &hellip;", "I looked for something exactly like this about 8 years ago. My attempt ended up in failure as I couldn’t find the resources and stopped learning about pen testing. I came back recently and now going at it. Wish tutorials like this were available back in the day. Or maybe I just failed to locate them&hellip;", "##– What is the “Penny”-Guide? – With this guide I want to help the newbies who wants to enter the world of IT-Security and give them a picture which is (in my opinion) essential to understand that it’s much harder than you think. There is a lot of theory and much more practice behind it. ##– My &hellip;", "The community has spoken. I will keep the Gitlab up and running.", "You’re welcome :}", "Ah, I didn’t even think to check for a GitHub. Thank ya.", "I love the look and feel of this. Would appreciate those dot files if you ever get a chance to upload them!", "You’re welcome :}", "I feel like the same thing could be achieved using GitLabs Free Tier and setting the repositories to private. Means we don’t necessarily lose stuff and you reclaim a server. Unless of course there’s stuff on the Gitlab that we wouldn’t want on GitLabs servers… If you’re looking for ideas for the n&hellip;", "I second this. (extra text cause 20 character limit)", "As a novice, that sentence inspires me to learn more.", "Arduino is a good learning platform no doubt, but it is not a PLC .", "As a novice, that sentence inspires me to learn more.", "As an electrical technician/PLC programmer, that sentence makes my eyes bleed.", "Heya everybody!Today, I bring you another Knowing Null Interview with the man you all voted for: fraq! Be sure to stick around after the interview to vote for the next subject. If there’s a question you’d like to see asked in future features, go ahead and leave a comment or ping me on IRC. Here. &hellip;", "The best interview till now … Great deal of inspiration!", "As an electrical technician/PLC programmer, that sentence makes my eyes bleed.", "Greetings my fellow hackers, As we continue with our series, the AMUNET app becomes complicated with new functionalities and structures to understand. We’ll sail right through. As stated earlier in previous tutorials, the app doesn’t fully exists because I build them before I share so forgive me if&hellip;", "I don’t know about powerpoint presentations, but for exercises you could do some simple vulnhub VM’s for your class. You can put harder VM’s in place over time. This shouldn’t even be too complex: set up the vulnerable VM on your computer (maybe with some IDS-like software and wireshark to monitor w&hellip;", "Hello everyone, My group’s interests is in the intersection between robotics and security. After having been reading for a few months, this is my first post. I hope you find it somehow interesting. Disclaimer: I work at Alias Robotics. I plan on starting to share a few bits here about our work. Hop&hellip;", "Of course.  I added a screenshot how it does look like after changing the DE.", "[grafik]Heyho all, upon Phoenix750 request I create this tutorial. Here I will show you how install Parrot Security and how to change the desktop environment of Parrot from MATE to XFCE. Content:What is Parrot Security?Installation of Parrot SecurityChange your DE.What is Parrot Security?P&hellip;", "Just for clarification: does the theme get copied too? That was my biggest reason for suggesting this .", "Because those terribly maintained repo’s have file conflicts almost everywhere! And it breaks my arch! Instead, use ArchStrike. It has less tools but it actually works without breaking or file conflicts! Or be smart and do what I do: isolate your pen-testing environment in a VM that runs Kali and &hellip;", "Because those terribly maintained repo’s have file conflicts almost everywhere! And it breaks my arch! Instead, use ArchStrike. It has less tools but it actually works without breaking or file conflicts! Or be smart and do what I do: isolate your pen-testing environment in a VM that runs Kali and &hellip;", "Same here. Actually, I was pretty surprised when I saw that this project belongs to someone from 0x00sec. I’ll check the source code as soon as I can. Thanks for such a great project.", "I already met the project thanks to this guy on twitter, he doesn’t think highly of it. But hey, look at this way: bad publicity is still publicity . And he has been put in his place by various commenters, so you got that going for you. But seriously, good job man!", "Ok, I’m done customizing my final setup. Here are some screenshots. Would like to hear @pry0cc’s and @fi6uh’s rating especially! I run ArcoLinuxB, which is basically Arch Linux with some themes and configs included. I debloated it using their BYOI project and further customized my shell with zsh an&hellip;", "In fact mate @colental, you should definitely do a write-up here on your tool. How to use it and how you’ve designed it. That would be amazing.", "Yep, you definitely can write your own modules - just add them to the ./byob/modules/ directory and your modules can be remotely loaded into memory and directly imported into the currently running process, without writing anything to the disk!", "Yeah I saw that - MalwareTech also tweeted about the project and he has 127k followers! My jaw was on the floor. He was critical of the quality of my code but the fact that someone of his stature would take notice of it and actually find it to be worth discussing + critiquing is crazy to me. Thanks&hellip;", "BTW, is it possible for us to also make our own modules for this thing?", "https://github.com/colental/byob Built this to teach myself Python. Any thoughts?", "I already met the project thanks to this guy on twitter, he doesn’t think highly of it. But hey, look at this way: bad publicity is still publicity . And he has been put in his place by various commenters, so you got that going for you. But seriously, good job man!", "Welcome Back to Knowing Null!This week, you voted to bring in ricksanchez! Let’s just jump right into it.First, I’d like to thank you for joining this series of course, anytime  If people really feel the urge to get toknow more about me this is the perfect chance! Can you tell me and the read&hellip;", "The infamous book called Hacking: the art of exploitation covers some assembly programming in a Linux environment with an emphasis on exploitation. It might be a good starting point", "Ok, I’m done customizing my final setup. Here are some screenshots. Would like to hear @pry0cc’s and @fi6uh’s rating especially! I run ArcoLinuxB, which is basically Arch Linux with some themes and configs included. I debloated it using their BYOI project and further customized my shell with zsh an&hellip;", "Ok, I’m done customizing my final setup. Here are some screenshots. Would like to hear @pry0cc’s and @fi6uh’s rating especially! I run ArcoLinuxB, which is basically Arch Linux with some themes and configs included. I debloated it using their BYOI project and further customized my shell with zsh an&hellip;", "Ok, I’m done customizing my final setup. Here are some screenshots. Would like to hear @pry0cc’s and @fi6uh’s rating especially! I run ArcoLinuxB, which is basically Arch Linux with some themes and configs included. I debloated it using their BYOI project and further customized my shell with zsh an&hellip;", "Ok, I’m done customizing my final setup. Here are some screenshots. Would like to hear @pry0cc’s and @fi6uh’s rating especially! I run ArcoLinuxB, which is basically Arch Linux with some themes and configs included. I debloated it using their BYOI project and further customized my shell with zsh an&hellip;", "The transparency and blur on your xfce bar is slick.  I like it!", "The transparency and blur on your xfce bar is slick.  I like it!", "Ok, I’m done customizing my final setup. Here are some screenshots. Would like to hear @pry0cc’s and @fi6uh’s rating especially! I run ArcoLinuxB, which is basically Arch Linux with some themes and configs included. I debloated it using their BYOI project and further customized my shell with zsh an&hellip;", "Ok, I’m done customizing my final setup. Here are some screenshots. Would like to hear @pry0cc’s and @fi6uh’s rating especially! I run ArcoLinuxB, which is basically Arch Linux with some themes and configs included. I debloated it using their BYOI project and further customized my shell with zsh an&hellip;", "Hey! You could open http://gen.lib.rus.ec/ and search for “python network” and download hundreds of books to this Topic. I tried “python scrapy” and it found: Learning Scrapy: Learn the art of eficient web scraping and crawling with PythonIf you want to build a botnet, don´t rely on those “how t&hellip;", "Oh yes, @Cawa is back! I’m no longer the only electrical technician! By the way, my setup is coming too, i’m also still setting it up before showcasing it!", "[2018-07-22-151915_1920x1080_scrot]Solarized + suckless", "[old]", "[olddd]", "I’m very much interested to have a look at you dotfiles, I’m currently setting up my arch and coincidentally using I3 WM, tmux and ranger, too Maybe “github” your dotfiles? recently did that! So nice to manage them all in one place + version control. bye", "Didnt realize that this post is allrdy 2 month old. I was so busy with studies last 3 month i rarely visited the forum. i beg your pardon. your setup changed much lately? i know arch is always work in progress, but your setup seems pretty finished", "Oh yes, @Cawa is back! I’m no longer the only electrical technician! By the way, my setup is coming too, i’m also still setting it up before showcasing it!", "Moved this to support", "Guess it’s time for me to join in and push for the conquest of i3 (@Evalion). [obligatory “I use Arch Linux”]  [image] I’m very proud of my terminal.  It’s Termite with oh-my-zsh, tmux, powerline.  Colors are from terminal.sexy, collection/trim-yer-beard.  Powerline configs have been modified to &hellip;", "One possibility I can think of is that it scans different IP ranges and then tries automated exploits on them.", "In addition to what @Evalion suggested, if the server gets indexed in Shodan it could be discovered through Shodan’s API. E.g. see autosploit", "One possibility I can think of is that it scans different IP ranges and then tries automated exploits on them.", "One possibility I can think of is that it scans different IP ranges and then tries automated exploits on them.", "hi , thanks for your reply this configuration is more detailed than the other your knowledge help me a lot =) i’ll use dante like proxy socks ( it will installed on the pwned server) so the configuration is: ( i’m reviewing xd) attacker vm and all traffic routed by tor using whonix gateway -&gt; &hellip;", "hi , thanks for your reply this configuration is more detailed than the other your knowledge help me a lot =) i’ll use dante like proxy socks ( it will installed on the pwned server) so the configuration is: ( i’m reviewing xd) attacker vm and all traffic routed by tor using whonix gateway -&gt; &hellip;", "One possibility I can think of is that it scans different IP ranges and then tries automated exploits on them.", "hello, thank you so much for your reply well the hacker i was talking is the same guy who hacked gamma group and hacking team ( it’s very famous) i post his guide https://pastebin.com/0SNSvyjJ and another doc https://pastebin.com/cRYvK4jb it’s very interesting i learn a lot reading this guides &hellip;", "It is always okay to post links if they are not harmful and are educational. If you use common sense on 0x00sec, you will never be in trouble. In this case, posting these links is perfectly fine. Oh yes I remember now, I had forgotten what it was called. Thanks for reminding me. And I think my log&hellip;", "hello, thank you so much for your reply well the hacker i was talking is the same guy who hacked gamma group and hacking team ( it’s very famous) i post his guide https://pastebin.com/0SNSvyjJ and another doc https://pastebin.com/cRYvK4jb it’s very interesting i learn a lot reading this guides &hellip;", "My guess would be that he used these servers a proxy servers. I don’t know what this hackback guide is, but here is how I would probably do it: After you have compromised a system, install a very minimalistic SOCKS proxy on it so that it won’t be easily detected Then add the IP addresses of yo&hellip;", "My guess would be that he used these servers a proxy servers. I don’t know what this hackback guide is, but here is how I would probably do it: After you have compromised a system, install a very minimalistic SOCKS proxy on it so that it won’t be easily detected Then add the IP addresses of yo&hellip;", "Hello , recently is was reading the two diy guides of hackback i read according to his guide he uses hacked servers to hide the ip from the stable servers (in this case I think he was referring to the vps the name stable servers ) i was reading about pivoting but the techniques exposed using met&hellip;", "My guess would be that he used these servers a proxy servers. I don’t know what this hackback guide is, but here is how I would probably do it: After you have compromised a system, install a very minimalistic SOCKS proxy on it so that it won’t be easily detected Then add the IP addresses of yo&hellip;", "IntroductionThis paper is how to setup your own Honeypot (dionaea). I would say most of us like Reverse Engineering binaries. Many of us have a fascination with malware. Why not combine them and RE some Malware that’s actively being used for exploitation? My tutorial is how to setup a honeypot on &hellip;", "One possibility I can think of is that it scans different IP ranges and then tries automated exploits on them.", "In the sense of my reply, I was clearly talking about a positive evolution", "The difference between evolution and devolution is simply a matter of perspective", "I remember @pry0cc back when he claimed that cybersec is only a hobby to him and that he could never see himself work there. How we have evolved…", "Welcome back to Knowing NullKnowing Null is a series of interviews randomly conducted on the 0x00sec IRC server and compiled here for your convenience. Today’s guest is the ever present pry0cc! But, first, a poll! Who do you want to see next time?fraqdtmricksanchezzSecsprtn0x00pfPhoenix&hellip;", "Hello folks, today I’m going to continue The Red Triangle series. If you haven’t seen the first one yet, you can check it here:  [ARG] The Red Triangle Solving — Part 1 Last time, we have deciphered the Monoalphabetic Substitution symbols from the images and got a link to google drive, that lead u&hellip;", "Hi! Great idea you have there. We already had the same one and created the wiki section that is free to edit for anyone, so you can just add your recommendations to the initial post there ! Your Complete, Un-budgeted ToolkitCS-related Books [Wiki]", "Hello, and welcome to 0x00sec. Since this post is a question, I moved it to the “Support” category. As for your question, I think @pry0cc can help.", "Hello, and welcome to 0x00sec. Since this post is a question, I moved it to the “Support” category. As for your question, I think @pry0cc can help.", "Hello fellow nerds, today I have decided to write a little article about my journey in resolving the Red Triangle ARG. So here we are ! Getting startedOnce you open the link you are prompted with a Red triangle on top, some hex encoded text below, a nice music played and 3 images: Two of them ha&hellip;", "I recently began reading up on the ELF format thanks to @ricksanchez’s article. This might be a fun exercise", "BabyELF RevengeDescriptionA BabyELF sequel since @0x00pf and @Leeky  nailed it in no time (I hope this one cannot be solved the same way ). RulesMake the binary display Congrats!Patch more than 4 bits and you’re disqualified. Don’t patch any instruction!Binarybase64 -d dump | gunzip &gt; &hellip;", "@Leeky and @0x00pf solved it in no time? hmmmm… I might just look into the first one aswell.", "Let’s go on with our special ASM/C programming course. At this point, we roughly know how a computer works, its main components, what is machine code, what is assembly code and how to compile simple programs for a few architectures. In this part we are going to write our first shellcode. Yes, we ar&hellip;", "If you had read Part II of this series you may have missed a couple of details. Consider this post as a short addendum to Part II including those details. The first you may have noted is that there was no ARM or MIPS code in there. Actually, the paper was already quite long and, to be honest, I tho&hellip;", "Glad to see you have come back to this humble course. Hope you are eager to get a lot more stuff to digest. Grab some coffee and relax. I have been claiming that this course is going to be different to all those that you find over the Internet. Right now, I should introduce a whole bunch of boring &hellip;", "Well, I’ll be sure to add these names on the next post’s Poll. If you guys think of other notable names, please either comment them here or PM me on IRC.  I don’t want to skip over anyone! @Evalion, I’d rather wait a bit for this ‘project’ to take off before I add another interviewer ‘voice’. I’ll &hellip;", "Bookmarked for future refference", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "If @skidd0 allows me to do so, I can also take interviews with regular nullers on the IRC.", "You know an article is good when I understand it. -Phoenix750", "Why am I not featured in this pol?!  Jokes aside, I think this is a really creative idea. Getting to know the regulars through interviews. Keep them coming!", "Why am I not featured in this pol?!  Jokes aside, I think this is a really creative idea. Getting to know the regulars through interviews. Keep them coming!", "Why am I not featured in this pol?!  Jokes aside, I think this is a really creative idea. Getting to know the regulars through interviews. Keep them coming!", "@Evalion, if the poll ends in a tie, I’ll do you next", "Why am I not featured in this pol?!  Jokes aside, I think this is a really creative idea. Getting to know the regulars through interviews. Keep them coming!", "Welcome to the first Knowing Null interview, a serious randomly conducted on the 0x00sec IRC server and compiled here for your convenience. Today’s guest is non other than 0x00sec’s premier benefactor, l0k1! But! Before we jump in, who do you want to see next?suserfraqpry0ccricksanchez0&hellip;", "Why am I not featured in this pol?!  Jokes aside, I think this is a really creative idea. Getting to know the regulars through interviews. Keep them coming!", "This topic was automatically closed after 30 days. New replies are no longer allowed.", "Ofcourse it is not realistic. But tell me in all honesty: does it really need to be? I play games to do things that I can’t do in real life, not a “daily life simulator”. Realism has to make way for great entertainment (and Watch Dogs 2 was fun as hell to play). And I am perfectly fine with the hac&hellip;", "@haalim, I can only assist you on the hardware part here. If you are serious about hardware, then buy either an Arduino, RPI, some PIC microcontrollers and some basic components and make something with them and program them. You could use some tutorials as a starting point but after that you should&hellip;", "@pry0cc and @fraq  recently announced that 0x00sec will be reformed. They did this in an internal thread in the VIP loungue. I am not the right person to explain it to the big public (the staff will do in the near future probably), but basically we want 0x00sec to be more varied instead of being sol&hellip;", "Hey man, very nice article. I’ve been using arduinos and atmega328 based hardware for a few years, and just wanted to comment that it’s so much more than hobby stuff… i designed an industrial water pump control system around it, and it’s been up and running for 3+ years without any serious mishaps. &hellip;", "As requested by @pry0cc, well, not really a request… more like I threw out there a idea and pry volunteered me to do a tutorial. Ok, fine, I guess. Anyways, with that all being said and done as the name suggests this is how to securely connect to IRC using Hexchat and ToR. It isn’t that complicated,&hellip;", "I assume English is not your native language, so I gave your post a clean up to make it better understandable. Also, questions should be posted in the “support” category :). As for your question, if you are looking for bad PHP code, there are no tools to do that for you. You’ll have to examine the &hellip;", "Comprehensive article with an emphasis on those who don’t know hardware all too well. Am I glad that you started this series so I won’t have to!", "I assume English is not your native language, so I gave your post a clean up to make it better understandable. Also, questions should be posted in the “support” category :). As for your question, if you are looking for bad PHP code, there are no tools to do that for you. You’ll have to examine the &hellip;", "Here is my badA$s setup  [image]", "using grep to look for specific functions is the best way I know of. You could make a simple script yourself using this knowledge perhaps?", "Thank you for your help:) . I told about soft like grep (for searching some functions in source code)…can you write names of tools for searching like that? I just don’t want to lost a lot of time for searching and want to optimize this proccess.", "I assume English is not your native language, so I gave your post a clean up to make it better understandable. Also, questions should be posted in the “support” category :). As for your question, if you are looking for bad PHP code, there are no tools to do that for you. You’ll have to examine the &hellip;", "Comprehensive article with an emphasis on those who don’t know hardware all too well. Am I glad that you started this series so I won’t have to!", "Comprehensive article with an emphasis on those who don’t know hardware all too well. Am I glad that you started this series so I won’t have to!", "FINALLY!!! Something that I understand instead of these weirdos posting RE stuff (RE sucks (jk))… I’m excited to do more projects with my Arduino Uno. Good job! I will do a more thorougher reading later since I’m busy atm, but I see from a fast scrolling how well in detail this is. Oh btw, @Evalion &hellip;", "If you look down in the bottom right hand corner, there’s a little gray box and the letters obviously tell you that it is my main OS.", "My Introduction First, I would like to thank 0x00sec for providing such a great community. I would also like to thank Arrogant Bastard, Sierra Nevada and Deathwish Coffee for providing the sustenance necessary for starting and completing the following series. Not only should you get drunk while com&hellip;", "To kickstart this, I am going to share my setup: This is the imgur album if you wish to peruse, but I am going to post it below anyway:                                                                                  [Album] This is Croc0, and this is my i3wm setup.                          &hellip;", "1.) Connect VPN + TOR in this arrangement: You -&gt; TOR + VPN -&gt; VPN -&gt; destination 2.) do some google dorks for stolen credit card dumps. 3.) Buy BTC with them 4.) Send the BTC to another address in your wallet. Do this atleast 3 times. 5.) Send your BTC through a mixer service. 6.) Again, send &hellip;", "thank you for tonne, brother!you have given me a good direction to study.", "The infamous book called Hacking: the art of exploitation covers some assembly programming in a Linux environment with an emphasis on exploitation. It might be a good starting point", "http://www.egr.unlv.edu/~ed/assembly64.pdf http://asm.sourceforge.net/intro/Assembly-Intro.html http://www.int80h.org http://asm.sourceforge.net/resources.html#tutorials", "The infamous book called Hacking: the art of exploitation covers some assembly programming in a Linux environment with an emphasis on exploitation. It might be a good starting point", "yeah, friends. My English is so poor,thank your patience.yesterday,I saw a post about a virus on Linux what was made with assembly language. it drives me interested .I want to write a Linux virus with assembly language on Ubuntu. I want to study assembly language on linux,but I find only assembly l&hellip;", "I don’t really grasp what message you are trying to convey. Are you asking for sources to learn assembly in Ubuntu because all the other sources are for Windows? Also, I have edited your original thread to be more clear. You’ll get answers faster if you speak in a clear language. I assume you are n&hellip;", "@pry0cc and @fraq  recently announced that 0x00sec will be reformed. They did this in an internal thread in the VIP loungue. I am not the right person to explain it to the big public (the staff will do in the near future probably), but basically we want 0x00sec to be more varied instead of being sol&hellip;", "I don’t really grasp what message you are trying to convey. Are you asking for sources to learn assembly in Ubuntu because all the other sources are for Windows? Also, I have edited your original thread to be more clear. You’ll get answers faster if you speak in a clear language. I assume you are n&hellip;", "I’m interested as well. Sign me up!", "I’m all for this idea so long that the quality isn’t degraded.  One of the greatest features of this community is the balance between open-mindedness and content quality. That said, sign me up as a computer science (set theory, etc.) contact.  I like programming, RE, and stuff, but I’m far more com&hellip;", "@pry0cc and @fraq  recently announced that 0x00sec will be reformed. They did this in an internal thread in the VIP loungue. I am not the right person to explain it to the big public (the staff will do in the near future probably), but basically we want 0x00sec to be more varied instead of being sol&hellip;", "@pry0cc and @fraq  recently announced that 0x00sec will be reformed. They did this in an internal thread in the VIP loungue. I am not the right person to explain it to the big public (the staff will do in the near future probably), but basically we want 0x00sec to be more varied instead of being sol&hellip;", "@pry0cc and @fraq  recently announced that 0x00sec will be reformed. They did this in an internal thread in the VIP loungue. I am not the right person to explain it to the big public (the staff will do in the near future probably), but basically we want 0x00sec to be more varied instead of being sol&hellip;", "I don’t really care how it is called, as long as the principle remains the same. Call it whatever suits 0x00sec. I came up with the name “0x00Helpers” because I had to give it some name.", "I don’t really care how it is called, as long as the principle remains the same. Call it whatever suits 0x00sec. I came up with the name “0x00Helpers” because I had to give it some name.", "@pry0cc and @fraq  recently announced that 0x00sec will be reformed. They did this in an internal thread in the VIP loungue. I am not the right person to explain it to the big public (the staff will do in the near future probably), but basically we want 0x00sec to be more varied instead of being sol&hellip;", "Yeah, this is a great idea with caveats. Let’s call this what it is: A mentorship program. I’d love to see labels by names that call people out as mentors who can help people with the things you mentioned such as suggesting topics, providing editorial assistance, etc.", "This is a cool idea, but it should not be called 0x00helpers, it should be called 0x00support or something… As for whether nmap/noobish tutorials are allowed, they are tolerated but not encouraged. You’re free to post a detailed nmap tutorial, but if you aren’t doing anything more than documenting &hellip;", "@pry0cc and @fraq  recently announced that 0x00sec will be reformed. They did this in an internal thread in the VIP loungue. I am not the right person to explain it to the big public (the staff will do in the near future probably), but basically we want 0x00sec to be more varied instead of being sol&hellip;", "We can call it whatever we (you) want. The principle remains the same(?) That makes perfect sense and that is the way it should be. ++", "@pry0cc and @fraq  recently announced that 0x00sec will be reformed. They did this in an internal thread in the VIP loungue. I am not the right person to explain it to the big public (the staff will do in the near future probably), but basically we want 0x00sec to be more varied instead of being sol&hellip;", "OSINT 0x02 - LinkedIn is not just for jobsSup 0x00’ers, that’s right, I am back with another banger of an article, ready? If you read my last article on OSINT, you’ll know a little bit on how to find dirt on companies, their assets, and how to do all of that passively. Well now I am going to show &hellip;", "Good points indeed, but something tells me they never anticipated that their attack would be this massive. “Aight guys let’s use this exploit and let’s infect some home netw… HOLY SHIT WE INFECTED HALF OF EUROPE!”", "1.) Connect VPN + TOR in this arrangement: You -&gt; TOR + VPN -&gt; VPN -&gt; destination 2.) do some google dorks for stolen credit card dumps. 3.) Buy BTC with them 4.) Send the BTC to another address in your wallet. Do this atleast 3 times. 5.) Send your BTC through a mixer service. 6.) Again, send &hellip;", "Engineers =/= hackers. By that logic, all my classmates should be hackers. The fact that I need to come up with creative solutions to their problems tells me that is a lie. -Phoenix750", "Hi thanks for the reply. i just bought the Arduino Uno some sensors and more important soldering iron hope it would be fun  i will be in touch with you thanks &lt;3", "@haalim, I can only assist you on the hardware part here. If you are serious about hardware, then buy either an Arduino, RPI, some PIC microcontrollers and some basic components and make something with them and program them. You could use some tutorials as a starting point but after that you should&hellip;", "@haalim, I can only assist you on the hardware part here. If you are serious about hardware, then buy either an Arduino, RPI, some PIC microcontrollers and some basic components and make something with them and program them. You could use some tutorials as a starting point but after that you should&hellip;", "Hello all, Nestor10 here to share a couple things I’ve learned in my day job as an infosec samurai. If you want to know some vague things about me, you can check out my introduction. So a few months ago, I noticed some emails coming in with really sketchy attachments - a few dozen had been delivere&hellip;", "If you’re serious about reverse engineering Windows applications and malware, you might as well get a Windows virtual machine. Ollydbg is only one of the many tools you’ll need and only using it is not sufficient, e.g. it does not support 64-bit or .NET PE files.", "Are you familiar with Linux? I’d say that would be a good place to start. If you want to seriously get into cyber, a familiarity with Linux is a must. If you already know how to use Linux and feel comfortable with most distros, I would start with beginner CTF challenges or find some boot2root machi&hellip;", "This is my solution to the Tr0ll: 1 challenge by Maleus. The challenge and his webpage can be found here: https://www.vulnhub.com/entry/tr0ll-1,100/ Tr0ll was inspired by the constant trolling of the machines within the OSCP labs. The goal is simple, gain root and get Proof.txt from the /root &hellip;", "I am really liking these Vulnhub challenges, finally something else other than RE. Viva la revolucion!", "There is a saying in prison, “get in where you fit in”. This applies to anything and not just prison. Like @Evalion said, you’ll find where you belong just by reading and doing. there are websites that will help you, here is a list of CTF’s to get started with, http://captf.com/practice-ctf/", "Hello, yesterday is when I discovered this forum. I’m not very experienced in this field but I’m aspiring to become a pen. tester. Most of the topics here are too advanced for me, and I’d just like to know where I can get started. Thank you!", "CTF is always a great place to start. Challenging yourself is the best way to get experience There is a CTF section here, besides lots of reading vulnhubs also help best of luck in your travels", "One of the big hurdles I experienced when entering this industry was that I was intimidated by all the stuff there is to learn, just like you are now. Thankfully, you don’t need to know everything. Some like reverse engineering binaries, others like tinkering, and that is fine! You’ll find your plac&hellip;", "WordPress is the Flash Player of the CMS world. [image]", "[image] No but seriously, this is an important step forward and everyone can benefit from it. Thanks man, next round is on me. If there ever is one. -Phoenix750", "Granted, curiosity should be encouraged. But instead of letting people do crimes blindly and thus creating more outlaws, perhaps we should invest time in getting their “hunger for steak” through legitimate methods (meaning that someone with an interest in computers should be taught how to set up a &hellip;", "You are right, it completely depends on the user and how he/she uses his abilities. But still there are alot of parents and schools that don’t encourage curiosity, the curious kid or teen or whatever he is can also be a scientist, teacher, musician or even a junkie. I think curiosity is the start to&hellip;", "Granted, curiosity should be encouraged. But instead of letting people do crimes blindly and thus creating more outlaws, perhaps we should invest time in getting their “hunger for steak” through legitimate methods (meaning that someone with an interest in computers should be taught how to set up a &hellip;", "The engineer you know does that. That does not mean every single engineer on the planet does that. There is a crucial difference between these two terms that both @Evalion @ricksanchez and @fraq are missing. “Engineer” is a job title, anybody can attain this with schooling. “Hacker” is a mindset. &hellip;", "Pretty sure I hit on that, @pry0cc", "So you’re claiming that thousands of young people that graduate every year, have a piece of paper on that wall that is a lie? THE DEGREE IS A LIE", "You are right, it completely depends on the user and how he/she uses his abilities. But still there are alot of parents and schools that don’t encourage curiosity, the curious kid or teen or whatever he is can also be a scientist, teacher, musician or even a junkie. I think curiosity is the start to&hellip;", "We used to hate shitposts on Null Byte, now we got this…  [image]", "The engineer you know does that. That does not mean every single engineer on the planet does that. There is a crucial difference between these two terms that both @Evalion @ricksanchez and @fraq are missing. “Engineer” is a job title, anybody can attain this with schooling. “Hacker” is a mindset. &hellip;", "While I do agree, I must tell you that not all hackers are non-criminals. Are hackers criminals? Ofcourse not, not always. CAN hackers be criminals? Well, stealing from an innocent man is a crime, so i’d say yes. We have to keep this in mind as “the good guys”. -Phoenix750", "WordPress is the Flash Player of the CMS world. [image]", "What is the difference between a soldier and a terrorist? One is trained and employed by the government, the other by a criminal organization. But their tactics remain mostly the same. Both fire rifles, throw grenades, and kill others for different reasons. One to maintain public order, the other t&hellip;", "{Enginers} ∩ {Hackers} is large. Very large. In fact, you could even say that the discipline of engineering encourages that sort of &quot;hacker mentality. Therefore, a large number of engineers are hackers and vice versa. The fact remains that a hacker and an engineer are not synonymous. Like it or n&hellip;", "Clearly you don’t understand what an engineer is. Engineers are designers who solve problems. Hackers are also problem solvers. What problems do hackers they solve? Weaknesses in systems. Sounds like the work of engineers to me.", "I would honestly expand that a bit further and say we need the weird thinkers in every discipline. We need medical hackers. We need agricultural hackers. We need all kinds of hackers in every field.", "Engineers =/= hackers. By that logic, all my classmates should be hackers. The fact that I need to come up with creative solutions to their problems tells me that is a lie. -Phoenix750", "I would honestly expand that a bit further and say we need the weird thinkers in every discipline. We need medical hackers. We need agricultural hackers. We need all kinds of hackers in every field.", "What is the difference between a soldier and a terrorist? One is trained and employed by the government, the other by a criminal organization. But their tactics remain mostly the same. Both fire rifles, throw grenades, and kill others for different reasons. One to maintain public order, the other t&hellip;", "What is the difference between a soldier and a terrorist? One is trained and employed by the government, the other by a criminal organization. But their tactics remain mostly the same. Both fire rifles, throw grenades, and kill others for different reasons. One to maintain public order, the other t&hellip;", "What is the difference between a soldier and a terrorist? One is trained and employed by the government, the other by a criminal organization. But their tactics remain mostly the same. Both fire rifles, throw grenades, and kill others for different reasons. One to maintain public order, the other t&hellip;", "We Need Hackers Now More Than EverI“Yes, I am a criminal. My crime is that of curiosity.” In the years since The Hacker Manifesto was first typed out, much of the internet has changed. It has grown in both size and scope. New protocols have been invented. The web was born. It is altogether diffe&hellip;", "What is the difference between a soldier and a terrorist? One is trained and employed by the government, the other by a criminal organization. But their tactics remain mostly the same. Both fire rifles, throw grenades, and kill others for different reasons. One to maintain public order, the other t&hellip;", "WordPress is the Flash Player of the CMS world. [image]", "WordPress is the Flash Player of the CMS world. [image]", "We often forget that we also started somewhere and it was hard. Publishing articles like this on 0x00sec makes it easier for new people. Good job @Valentine, I myself am going to do a series like this sooner or later. However, I disagree that live booting is the safest option for newcomers. The saf&hellip;", "This topic was automatically closed after 30 days. New replies are no longer allowed.", "1.) Combat knife, tomahawk, flashbangs, pistol or if possible a SMG, and other lethal CQC weaponry. Just in case the “non destructive” tactic fails. Seriously though, if you get discovered in your stealth, do you submit to arrest immediately when you know you were absolutely in the wrong? OF COURSE &hellip;", "1.) Combat knife, tomahawk, flashbangs, pistol or if possible a SMG, and other lethal CQC weaponry. Just in case the “non destructive” tactic fails. Seriously though, if you get discovered in your stealth, do you submit to arrest immediately when you know you were absolutely in the wrong? OF COURSE &hellip;", "Now this is not a programming tutorial as most of you are probably hoping for, but I think most of you (if not all) ever had to use git. Wether it is to get involved in our Gitlab or to clone a nice little piece of software you found from GitHub, you’ll most likely use it in the future. I am current&hellip;", "WordPress is the Flash Player of the CMS world. [image]", "I own one of these. Extremely useful! The good old digital multimeter &amp; oscilloscope are the tools that makes a hardware hacker. Don’t you dare consider yourself as one if you don’t have these two! To read firmware from PIC’s, I use a “PICKit 2” debugger from Microchip. But the multimeter &amp; oscil&hellip;", "We often forget that we also started somewhere and it was hard. Publishing articles like this on 0x00sec makes it easier for new people. Good job @Valentine, I myself am going to do a series like this sooner or later. However, I disagree that live booting is the safest option for newcomers. The saf&hellip;", "I guess that is just me then. When I make something, it just needs to work, that’s all.", "Ofcourse it is not realistic. But tell me in all honesty: does it really need to be? I play games to do things that I can’t do in real life, not a “daily life simulator”. Realism has to make way for great entertainment (and Watch Dogs 2 was fun as hell to play). And I am perfectly fine with the hac&hellip;", "I own one of these. Extremely useful! The good old digital multimeter &amp; oscilloscope are the tools that makes a hardware hacker. Don’t you dare consider yourself as one if you don’t have these two! To read firmware from PIC’s, I use a “PICKit 2” debugger from Microchip. But the multimeter &amp; oscil&hellip;", "Hi phoenix750 am also a bit confuse about STELF please how did figure it out.Thanks", "10/10 just for the name “raspberry pry” -Phoenix750", "I like the doggos because I have one myself. Too bad there aren’t any border collies (well except that mixed one). I added a link to the LOGO! PLC from siemens. They are excellent, and are the best PLC for people that are new to PLC’s. Their possibilities are endless. Also, the newest version (the &hellip;", "Ofcourse it is not realistic. But tell me in all honesty: does it really need to be? I play games to do things that I can’t do in real life, not a “daily life simulator”. Realism has to make way for great entertainment (and Watch Dogs 2 was fun as hell to play). And I am perfectly fine with the hac&hellip;", "Are we really going to use the cringy “swag” name? on-topic: do the dog accessories come in border collie size (medium size)?", "Good idea, Or maybe next time I was in the US, I take that myself", "Maybe he’s a ghost hacker which has to travel around the world for disguising his location", "Get it delivered at a friend or relative’s address and pick it up there?", "Those buttons look damn nice, gonna buy them very soon so I can chain-mail my bags in button-armor. Speaking of watchdogs, to this day I still love the bayer matrix dithering style and recreated some of its style myself. [image] [image]", "Ofcourse it is not realistic. But tell me in all honesty: does it really need to be? I play games to do things that I can’t do in real life, not a “daily life simulator”. Realism has to make way for great entertainment (and Watch Dogs 2 was fun as hell to play). And I am perfectly fine with the hac&hellip;", "I completely get your point. It is fun as hell, it’s entertainment, that is it’s point.", "How about  “style”? Or is that actually worse? Btw did I mention that the buttons look like they come straight out of Watch Dogs 2? Look at Marcus’ bag. I could see some 0x00sec buttons attached to his bag too.  [image]", "Ofcourse it is not realistic. But tell me in all honesty: does it really need to be? I play games to do things that I can’t do in real life, not a “daily life simulator”. Realism has to make way for great entertainment (and Watch Dogs 2 was fun as hell to play). And I am perfectly fine with the hac&hellip;", "Are we really going to use the cringy “swag” name? on-topic: do the dog accessories come in border collie size (medium size)?", "Ofcourse it is not realistic. But tell me in all honesty: does it really need to be? I play games to do things that I can’t do in real life, not a “daily life simulator”. Realism has to make way for great entertainment (and Watch Dogs 2 was fun as hell to play). And I am perfectly fine with the hac&hellip;", "Ofcourse it is not realistic. But tell me in all honesty: does it really need to be? I play games to do things that I can’t do in real life, not a “daily life simulator”. Realism has to make way for great entertainment (and Watch Dogs 2 was fun as hell to play). And I am perfectly fine with the hac&hellip;", "Ofcourse it is not realistic. But tell me in all honesty: does it really need to be? I play games to do things that I can’t do in real life, not a “daily life simulator”. Realism has to make way for great entertainment (and Watch Dogs 2 was fun as hell to play). And I am perfectly fine with the hac&hellip;", "Oh no. Are you comparing 0x00sec to DedSec? Unrelated note, it is mad that they think that Marcus can do parkour with all that kit, and a laptop bag. Mate try running with a laptop bag, it will not stay on your back.", "How about  “style”? Or is that actually worse? Btw did I mention that the buttons look like they come straight out of Watch Dogs 2? Look at Marcus’ bag. I could see some 0x00sec buttons attached to his bag too.  [image]", "How about  “style”? Or is that actually worse? Btw did I mention that the buttons look like they come straight out of Watch Dogs 2? Look at Marcus’ bag. I could see some 0x00sec buttons attached to his bag too.  [image]", "How about  “style”? Or is that actually worse? Btw did I mention that the buttons look like they come straight out of Watch Dogs 2? Look at Marcus’ bag. I could see some 0x00sec buttons attached to his bag too.  [image]", "How about  “style”? Or is that actually worse? Btw did I mention that the buttons look like they come straight out of Watch Dogs 2? Look at Marcus’ bag. I could see some 0x00sec buttons attached to his bag too.  [image]", "Are we really going to use the cringy “swag” name? on-topic: do the dog accessories come in border collie size (medium size)?", "Make a suggestion and we can change it.", "Are we really going to use the cringy “swag” name? on-topic: do the dog accessories come in border collie size (medium size)?", "The phantom 3 looks like it can lift a pi. Not sure about jumpers.", "Good points indeed, but something tells me they never anticipated that their attack would be this massive. “Aight guys let’s use this exploit and let’s infect some home netw… HOLY SHIT WE INFECTED HALF OF EUROPE!”", "1.) Connect VPN + TOR in this arrangement: You -&gt; TOR + VPN -&gt; VPN -&gt; destination 2.) do some google dorks for stolen credit card dumps. 3.) Buy BTC with them 4.) Send the BTC to another address in your wallet. Do this atleast 3 times. 5.) Send your BTC through a mixer service. 6.) Again, send &hellip;", "I make all sorts of improvised weapons to introduce “the militarized hacker”, which is basically a hacker that has a more aggressive &amp; direct approach (like in Watch Dogs/Watch Dogs 2). This goes from long-lasting molotov cocktails, to plastic explosives to breach walls &amp; smoke bombs for distraction&hellip;", "1.) Connect VPN + TOR in this arrangement: You -&gt; TOR + VPN -&gt; VPN -&gt; destination 2.) do some google dorks for stolen credit card dumps. 3.) Buy BTC with them 4.) Send the BTC to another address in your wallet. Do this atleast 3 times. 5.) Send your BTC through a mixer service. 6.) Again, send &hellip;", "I’m using a Nexus 5X modified to the bone. Ofc I rooted it, I have pure nexus installed (7.1.2) (RR was unstable af for me), TWRP as recovery and ElementalX kernel. I have CSploit installed on it. I am running Nova Launcher with the Iride UI icon pack. I have Beans Gapps full installed. Also, if yo&hellip;", "What @twyKs said. You get root, and so you can overwrite key features on the device.", "No, but you get full root access. For installing kernel or custom rom you need different type of exploit (u don’t need only the one for jailbreak the iphone).", "So you’re saying that with a jailbreak you can install custom OS’s and kernels on your iPhone?", "When you jailbreak you get full root. You have the potential power to run Debian on it (if you could get a Linux kernel to run on their chip).", "For a phone, taking pictures, and social media, an iPhone is a really good platform. But as soon as you want to do fun stuff (root and customization), Android is king. Yeah, you can jailbreak an iPhone, but the support for pentesting is nowhere near as mature as Android Root. Update: I have just fl&hellip;", "Totally agree with that. An iPhone does what it is supposed to do and it does it pretty good tbh but that is where it ends, and I just need to customize and overclock my phone to the max! Sure an iPhone can be jailbroken, but jailbreaking is basically turning your iPhone into a non-rooted device (i&hellip;", "While @_py is right for the most part, he forgot to say an important thing: if you don’t understand the source, leave it. Don’t waste time reading something that doesn’t make sense to you! However, that is NOT the same as giving up! What I mean by “leave it” is to search for something that explains&hellip;", "Maybe the “quite impossible” is exaggerated but I mean that is not comfortable doing pentesting on phone, I think is far better a laptop, but a tablet with keyboard is acceptable too. Yeah, I agree with you!", "They have the ability, that does not mean they should be used. An Alfa card is far better at it. A Pi with an Alfa card connected and a power supply in your backpack is the best device you could have.", "Never tried neither NetHunter or Linux Deploy, but my opinion is that i would need a laptop or something else for pentesting, from phone is quite impossible right now. Sure  If you need help, you can hit a PM too ahaha", "I disagree. A rooted android phone can do everything a laptop running Linux can do, except for tasks that require your wifi chip to be in monitor mode (for wifi cracking). I think even bluetooth hacking is possible using the phone’s default bluetooth chip.", "Correct, it does. But it is really unstable, and also quite insecure to just emulating Kali using Linux Deploy (SELinux is disabled in Nethunter for example). Nethunter doesn’t grant much advantage other than automating certain tasks (which can also easily be accomplished by bash scripts anyway).", "Never tried neither NetHunter or Linux Deploy, but my opinion is that i would need a laptop or something else for pentesting, from phone is quite impossible right now. Sure  If you need help, you can hit a PM too ahaha", "Well the nexus 5X is powerful even now, it supports too kali linux right? If you need help with your Galaxy, make sure to hit me a PM", "Correct, it does. But it is really unstable, and also quite insecure to just emulating Kali using Linux Deploy (SELinux is disabled in Nethunter for example). Nethunter doesn’t grant much advantage other than automating certain tasks (which can also easily be accomplished by bash scripts anyway).", "Well the nexus 5X is powerful even now, it supports too kali linux right? If you need help with your Galaxy, make sure to hit me a PM", "I’m using a Nexus 5X modified to the bone. Ofc I rooted it, I have pure nexus installed (7.1.2) (RR was unstable af for me), TWRP as recovery and ElementalX kernel. I have CSploit installed on it. I am running Nova Launcher with the Iride UI icon pack. I have Beans Gapps full installed. Also, if yo&hellip;", "Hello members, I just joined this forum and is a nice place to meet people and discuss, I’m really happy for this. Now I want to ask if you have got a smartphone, and what do you have, if is Rooted (Android) or Jail-broken (iPhone), ROM, recovery, kernel, security/privacy apps, and whatever you ha&hellip;", "I’m using a Nexus 5X modified to the bone. Ofc I rooted it, I have pure nexus installed (7.1.2) (RR was unstable af for me), TWRP as recovery and ElementalX kernel. I have CSploit installed on it. I am running Nova Launcher with the Iride UI icon pack. I have Beans Gapps full installed. Also, if yo&hellip;", "Your weekend challenge is here! This is a simple challenge. Do not look for very sophisticated stuff. You know… the devil’s in the details. Boring to deathEasyInterestingWTF0voters Show results#Objective You have to find the secret key and the secret message. That’s it Extra&hellip;", "1.) Connect VPN + TOR in this arrangement: You -&gt; TOR + VPN -&gt; VPN -&gt; destination 2.) do some google dorks for stolen credit card dumps. 3.) Buy BTC with them 4.) Send the BTC to another address in your wallet. Do this atleast 3 times. 5.) Send your BTC through a mixer service. 6.) Again, send &hellip;", "The phantom 3 looks like it can lift a pi. Not sure about jumpers.", "Somebody needs to add some drones here… Or RC jumpers we can strap a pi to. Anybody with experience with them?", "I guess that is just me then. When I make something, it just needs to work, that’s all.", "That’s 100% not a mindset of a hardware hacker or any hacker for that matter.", "Nope, and I doubt there are any because it really is not beneficial in any way. It certainly won’t be cheaper and it will be unstable af in the first few tries probably, increasing the cost. Let alone that there is software involved that us hardware guys don’t understand. The big difference betwee&hellip;", "I like the doggos because I have one myself. Too bad there aren’t any border collies (well except that mixed one). I added a link to the LOGO! PLC from siemens. They are excellent, and are the best PLC for people that are new to PLC’s. Their possibilities are endless. Also, the newest version (the &hellip;", "Stop being so negative and practical  Hacking and making something work isn’t about cost effectiveness. It’s because making your own stuff is cool! I don’t think you can talk for all hardware guys, after all, there are a lot of them. In time too, things do come down in price. This project is a mix&hellip;", "@Evalion Know of any hardware hackers that would be up to the task of making a diy lan turtle??", "Nope, and I doubt there are any because it really is not beneficial in any way. It certainly won’t be cheaper and it will be unstable af in the first few tries probably, increasing the cost. Let alone that there is software involved that us hardware guys don’t understand. The big difference betwee&hellip;", "@Evalion Know of any hardware hackers that would be up to the task of making a diy lan turtle??", "1.) Connect VPN + TOR in this arrangement: You -&gt; TOR + VPN -&gt; VPN -&gt; destination 2.) do some google dorks for stolen credit card dumps. 3.) Buy BTC with them 4.) Send the BTC to another address in your wallet. Do this atleast 3 times. 5.) Send your BTC through a mixer service. 6.) Again, send &hellip;", "Good points indeed, but something tells me they never anticipated that their attack would be this massive. “Aight guys let’s use this exploit and let’s infect some home netw… HOLY SHIT WE INFECTED HALF OF EUROPE!”", "I tried this once but my tiny ass drone couldn’t lift it (it was a cheap 30$ one anyway). But definitely possible.", "Nice to hear, but can they lift a Pi? EDIT: I looked at their website, the offer is gone", "there were 60$ ones in aldi last week.You might be able to order them still if you want", "If they had been more thorough and more smarter about it, their malware would have probably lasted longer than three days. Not to mention that they handled the payments manually like the apes they are.", "I tried this once but my tiny ass drone couldn’t lift it (it was a cheap 30$ one anyway). But definitely possible.", "I’m always around watching you and watching them. A lot of personal work, busy revamping my old website and learning a lot  so pretty occupied lately.", "Good points indeed, but something tells me they never anticipated that their attack would be this massive. “Aight guys let’s use this exploit and let’s infect some home netw… HOLY SHIT WE INFECTED HALF OF EUROPE!”", "1.) Connect VPN + TOR in this arrangement: You -&gt; TOR + VPN -&gt; VPN -&gt; destination 2.) do some google dorks for stolen credit card dumps. 3.) Buy BTC with them 4.) Send the BTC to another address in your wallet. Do this atleast 3 times. 5.) Send your BTC through a mixer service. 6.) Again, send &hellip;", "I like the doggos because I have one myself. Too bad there aren’t any border collies (well except that mixed one). I added a link to the LOGO! PLC from siemens. They are excellent, and are the best PLC for people that are new to PLC’s. Their possibilities are endless. Also, the newest version (the &hellip;", "I like the doggos because I have one myself. Too bad there aren’t any border collies (well except that mixed one). I added a link to the LOGO! PLC from siemens. They are excellent, and are the best PLC for people that are new to PLC’s. Their possibilities are endless. Also, the newest version (the &hellip;", "Well look at that, Our sergeant is still alive! It has been a while old friend. Where did you go?", "I like the doggos because I have one myself. Too bad there aren’t any border collies (well except that mixed one). I added a link to the LOGO! PLC from siemens. They are excellent, and are the best PLC for people that are new to PLC’s. Their possibilities are endless. Also, the newest version (the &hellip;", "Ah damn another wiki page i have to bookmark in case i win the lottery or this fine Nigerian prince is finally sending me these 50 million $ Edit: as of right now all of the amazon links are a dead end and are showing “the dogs of amazon” lel  [image]", "Good points indeed, but something tells me they never anticipated that their attack would be this massive. “Aight guys let’s use this exploit and let’s infect some home netw… HOLY SHIT WE INFECTED HALF OF EUROPE!”", "@Evalion maybe this in a combination with “we have to get this shit released as fast as possible before everyone knows/read the nsa leak” @dtm i heard their support hotline was awesome and people way faster in reacting and more friendly. They even gave discount on the ransom to pay in some cases. N&hellip;", "Good points indeed, but something tells me they never anticipated that their attack would be this massive. “Aight guys let’s use this exploit and let’s infect some home netw… HOLY SHIT WE INFECTED HALF OF EUROPE!”", "Well look at that, Our sergeant is still alive! It has been a while old friend. Where did you go?", "Good points indeed, but something tells me they never anticipated that their attack would be this massive. “Aight guys let’s use this exploit and let’s infect some home netw… HOLY SHIT WE INFECTED HALF OF EUROPE!”", "Good points indeed, but something tells me they never anticipated that their attack would be this massive. “Aight guys let’s use this exploit and let’s infect some home netw… HOLY SHIT WE INFECTED HALF OF EUROPE!”", "Good points indeed, but something tells me they never anticipated that their attack would be this massive. “Aight guys let’s use this exploit and let’s infect some home netw… HOLY SHIT WE INFECTED HALF OF EUROPE!”", "If they had been more thorough and more smarter about it, their malware would have probably lasted longer than three days. Not to mention that they handled the payments manually like the apes they are.", "1.) Connect VPN + TOR in this arrangement: You -&gt; TOR + VPN -&gt; VPN -&gt; destination 2.) do some google dorks for stolen credit card dumps. 3.) Buy BTC with them 4.) Send the BTC to another address in your wallet. Do this atleast 3 times. 5.) Send your BTC through a mixer service. 6.) Again, send &hellip;", "Still doesn’t work on my Skype and I have the most recent version of Skype.", "Are you sure ? I tried it 2 days ago before adding it to this list and it worked !", "I just added csploit to the list!", "Just send them an IP grabber link using good old reliable SE.", "Yes, sadly. Do you know any alternatives?", "just a FIY, skype resolvers don’t work anymore on recent skype versions. Microsoft patched it. -Phoenix750", "I will try to submit this idea to Kali maintainers", "I will try to submit this idea to Kali maintainers", "Chuck Norris is a dead meme, normie. on-topic: good article as always. bookmarked it for later reference.", "Chuck Norris is a dead meme, normie. on-topic: good article as always. bookmarked it for later reference.", "Chuck Norris is a dead meme, normie. on-topic: good article as always. bookmarked it for later reference.", "@Evalion covfefe mate", "Chuck Norris is a dead meme, normie. on-topic: good article as always. bookmarked it for later reference.", "Chuck Norris is a dead meme, normie. on-topic: good article as always. bookmarked it for later reference.", "This should be included in the next Kali release. -Phoenix750", "Hi fellas, First of all, I wanted to apologize for my lack of activities the last month. Indeed, I was overwhelmed by my work and my training for my OSCP certification which was quite time consuming  By the same token, would you be interested in my feedback about OSCP? YesNo0voters &hellip;", "This should be included in the next Kali release. -Phoenix750", "Hello 0x00’ers! @zSec gave us the idea to make a Wiki with working services for things such as email relays, SMS spoofing and the like. Feel free to edit this and add things you have tried and tested. The more we add in useful things, with a very quick way to access them, the more useful this page w&hellip;", "Bash feels like I’m fighting it. ZSH just feels natural. Do what feels natural man", "@Evalion because other shells do it better. Better suggestions and autocomletions, more theming and customization options. It just makes you more faster and productive in terminal. Bash is very good for scripting, I don’t think a lot of people would write script in fish, or zsh", "Why would anyone not like the regular bash? It does what it is supposed to do.", "Almost by definition, if you’re doing performance tuning on a production system, you’re not a regular user. You’re an advanced user and almost certainly a professional.", "Great resources for those starting out (like me). Let’s hope I am persistent enough to read all this because I’m a bad reader  -Phoenix750", "Aye p33ps! Seeing as WannaCry took the world by storm recently, I thought that it’s probably a good time to introduce the world of malware analysis to this forum. In this post, I will write about how you guys can join in on the mayhem and play with some fire (and hopefully not get burnt in the proce&hellip;", "Now this is not a programming tutorial as most of you are probably hoping for, but I think most of you (if not all) ever had to use git. Wether it is to get involved in our Gitlab or to clone a nice little piece of software you found from GitHub, you’ll most likely use it in the future. I am current&hellip;", "@Evalion woop woop woop give the masses what they deserve.", "well they could just divide it by the max ipc and then do * 100%", "Now this is not a programming tutorial as most of you are probably hoping for, but I think most of you (if not all) ever had to use git. Wether it is to get involved in our Gitlab or to clone a nice little piece of software you found from GitHub, you’ll most likely use it in the future. I am current&hellip;", "NECROPOSTING ALERT Where’s number 2? Gotta give the people what they want!", "The big problem is that the IPC unit you talk about is too advanced for the regular computer user to understand ¯\\(ツ)/¯", "I make all sorts of improvised weapons to introduce “the militarized hacker”, which is basically a hacker that has a more aggressive &amp; direct approach (like in Watch Dogs/Watch Dogs 2). This goes from long-lasting molotov cocktails, to plastic explosives to breach walls &amp; smoke bombs for distraction&hellip;", "[image]", "What @oaktree said is absolutely right aswell. Learning from tutorials doesn’t teach you a lot. The best way to learn things is to set challenges and use documentation to accomplish your goals. For example when I learned Python: I had a challenge for myself to make a program that would take as many&hellip;", "Unfortunately there are no CTF’s without hard stuff because otherwise I would’ve participated. Good write up. +1 -Phoenix750", "I make all sorts of improvised weapons to introduce “the militarized hacker”, which is basically a hacker that has a more aggressive &amp; direct approach (like in Watch Dogs/Watch Dogs 2). This goes from long-lasting molotov cocktails, to plastic explosives to breach walls &amp; smoke bombs for distraction&hellip;", "I make all sorts of improvised weapons to introduce “the militarized hacker”, which is basically a hacker that has a more aggressive &amp; direct approach (like in Watch Dogs/Watch Dogs 2). This goes from long-lasting molotov cocktails, to plastic explosives to breach walls &amp; smoke bombs for distraction&hellip;", "I make all sorts of improvised weapons to introduce “the militarized hacker”, which is basically a hacker that has a more aggressive &amp; direct approach (like in Watch Dogs/Watch Dogs 2). This goes from long-lasting molotov cocktails, to plastic explosives to breach walls &amp; smoke bombs for distraction&hellip;", "I make all sorts of improvised weapons to introduce “the militarized hacker”, which is basically a hacker that has a more aggressive &amp; direct approach (like in Watch Dogs/Watch Dogs 2). This goes from long-lasting molotov cocktails, to plastic explosives to breach walls &amp; smoke bombs for distraction&hellip;", "Nah I don’t have that much of a problem sharing it, but I gotta keep 0x00’s PR up  -Phoenix750", "Nah I don’t have that much of a problem sharing it, but I gotta keep 0x00’s PR up  -Phoenix750", "Well shoot, that’s gonna be a tough one… Just kidding, look man, I’m not gonna force you to do anything, like you said,  some of those things are lethal so If you think it’s best not to share them, that’s totally fine. Otherwise, I’m game…", "As you all know, one of the most efficient ways of learning programming/InfoSec is by creating your own programs, hacking tools etc. But it can be frustrating at times to find a good project to work on. In order to solve this problem and give the members of this beautiful community the chance to dem&hellip;", "I make all sorts of improvised weapons to introduce “the militarized hacker”, which is basically a hacker that has a more aggressive &amp; direct approach (like in Watch Dogs/Watch Dogs 2). This goes from long-lasting molotov cocktails, to plastic explosives to breach walls &amp; smoke bombs for distraction&hellip;", "Haha what? You can’t just tease us like that man! Uz got to show us da goods…", "Can’t do that because most of these are lethal and that is bad for 0x00sec’s PR (I can PM them though if I can confirm you’re not a nutjob)  -Phoenix750", "Haha what? You can’t just tease us like that man! Uz got to show us da goods…", "I make all sorts of improvised weapons to introduce “the militarized hacker”, which is basically a hacker that has a more aggressive &amp; direct approach (like in Watch Dogs/Watch Dogs 2). This goes from long-lasting molotov cocktails, to plastic explosives to breach walls &amp; smoke bombs for distraction&hellip;", "I make all sorts of improvised weapons to introduce “the militarized hacker”, which is basically a hacker that has a more aggressive &amp; direct approach (like in Watch Dogs/Watch Dogs 2). This goes from long-lasting molotov cocktails, to plastic explosives to breach walls &amp; smoke bombs for distraction&hellip;", "I’ll give it a try next time", "I’ll give it a try next time", "Sorry to break it to you @SmartOne, but a hammer massage isn’t the best method. Sure it does a good job, but you’re wasting energy and are leaving scrapsa, + your HDD becomes unusable Simple magnetic HDD’s work according to Weber’s hypothesis (look it up) and Faraday’s law of induction (look it up &hellip;", "Basically, yes. What I explained is basically the process of degaussing but simplified. -Phoenix750", "Basically, yes. What I explained is basically the process of degaussing but simplified. -Phoenix750", "Huh. That’s pretty cool, it’s basically a homemade degausser, right (you’re just demagnetizing the device) ?", "Sorry to break it to you @SmartOne, but a hammer massage isn’t the best method. Sure it does a good job, but you’re wasting energy and are leaving scrapsa, + your HDD becomes unusable Simple magnetic HDD’s work according to Weber’s hypothesis (look it up) and Faraday’s law of induction (look it up &hellip;", "Great to see my words had effect. Great article. It’s simple yet in-deep. I like it. +1 -Phoenix750", "Sorry to break it to you @SmartOne, but a hammer massage isn’t the best method. Sure it does a good job, but you’re wasting energy and are leaving scrapsa, + your HDD becomes unusable Simple magnetic HDD’s work according to Weber’s hypothesis (look it up) and Faraday’s law of induction (look it up &hellip;", "Great to see my words had effect. Great article. It’s simple yet in-deep. I like it. +1 -Phoenix750", "##Guide for Data SanitizationHello everyone, hope you’ve been doing great! @Evalion recently said that we should post articles about something that we are learning, both to help us study and maybe to introduce other people to new subjects. That’s what this article is, so forgive (and please correct&hellip;", "##Guide for Data SanitizationHello everyone, hope you’ve been doing great! @Evalion recently said that we should post articles about something that we are learning, both to help us study and maybe to introduce other people to new subjects. That’s what this article is, so forgive (and please correct&hellip;", "Metasploitable  2 - IRC BackdoorThe first tutorial on Metasploitable 2 was about the vsftp backdoor, in this post we will talk about the IRC Backdoor. In the first part of this “How to” we will run the Metasploit exploit ( The skid way ). The second part we will write our own python exploit to tr&hellip;", "When I joined NB 3-4 years ago I didn’t expect things to turn out the way they did! 0x00 surely is a large improvement over the original NB, but we still have a lot to live up to. In terms of projects, articles aimed at all skill levels, etc. That is why I am calling out to the 0x00sec community to&hellip;", "When I joined NB 3-4 years ago I didn’t expect things to turn out the way they did! 0x00 surely is a large improvement over the original NB, but we still have a lot to live up to. In terms of projects, articles aimed at all skill levels, etc. That is why I am calling out to the 0x00sec community to&hellip;", "When I joined NB 3-4 years ago I didn’t expect things to turn out the way they did! 0x00 surely is a large improvement over the original NB, but we still have a lot to live up to. In terms of projects, articles aimed at all skill levels, etc. That is why I am calling out to the 0x00sec community to&hellip;", "When I joined NB 3-4 years ago I didn’t expect things to turn out the way they did! 0x00 surely is a large improvement over the original NB, but we still have a lot to live up to. In terms of projects, articles aimed at all skill levels, etc. That is why I am calling out to the 0x00sec community to&hellip;", "Now this is not a programming tutorial as most of you are probably hoping for, but I think most of you (if not all) ever had to use git. Wether it is to get involved in our Gitlab or to clone a nice little piece of software you found from GitHub, you’ll most likely use it in the future. I am current&hellip;", "I’ll try to post a lot more stuff in the next couple of weeks… Sou you can count me in on that task of shaping the community to a better place", "When I joined NB 3-4 years ago I didn’t expect things to turn out the way they did! 0x00 surely is a large improvement over the original NB, but we still have a lot to live up to. In terms of projects, articles aimed at all skill levels, etc. That is why I am calling out to the 0x00sec community to&hellip;", "When I joined NB 3-4 years ago I didn’t expect things to turn out the way they did! 0x00 surely is a large improvement over the original NB, but we still have a lot to live up to. In terms of projects, articles aimed at all skill levels, etc. That is why I am calling out to the 0x00sec community to&hellip;", "I’ll try to post a lot more stuff in the next couple of weeks… Sou you can count me in on that task of shaping the community to a better place", "When I joined NB 3-4 years ago I didn’t expect things to turn out the way they did! 0x00 surely is a large improvement over the original NB, but we still have a lot to live up to. In terms of projects, articles aimed at all skill levels, etc. That is why I am calling out to the 0x00sec community to&hellip;", "0x00sec turns 0x01!We made it, guys! 0x00sec is a year old. We went from a simple Jekyll blog with only three articles to a respectably-sized, full-on forum with over 500 users. Each day, one or more people took a chance and signed up. [image] Countless Introductions showcase our diversity of int&hellip;", "When I joined NB 3-4 years ago I didn’t expect things to turn out the way they did! 0x00 surely is a large improvement over the original NB, but we still have a lot to live up to. In terms of projects, articles aimed at all skill levels, etc. That is why I am calling out to the 0x00sec community to&hellip;", "When @dtm has too much time on his hands, he hacks games. When I have too much time on my hands…  [image]EDIT: No this isn’t my speaker burning, but I’ve done similar things, if not worse. EDIT 2: For those crazy enough to try this (or those who have lost their will to live): you can achieve thi&hellip;", "Bruh, I didn’t say Reverse Engineering is beginner-friendly. If you and @Evalion actually bothered to sign up you would see what I’m talking about. No need to have a passive attitude towards CTFs. They are meant to make you feel dumb in order to improve. Embrace it. There was a task where you had &hellip;", "Ha “beginner friendly tasks” Reverse Engineering is hard. That’s definitely true when you’re just starting out. @Evalion, we need to figure out a way to bridge the gap between complete beginner and intermediate. I am struggling with this myself. When we break it we should share our findings.", "Unfortunately there are no CTF’s without hard stuff because otherwise I would’ve participated. Good write up. +1 -Phoenix750", "That is why I am not covering remote repositories right now. I first want to make sure I (and the readers) understand basic git use first. -Phoenix750", "Unfortunately there are no CTF’s without hard stuff because otherwise I would’ve participated. Good write up. +1 -Phoenix750", "Hello folks! I hope you’re doing great. This is my first ever CTF write-up yay! During the last couple of weeks, @IoTh1nkN0t, @dtm, @kowalski and myself, took part in picoCTF. It’s an “entry-level” CTF, which practically means, it’s made for CTF rookies! Well, you needed a little bit of experience &hellip;", "That is why I am not covering remote repositories right now. I first want to make sure I (and the readers) understand basic git use first. -Phoenix750", "#1793D1 is my favourite blue.", "touch pry.txttouch oaktree.txttouch 0x00sec.txtLooks like someone is riding the 0x00sec train kek. (jk)", "Now this is not a programming tutorial as most of you are probably hoping for, but I think most of you (if not all) ever had to use git. Wether it is to get involved in our Gitlab or to clone a nice little piece of software you found from GitHub, you’ll most likely use it in the future. I am current&hellip;", "Now this is not a programming tutorial as most of you are probably hoping for, but I think most of you (if not all) ever had to use git. Wether it is to get involved in our Gitlab or to clone a nice little piece of software you found from GitHub, you’ll most likely use it in the future. I am current&hellip;", "Now this is not a programming tutorial as most of you are probably hoping for, but I think most of you (if not all) ever had to use git. Wether it is to get involved in our Gitlab or to clone a nice little piece of software you found from GitHub, you’ll most likely use it in the future. I am current&hellip;", "Now this is not a programming tutorial as most of you are probably hoping for, but I think most of you (if not all) ever had to use git. Wether it is to get involved in our Gitlab or to clone a nice little piece of software you found from GitHub, you’ll most likely use it in the future. I am current&hellip;", "Now this is not a programming tutorial as most of you are probably hoping for, but I think most of you (if not all) ever had to use git. Wether it is to get involved in our Gitlab or to clone a nice little piece of software you found from GitHub, you’ll most likely use it in the future. I am current&hellip;", "Now this is not a programming tutorial as most of you are probably hoping for, but I think most of you (if not all) ever had to use git. Wether it is to get involved in our Gitlab or to clone a nice little piece of software you found from GitHub, you’ll most likely use it in the future. I am current&hellip;", "try a color picker online?", "Now this is not a programming tutorial as most of you are probably hoping for, but I think most of you (if not all) ever had to use git. Wether it is to get involved in our Gitlab or to clone a nice little piece of software you found from GitHub, you’ll most likely use it in the future. I am current&hellip;", "Now this is not a programming tutorial as most of you are probably hoping for, but I think most of you (if not all) ever had to use git. Wether it is to get involved in our Gitlab or to clone a nice little piece of software you found from GitHub, you’ll most likely use it in the future. I am current&hellip;", "Now this is not a programming tutorial as most of you are probably hoping for, but I think most of you (if not all) ever had to use git. Wether it is to get involved in our Gitlab or to clone a nice little piece of software you found from GitHub, you’ll most likely use it in the future. I am current&hellip;", "Now this is not a programming tutorial as most of you are probably hoping for, but I think most of you (if not all) ever had to use git. Wether it is to get involved in our Gitlab or to clone a nice little piece of software you found from GitHub, you’ll most likely use it in the future. I am current&hellip;", "Rice up you say eh? https://www.youtube.com/watch?v=i8a3gjt_Ar0 Nice article. I am also running Arch (antergos) but with Cinnamon. Here is a screenshot for those interested:  [image]It’s not much really. Just Cinnamon with a custom theme and icons. But it gets the job done. BTW neofetch is disp&hellip;", "This is just the beginning though. I customized the menu etc. too after this screenshot -Phoenix750", "Oh damn. When you said cinnamon looked nice, you really were not kidding… Good job boy… I’m gonna have to go rice mine up more!!", "WordPress is the Flash Player of the CMS world. [image]", "Oh damn. When you said cinnamon looked nice, you really were not kidding… Good job boy… I’m gonna have to go rice mine up more!!", "Rice up you say eh? https://www.youtube.com/watch?v=i8a3gjt_Ar0 Nice article. I am also running Arch (antergos) but with Cinnamon. Here is a screenshot for those interested:  [image]It’s not much really. Just Cinnamon with a custom theme and icons. But it gets the job done. BTW neofetch is disp&hellip;", "I’m not good at designing and this kind of stuff, but I would suggest simply take your terminal colors. So background dark grey and foreground this light blue / light grey. Or background without any color and foreground dark grey and light grey", "Yeah i know my conky looks ugly but I am looking for a nice blue color that is compatible with my desktop but still “dark blue” enough that it stands out. You got any recomendations? -Phoenix750", "Rice up you say eh? https://www.youtube.com/watch?v=i8a3gjt_Ar0 Nice article. I am also running Arch (antergos) but with Cinnamon. Here is a screenshot for those interested:  [image]It’s not much really. Just Cinnamon with a custom theme and icons. But it gets the job done. BTW neofetch is disp&hellip;", "looks pretty awesome  maybe adjust your conky a bit more to your design really? that’s insane Arch ftw[image]", "Yeah i know my conky looks ugly but I am looking for a nice blue color that is compatible with my desktop but still “dark blue” enough that it stands out. You got any recomendations? -Phoenix750", "Rice up you say eh? https://www.youtube.com/watch?v=i8a3gjt_Ar0 Nice article. I am also running Arch (antergos) but with Cinnamon. Here is a screenshot for those interested:  [image]It’s not much really. Just Cinnamon with a custom theme and icons. But it gets the job done. BTW neofetch is disp&hellip;", "looks pretty awesome  maybe adjust your conky a bit more to your design really? that’s insane Arch ftw[image]", "Rice up you say eh? https://www.youtube.com/watch?v=i8a3gjt_Ar0 Nice article. I am also running Arch (antergos) but with Cinnamon. Here is a screenshot for those interested:  [image]It’s not much really. Just Cinnamon with a custom theme and icons. But it gets the job done. BTW neofetch is disp&hellip;", "Rice up you say eh? https://www.youtube.com/watch?v=i8a3gjt_Ar0 Nice article. I am also running Arch (antergos) but with Cinnamon. Here is a screenshot for those interested:  [image]It’s not much really. Just Cinnamon with a custom theme and icons. But it gets the job done. BTW neofetch is disp&hellip;", "WordPress is the Flash Player of the CMS world. [image]", "WordPress is the Flash Player of the CMS world. [image]", "WordPress is the Flash Player of the CMS world. [image]", "WordPress is the Flash Player of the CMS world. [image]", "WordPress is the Flash Player of the CMS world. [image]", "Hi fellas, Today, I wanted to spend some time explaining you why Wordpress is, and will still be, the best CMS of all time ! Indeed, since its release on May 27, 2003, no flaw has been found and its founders are kept hard work to maintain and enhance this fabulous solution that help thousand users&hellip;", "WordPress is the Flash Player of the CMS world. [image]", "WordPress is the Flash Player of the CMS world. [image]", "Hmm interesting. Do you know the person? Or is it a mass mailer attack? I’d be interested in unpacking it and finding where it connects to… You could do some damage yourself  Post the file and I’m sure somebody here will take up your challenge…", "@pry0cc ahhh, good &#39;ol eye for an eye style  -Phoenix750", "@pry0cc ahhh, good &#39;ol eye for an eye style  -Phoenix750", "i3 config files plz? On-topic: thanks for the tutorial, I got a little confused by STELF at first (but I figured it out fast enough), hopefully this tutorial will clear out confusion for other people too  -Phoenix750", "@zSec Ofcourse it is better than CEH when you look at it technically because CEH is a joke. But ironically many jobs require you to have the cert. I’m not interested in his certs, but more in his articles on SCADA hacking because I work in EE in industrial environments. -Phoenix750", "i3 config files plz? On-topic: thanks for the tutorial, I got a little confused by STELF at first (but I figured it out fast enough), hopefully this tutorial will clear out confusion for other people too  -Phoenix750", "Well, I saved for this bad boi instead: [image] Yes, this is a PLC like the ones hacked by Stuxnet (not exactly the same). And yes, it is a hacking-related project I’m working on  -Phoenix750", "You can’t get caught if there is nobody alive to catch you. -Phoenix750", "laughing my fucking ass out because there is a 20 char limit.", "You can’t get caught if there is nobody alive to catch you. -Phoenix750", "You can’t get caught if there is nobody alive to catch you. -Phoenix750", "@N30N Build your own! There are plenty of jackets for sale in cloth stores that have a lot of pockets on the inside (mostly those business jackets because the more pockets you have to store your credit cards, the fancier you are), and simply tape together wires from one pocket to the other. -Phoeni&hellip;", "You can’t get caught if there is nobody alive to catch you. -Phoenix750", "Getting caught with a bunch of tech inside a building and getting caught with a bunch of tech and an illegal 9mm pistol can make an enourmous difference.", "@Evalion  Umm… How? Do you have a custom built jacket, or there’s one on the market with a bunch of pockets?  @VVid0w Sadly no", "Let’s be honest here and I think everyone can agree on this: There is no such thing as a “Free VPN”. You ALWAYS pay them in some way. If it’s not money it’s your data, like @pry0cc said. I recommend AirVPN by far. It is super cheap (7€ a month is very VERY little) and they have proven their trustwo&hellip;", "Hello Fellow Nullers! I was thinking about @VVid0w’s discussion on EDC bags, and thought, we know what we’d want for a mobile, EDC setup, but what about our home/office setups? Today I am asking you what would your favourite setup be if money was no object, you can go as ridiculous as you can  Bu&hellip;", "1.) Mostly for education or temporary projects. For anything bigger, I’d use a PIC. 2.) Not yet -Phoenix750", "1.) Mostly for education or temporary projects. For anything bigger, I’d use a PIC. 2.) Not yet -Phoenix750", "There are almost 20 official Arduino models with very different features (not considering all the tenths of compatible boards out there). Some have removable MCUs, some don’t. Some have more memory, some less. Some run faster and some slower… The language you use with the Arduino IDE is also C.&hellip;", "Or just carry everything in your jacket like I do. -Phoenix750", "I own one of these. Extremely useful! The good old digital multimeter &amp; oscilloscope are the tools that makes a hardware hacker. Don’t you dare consider yourself as one if you don’t have these two! To read firmware from PIC’s, I use a “PICKit 2” debugger from Microchip. But the multimeter &amp; oscil&hellip;", "@ricksanchez Sounds great! Gives me time to only focus on physics related to hardware  -Phoenix750", "I own one of these. Extremely useful! The good old digital multimeter &amp; oscilloscope are the tools that makes a hardware hacker. Don’t you dare consider yourself as one if you don’t have these two! To read firmware from PIC’s, I use a “PICKit 2” debugger from Microchip. But the multimeter &amp; oscil&hellip;", "Heh, jackets with loads of pockets. Cant go wrong there eh? I almost feel as though every one of us has one haha.", "Or just carry everything in your jacket like I do. -Phoenix750", "@ricksanchez Sounds great! Gives me time to only focus on physics related to hardware  -Phoenix750", "@Evalion  sure an article about a multimeter and oscilloscope could follow too! At least some basics on why have them and what are they used for. I’ll check out the “PICKit2” because it doesn’t ring a bell right now. @0x00pf Thanks. Sure if you have other use cases where you already have appropriat&hellip;", "Or just carry everything in your jacket like I do. -Phoenix750", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "I own one of these. Extremely useful! The good old digital multimeter &amp; oscilloscope are the tools that makes a hardware hacker. Don’t you dare consider yourself as one if you don’t have these two! To read firmware from PIC’s, I use a “PICKit 2” debugger from Microchip. But the multimeter &amp; oscil&hellip;", "Man. You are not cheaping out on this! I would probably go for a normal second hand bag to make it look less conspicuous. Modify it and insert your own secret pockets.", "When I buy an EDC bag that is weather resistant I also expect it to be fire resistant. -Phoenix750", "If the arking causes a flame on the cloth of the bag, your entire backpack will catch fire, which will ignite the magnesium in the macbook casing. Spec-Tacular.", "1.) Combat knife, tomahawk, flashbangs, pistol or if possible a SMG, and other lethal CQC weaponry. Just in case the “non destructive” tactic fails. Seriously though, if you get discovered in your stealth, do you submit to arrest immediately when you know you were absolutely in the wrong? OF COURSE &hellip;", "@pry0cc You call that spectacular?  [image] -Phoenix750", "@pry0cc You call that spectacular?  [image] -Phoenix750", "If you can get the 7A over DC and get it to ark, it could result in something quite spectacular.", "take two paperclips, plug one end into the powerbank’s usb port and the other into laptop. should not explode into flames too quickly", "Voila! You are right. I would need to make a custom cable for my Mac charger then… Doable right?", "@Joe_Schmoe It won’t be that spectacular because powerbanks have quite a large internal resistance that limits the current flow. My simple power bank can push 7A max because of the limit when shorted. Not to say you should do it, but it won’t be that spectacular. -Phoenix750", "Yes and it’ll only cost about 10 dollars to make. An inverter is 10x that price and 100x the heat. Don’t do it! -Phoenix750", "Voila! You are right. I would need to make a custom cable for my Mac charger then… Doable right?", "An inverter is not needed, most laptop chargers work on DC as well because of full-bridge rectifying, so just a little voltage regulating will suffice. Also, inverters always get hot af! -Phoenix750", "@M4lk4w1 If you’re going to infiltrate somewhere you’re already doing illegal things, so I doubt if you’d really care that a 9mm is illegal or not  -Phoenix750", "1.) Combat knife, tomahawk, flashbangs, pistol or if possible a SMG, and other lethal CQC weaponry. Just in case the “non destructive” tactic fails. Seriously though, if you get discovered in your stealth, do you submit to arrest immediately when you know you were absolutely in the wrong? OF COURSE &hellip;", "Yeaaa, I’m not much of a penny pincher rofl. @ricksanchez I do agree, it would be nice to do a series like that, and I think that I will once I…er…get a job. Hahaha.", "@M4lk4w1 If you’re going to infiltrate somewhere you’re already doing illegal things, so I doubt if you’d really care that a 9mm is illegal or not  -Phoenix750", "1.) Combat knife, tomahawk, flashbangs, pistol or if possible a SMG, and other lethal CQC weaponry. Just in case the “non destructive” tactic fails. Seriously though, if you get discovered in your stealth, do you submit to arrest immediately when you know you were absolutely in the wrong? OF COURSE &hellip;", "Oh I see, we’re infiltrating highly secured locations. Well, in that case, you might want to get a suppressor for your 9mm, you really don’t want to draw a lot of unwanted attention if things don’t go according to plan. You might also want to get some climbing gear(hooks, ropes and carabiners), you &hellip;", "@M4lk4w1 If you’re going to infiltrate somewhere you’re already doing illegal things, so I doubt if you’d really care that a 9mm is illegal or not  -Phoenix750", "“Looks like my car” [image]", "1.) Combat knife, tomahawk, flashbangs, pistol or if possible a SMG, and other lethal CQC weaponry. Just in case the “non destructive” tactic fails. Seriously though, if you get discovered in your stealth, do you submit to arrest immediately when you know you were absolutely in the wrong? OF COURSE &hellip;", "Hello fellow 0x00sec h4x0rz!! Today I’m coming to you with a discussion topic on EDC bags. An EDC bag is something that you carry with you every day, I.E, an &#39;E’very &#39;D’ay &#39;C’arry bag. The Bag.Alright, so, what’s an EDC bag without the bag part?! Personally, I don’t think you need an expensive, s&hellip;", "What @oaktree said is absolutely right aswell. Learning from tutorials doesn’t teach you a lot. The best way to learn things is to set challenges and use documentation to accomplish your goals. For example when I learned Python: I had a challenge for myself to make a program that would take as many&hellip;", "@Evalion Here are my results in Cinebench R15: [image] [image] [image] And in Firestrike:  [image]And in Time Spy:  [image]", "What’s about a typical software? We need the same program to compare.", "@Derfloink brute-forcing is a good way to test CPU performance. Mine could brute-force a 6-character long (no numbers) hash in about 2-3 minutes. -Phoenix750", "yus h@x me zo i can haz ur IP to DDoS with CMD me iz much l33t3rz than u w1ll €ver b€", "yus h@x me zo i can haz ur IP to DDoS with CMD me iz much l33t3rz than u w1ll €ver b€", "We used to hate shitposts on Null Byte, now we got this…  [image]", "yus h@x me zo i can haz ur IP to DDoS with CMD me iz much l33t3rz than u w1ll €ver b€", "Like @Evalion said he’ve got more clockspeed, RAM (size and clock) and an better airflow (I can agree that my case isn’t the best(but cheap)). I don’t know much about AMD GPU’s so I can’t say much about this topic. @Evalion  whats about a little benchmark-contest? Only to show @pry0cc and the other&hellip;", "Nice setup @Derfloink. Try overclocking though, the adrenaline is real as you pray to the computer gods it worked! @pry0cc my setup is a little bit better (more RAM, higher CPU clock, optimized airflow, more graphics memory, etc…) but also probably more pricey  So “beats mine easily” is a matter of&hellip;", "Too late. I’m insanely triggered. Probably gonna hack you bro, hack you wifi with my 1337 wifi hack m8…", "yus h@x me zo i can haz ur IP to DDoS with CMD me iz much l33t3rz than u w1ll €ver b€", "Yep and my reply clearly wasn’t a joke, that is exactly why I put a half-bearded weird looking man in it sarcasm don’t get triggered so easily man  -Phoenix750", "Too late. I’m insanely triggered. Probably gonna hack you bro, hack you wifi with my 1337 wifi hack m8…", "Yep and my reply clearly wasn’t a joke, that is exactly why I put a half-bearded weird looking man in it sarcasm don’t get triggered so easily man  -Phoenix750", "Yep and my reply clearly wasn’t a joke, that is exactly why I put a half-bearded weird looking man in it sarcasm don’t get triggered so easily man  -Phoenix750", "We used to hate shitposts on Null Byte, now we got this…  [image]", "We used to hate shitposts on Null Byte, now we got this…  [image]", "We used to hate shitposts on Null Byte, now we got this…  [image]", "If you think this is real, it’s time for you to go relearn the internet.", "We used to hate shitposts on Null Byte, now we got this…  [image]", "We used to hate shitposts on Null Byte, now we got this…  [image]", "We used to hate shitposts on Null Byte, now we got this…  [image]", "10/10 just for the name “raspberry pry” -Phoenix750", "I wish I could take the credit. But I’m not a complete dick. It was 100% @_py’s suggestion for this write-up and the name.  I just, you know, did the work", "Picture the moment. It’s 2057, technology has barely progressed, and the earth is under harsh censorship and surveillance. Humanity has reverted to the Hitler days. Don’t get depressed! Let’s build a mesh net! In your manic mindset, you quickly throw together your portable phone re-charger, your R&hellip;", "10/10 just for the name “raspberry pry” -Phoenix750", "Picture the moment. It’s 2057, technology has barely progressed, and the earth is under harsh censorship and surveillance. Humanity has reverted to the Hitler days. Don’t get depressed! Let’s build a mesh net! In your manic mindset, you quickly throw together your portable phone re-charger, your R&hellip;", "Imagine you are sitting in an airport, and you feel a sudden urge to browse the Internet. You take out your phone, and there seems to be an open network for travelers. Having safety in mind, you fire up your VPN client. But wait - It can’t connect? You open your browser and witness a horrible sight &hellip;", "Not sure, But I think just googling research papers on exploit development is the best way. Good luck out there! -Phoenix750", "Not sure, But I think just googling research papers on exploit development is the best way. Good luck out there! -Phoenix750", "Not sure, But I think just googling research papers on exploit development is the best way. Good luck out there! -Phoenix750", "Thanks  folks for the tremendous responses and really appreciated   Can anyone please sort out what steps to go in order to have the best approach toward the reversing,malware analysis,exploit etc? I mean the prerequisites…", "[image]", "[image]", "What @oaktree said is absolutely right aswell. Learning from tutorials doesn’t teach you a lot. The best way to learn things is to set challenges and use documentation to accomplish your goals. For example when I learned Python: I had a challenge for myself to make a program that would take as many&hellip;", "[image]", "What @oaktree said is absolutely right aswell. Learning from tutorials doesn’t teach you a lot. The best way to learn things is to set challenges and use documentation to accomplish your goals. For example when I learned Python: I had a challenge for myself to make a program that would take as many&hellip;", "[image]", "Nice setup @Derfloink. Try overclocking though, the adrenaline is real as you pray to the computer gods it worked! @pry0cc my setup is a little bit better (more RAM, higher CPU clock, optimized airflow, more graphics memory, etc…) but also probably more pricey  So “beats mine easily” is a matter of&hellip;", "What @oaktree said is absolutely right aswell. Learning from tutorials doesn’t teach you a lot. The best way to learn things is to set challenges and use documentation to accomplish your goals. For example when I learned Python: I had a challenge for myself to make a program that would take as many&hellip;", "[image]", "Or they used Bing… Those savages!", "Or they used Bing… Those savages!", "Or they used Bing… Those savages!", "Documentation allows you to think on your own and learn how to design better software. It makes it easier to take note of all the tools you have. Tutorials usually show you one way to do something, and that works at first, but proficiency comes from immersing yourself in the capabilities of an envi&hellip;", "What @oaktree said is absolutely right aswell. Learning from tutorials doesn’t teach you a lot. The best way to learn things is to set challenges and use documentation to accomplish your goals. For example when I learned Python: I had a challenge for myself to make a program that would take as many&hellip;", "What @oaktree said is absolutely right aswell. Learning from tutorials doesn’t teach you a lot. The best way to learn things is to set challenges and use documentation to accomplish your goals. For example when I learned Python: I had a challenge for myself to make a program that would take as many&hellip;", "I hate to be the one telling you the truth but since not many will dare to do so, I will. Your approach and mindset will only cause the reverse of what you are expecting. You can’t expect to learn something you are interested in based on experiences of others. Why is that? Simple. Every person is d&hellip;", "While @_py is right for the most part, he forgot to say an important thing: if you don’t understand the source, leave it. Don’t waste time reading something that doesn’t make sense to you! However, that is NOT the same as giving up! What I mean by “leave it” is to search for something that explains&hellip;", "Haha, I remember having fun with Siemens PLCs when I had to extract code that was programmed onto it when the company that made it went bankrupt. The code was password protected but I managed to extract it, I felt really 1337 back then.", "Good job on this, @TheDoctor. If ya got any more fancy hardware projects, I’m happy to cooperate. -Phoenix750", "Nice setup @Derfloink. Try overclocking though, the adrenaline is real as you pray to the computer gods it worked! @pry0cc my setup is a little bit better (more RAM, higher CPU clock, optimized airflow, more graphics memory, etc…) but also probably more pricey  So “beats mine easily” is a matter of&hellip;", "I agree on @Joe_Schmoe. Not because he’s l33t or anything, but simply because of his badass motherfuckery. -Phoenix750", "I agree on @Joe_Schmoe. Not because he’s l33t or anything, but simply because of his badass motherfuckery. -Phoenix750", "I agree on @Joe_Schmoe. Not because he’s l33t or anything, but simply because of his badass motherfuckery. -Phoenix750", "I agree on @Joe_Schmoe. Not because he’s l33t or anything, but simply because of his badass motherfuckery. -Phoenix750", "Nice setup @Derfloink. Try overclocking though, the adrenaline is real as you pray to the computer gods it worked! @pry0cc my setup is a little bit better (more RAM, higher CPU clock, optimized airflow, more graphics memory, etc…) but also probably more pricey  So “beats mine easily” is a matter of&hellip;", "Nice setup @Derfloink. Try overclocking though, the adrenaline is real as you pray to the computer gods it worked! @pry0cc my setup is a little bit better (more RAM, higher CPU clock, optimized airflow, more graphics memory, etc…) but also probably more pricey  So “beats mine easily” is a matter of&hellip;", "Maybe this could be a small Overview about my Setup: Core: Intel Core i7-6700K, 4x 4.00GHz GPU: Gainward GeForce GTX 1060 6GB Ram: Kingston HyperX Fury DIMM Kit 16GB, DDR4-2133 Data Storage: Seagate Desktop HDD 1TB Samsung SSD 850 Evo 250GB Mainboard MSI Z170-A Pro CPU Cooler: Enermax L&hellip;", "@Joe_Schmoe: He just deserves it.", "I agree on @Joe_Schmoe. Not because he’s l33t or anything, but simply because of his badass motherfuckery. -Phoenix750", "Wow this is insane. @Evalion it beats yours easily! xD - pry0cc", "Oh please @pry0cc, everyone copies code nowadays. So do I because I’m not l33t enough. If it looks stupid but it works it ain’t stupid. -Phoenix750", "I didn’t say I didn’t copy code. I copy a LOT of code. When I post a new project I should just the author “Stack Overflow” xD", "Oh please @pry0cc, everyone copies code nowadays. So do I because I’m not l33t enough. If it looks stupid but it works it ain’t stupid. -Phoenix750", "Duuude. Stack Overflow should actually be called “decent place to copy and paste code if you can’t code it yourself/can’t be bothered”.", "Oh please @pry0cc, everyone copies code nowadays. So do I because I’m not l33t enough. If it looks stupid but it works it ain’t stupid. -Phoenix750", "“Learn C the hard way” is an excellent book on C. This website can also be a good addition: http://www.learn-c.org/ -Phoenix750", "I am all the way down the rankings when it comes to programming here on 0x00sec, I have experience programming firmware. If you wish to code firmware, go with embedded C/assembly for PIC’s Like @oaktree said, C is a good language to learn the discipline of programming, my experiences with C up to t&hellip;", "I am all the way down the rankings when it comes to programming here on 0x00sec, I have experience programming firmware. If you wish to code firmware, go with embedded C/assembly for PIC’s Like @oaktree said, C is a good language to learn the discipline of programming, my experiences with C up to t&hellip;", "I am all the way down the rankings when it comes to programming here on 0x00sec, I have experience programming firmware. If you wish to code firmware, go with embedded C/assembly for PIC’s Like @oaktree said, C is a good language to learn the discipline of programming, my experiences with C up to t&hellip;", "As this site’s loudest C++ programmer, I would suggest that you start with C. It gives you an appreciation for any higher level programming languages you may learn down the road, forces you to focus on the intricacies of your operating system, and is really good for disciplining a programmer. Yeah,&hellip;", "I am all the way down the rankings when it comes to programming here on 0x00sec, I have experience programming firmware. If you wish to code firmware, go with embedded C/assembly for PIC’s Like @oaktree said, C is a good language to learn the discipline of programming, my experiences with C up to t&hellip;", "No. I am saying that VPN’s are often used for pretty shady stuff. And by letting anybody use it you are asking for a call from interpol. Which isn’t an issue if you are a large company with 43 lawyers, and a lawyer for all your lawyers; and a lawyer for that lawyer.", "[image]", "[image]", "Phoenix, making memes out of yourself is frowned upon", "So you’re saying people should fall into censorship because they’re not l33t enough @pry0cc?  [image] -Phoenix750", "Phoenix, making memes out of yourself is frowned upon", "So you’re saying people should fall into censorship because they’re not l33t enough @pry0cc?  [image] -Phoenix750", "So you’re saying people should fall into censorship because they’re not l33t enough @pry0cc?  [image] -Phoenix750", "So you’re saying people should fall into censorship because they’re not l33t enough @pry0cc?  [image] -Phoenix750", "Psssst. 0x00sec has an OpenVPN server thanks to L0k1. 1337’s of the m0n7h have access to it.", "I’ll have to side with @pry0cc on this one. I haven’t really tried Gentoo myself so I won’t talk from my own experiences. But what I’ve heard so far about Gentoo, It is mostly suited for embedded applications and not really for home use because you constantly install &amp; uninstall things. Atleast that&hellip;", "It works really well on your home computer too. Moreover, its even better on beast machines (you have one). The compile time on your machine (i76700K iirc) for the kernel itself shouldn’t be more than 5 minutes. If you build the kernel under 5 minutes, dont you even complain about compilation times. &hellip;", "I’ll have to side with @pry0cc on this one. I haven’t really tried Gentoo myself so I won’t talk from my own experiences. But what I’ve heard so far about Gentoo, It is mostly suited for embedded applications and not really for home use because you constantly install &amp; uninstall things. Atleast that&hellip;", "Proudly sponsored by Jschmoe Inc  You guys are killing me xD Serious note: Gentoo sucks Reason: Because compiling everything from source is just inefficient, and you have to remerge 50+ packages after you add a use flag. Arch is better. You can do everything on Arch, with half the hassle in half&hellip;", "How unstable was it @_py (as in give examples)? -Phoenix750", "Well other than electronics, I also like biology, especially virology and bacteriology. -Phoenix750", "Yes, but only when I had to install .deb files. Never had any dependency problems as of yet, but that is probably because I’m not l33t h@x0r enough and keep using apt-get. -Phoenix750", "Yes and no. On paper they are an intelligence agency, but in reality they’re only there to offer intelligence to police forces in the field and not actually “spying” suspects. If they did the latter, 13 November wouldn’t have happened. -Phoenix750", "“Looks like my car” [image]", "And allow the memory cells to learn it and know how to fight it.", "And allow the memory cells to learn it and know how to fight it.", "I specialize more in the making than in the curing  Although they’re kind of the same thing (a vaccine is basically a strain of the virus that can’t reproduce, thus giving your immune system a chance to develop antibodies). -Phoenix750", "PM him here on the site @VintageFox, or come on IRC, @TheDoctor sometimes lurks there. -Phoenix750", "Thanks @Evalion. I’ll wrote him via PM; I’m rarely on IRC . Maybe I’ll change that in the near future…", "“Looks like my car” [image]", "Well, I saved for this bad boi instead: [image] Yes, this is a PLC like the ones hacked by Stuxnet (not exactly the same). And yes, it is a hacking-related project I’m working on  -Phoenix750", "PM him here on the site @VintageFox, or come on IRC, @TheDoctor sometimes lurks there. -Phoenix750", "Yes, but only when I had to install .deb files. Never had any dependency problems as of yet, but that is probably because I’m not l33t h@x0r enough and keep using apt-get. -Phoenix750", "Occasionally, dependencies can be missed. It’s a whole mess. Have you ever used dpkg?", "I thought apt-get took care of “dependency hell” automatically? Atleast it does that on my ParrotSec distro. -Phoenix750", "Well other than electronics, I also like biology, especially virology and bacteriology. -Phoenix750", "I specialize more in the making than in the curing  Although they’re kind of the same thing (a vaccine is basically a strain of the virus that can’t reproduce, thus giving your immune system a chance to develop antibodies). -Phoenix750", "Not really. Well, when you use Katoolin", "Well, its complicated business.", "In other words. If there is another black plague. GO TO BELGIUM FOR THE CURE.", "Well other than electronics, I also like biology, especially virology and bacteriology. -Phoenix750", "Well other than electronics, I also like biology, especially virology and bacteriology. -Phoenix750", "I thought apt-get took care of “dependency hell” automatically? Atleast it does that on my ParrotSec distro. -Phoenix750", "@Evalion: As @pry0cc correctly pointed it out, broken dependencies, period. Can’t get any worse than that.", "How unstable was it @_py (as in give examples)? -Phoenix750", "I remember trying to make a drug resistant Legionella strain. I boiled the infected water later though, without knowing if I have been successful or not. If I have any outside CS hobbies? Well does electronics count? -Phoenix750", "As in you try to install any package from the repo’s and it looses its mind.  And then dare you try a system upgrade it won’t even boot if it managed to download.  That’s just my experience.", "How unstable was it @_py (as in give examples)? -Phoenix750", "How unstable was it @_py (as in give examples)? -Phoenix750", "Well, I saved for this bad boi instead: [image] Yes, this is a PLC like the ones hacked by Stuxnet (not exactly the same). And yes, it is a hacking-related project I’m working on  -Phoenix750", "“Looks like my car” [image]", "I don’t run any fancy OS (just a Win10 + ParrotSec in dual boot), but I am happy to share my powerful hardware setup for those who are interested: CPU: I7-6700K: This is probably the best price-performance CPU on the market, hands down. With a base clock of 4GHz and 4 physical cores, which can be e&hellip;", "I’d say so. It’s marginally related but we’ll say it’s outside the realm of CS for this", "I remember trying to make a drug resistant Legionella strain. I boiled the infected water later though, without knowing if I have been successful or not. If I have any outside CS hobbies? Well does electronics count? -Phoenix750", "Well, I saved for this bad boi instead: [image] Yes, this is a PLC like the ones hacked by Stuxnet (not exactly the same). And yes, it is a hacking-related project I’m working on  -Phoenix750", "[image] No but seriously, this is an important step forward and everyone can benefit from it. Thanks man, next round is on me. If there ever is one. -Phoenix750", "[image] No but seriously, this is an important step forward and everyone can benefit from it. Thanks man, next round is on me. If there ever is one. -Phoenix750", "Good day all, Seeing as this is my first real post here, and I’m fairly certain a few of you know me, but the large majority don’t, I’ll introduce myself a little, and then continue from there. Names Mike, I go by L0k1 online, which is what most of you will come to know me as. I’ve been involved i&hellip;", "[image] No but seriously, this is an important step forward and everyone can benefit from it. Thanks man, next round is on me. If there ever is one. -Phoenix750", "Well, I saved for this bad boi instead: [image] Yes, this is a PLC like the ones hacked by Stuxnet (not exactly the same). And yes, it is a hacking-related project I’m working on  -Phoenix750", "“Looks like my car” [image]", "Same colour…  Too bad you don’t have one at all", "“Looks like my car” [image]", "“Looks like my car” [image]", "“Looks like my car” [image]", "“Looks like my car” [image]", "“Looks like my car” [image]", "This is such a sweet setup.  I am a really really big fan!!!  Like the wallpapers a lot.  Looks like my car", "I don’t use my CPU only for gaming or hash cracking (in the latter I rely on both my GPU and CPU at the same time), I also use it for specific CPU intensive tasks like simulating my circuits or running +20 VM’s at the same time, in which case an I5-6600K is too weak for my needs. However, for gamin&hellip;", "I don’t use my CPU only for gaming or hash cracking (in the latter I rely on both my GPU and CPU at the same time), I also use it for specific CPU intensive tasks like simulating my circuits or running +20 VM’s at the same time, in which case an I5-6600K is too weak for my needs. However, for gamin&hellip;", "Ah, the good old oscillator! A very simple circuit but yet it is used almost everywhere. I’ll check out your other circuits later. And don’t worry about the language, I’ve seen so many circuits I can recognize the common ones by schematics alone! -Phoenix750", "I don’t run any fancy OS (just a Win10 + ParrotSec in dual boot), but I am happy to share my powerful hardware setup for those who are interested: CPU: I7-6700K: This is probably the best price-performance CPU on the market, hands down. With a base clock of 4GHz and 4 physical cores, which can be e&hellip;", "I don’t use my CPU only for gaming or hash cracking (in the latter I rely on both my GPU and CPU at the same time), I also use it for specific CPU intensive tasks like simulating my circuits or running +20 VM’s at the same time, in which case an I5-6600K is too weak for my needs. However, for gamin&hellip;", "Nice setup mate! I have almost the same specs. However, allow me to ask you the following question. Doesn’t the i7-6700K overkill ? Indeed, even for gaming, an i5-6600K, which is way cheaper, can perfectly do the job and can be overclocked too. Moreover, most softwares like hashcat, etc, rely mainl&hellip;", "I don’t use my CPU only for gaming or hash cracking (in the latter I rely on both my GPU and CPU at the same time), I also use it for specific CPU intensive tasks like simulating my circuits or running +20 VM’s at the same time, in which case an I5-6600K is too weak for my needs. However, for gamin&hellip;", "Nice setup mate! I have almost the same specs. However, allow me to ask you the following question. Doesn’t the i7-6700K overkill ? Indeed, even for gaming, an i5-6600K, which is way cheaper, can perfectly do the job and can be overclocked too. Moreover, most softwares like hashcat, etc, rely mainl&hellip;", "I don’t run any fancy OS (just a Win10 + ParrotSec in dual boot), but I am happy to share my powerful hardware setup for those who are interested: CPU: I7-6700K: This is probably the best price-performance CPU on the market, hands down. With a base clock of 4GHz and 4 physical cores, which can be e&hellip;", "I don’t run any fancy OS (just a Win10 + ParrotSec in dual boot), but I am happy to share my powerful hardware setup for those who are interested: CPU: I7-6700K: This is probably the best price-performance CPU on the market, hands down. With a base clock of 4GHz and 4 physical cores, which can be e&hellip;", "I don’t run any fancy OS (just a Win10 + ParrotSec in dual boot), but I am happy to share my powerful hardware setup for those who are interested: CPU: I7-6700K: This is probably the best price-performance CPU on the market, hands down. With a base clock of 4GHz and 4 physical cores, which can be e&hellip;", "I don’t run any fancy OS (just a Win10 + ParrotSec in dual boot), but I am happy to share my powerful hardware setup for those who are interested: CPU: I7-6700K: This is probably the best price-performance CPU on the market, hands down. With a base clock of 4GHz and 4 physical cores, which can be e&hellip;", "I don’t run any fancy OS (just a Win10 + ParrotSec in dual boot), but I am happy to share my powerful hardware setup for those who are interested: CPU: I7-6700K: This is probably the best price-performance CPU on the market, hands down. With a base clock of 4GHz and 4 physical cores, which can be e&hellip;", "I don’t run any fancy OS (just a Win10 + ParrotSec in dual boot), but I am happy to share my powerful hardware setup for those who are interested: CPU: I7-6700K: This is probably the best price-performance CPU on the market, hands down. With a base clock of 4GHz and 4 physical cores, which can be e&hellip;", "So the Dutch intelligence agency has posted a Christmas Puzzel. It’s related to cryptography and steganography mainly. The puzzel is in dutch, but I think a lot of them can be made by English people as well. You can find the puzzel here:  So I did the first 2 and I think googling the Dutch ver&hellip;", "VSSE? Or am isn’t that the same?", "Hello peepz, Been a while since I last posted something. Have been very busy with ma study Computer Science which I started this year. Anyway: A few days ago my dummie book: ‘HTML5, CSS, JavaScript, PHP and MySQL for Dummies’. So I’ve gone trough most of the book now and decided it was time to &hellip;", "I don’t run any fancy OS (just a Win10 + ParrotSec in dual boot), but I am happy to share my powerful hardware setup for those who are interested: CPU: I7-6700K: This is probably the best price-performance CPU on the market, hands down. With a base clock of 4GHz and 4 physical cores, which can be e&hellip;", "Ah, the good old oscillator! A very simple circuit but yet it is used almost everywhere. I’ll check out your other circuits later. And don’t worry about the language, I’ve seen so many circuits I can recognize the common ones by schematics alone! -Phoenix750", "Using low safety voltage (the 12V you are referring to) should protect you from electrocution, but making a short circuit could blow your power supply up. And that could blow your face off. And that is why you always use fuses &amp; C.C. protected bench power supplies kids! -Phoenix750", "I can confirm, “Make: electronics” is a great book for starters and I also read it sometimes to freshen up on some knowledge. But for starters: beware of the risks of electronics before attempting anything fancy. I’ll write an article on this, but it’s covered a little bit in the book as well. (Yea&hellip;", "@IoTh1nkN0t  I know a guy who worked with low voltage and current. One day his circuit exploded into his face and he almost lost his eyes. You also can easily get injured by a micro drill if you make a home brew PCB or even a long wire you are holding in some proximity of your face. I personally alw&hellip;", "Yes and no. On paper they are an intelligence agency, but in reality they’re only there to offer intelligence to police forces in the field and not actually “spying” suspects. If they did the latter, 13 November wouldn’t have happened. -Phoenix750", "Using low safety voltage (the 12V you are referring to) should protect you from electrocution, but making a short circuit could blow your power supply up. And that could blow your face off. And that is why you always use fuses &amp; C.C. protected bench power supplies kids! -Phoenix750", "VSSE? Or am isn’t that the same?", "If you just use electronics powered by 12V 1A there is not that much that can go wrong. So unless you build your own Rectifier, there shouldn’t be any really big dangers (Correct me if I’m wrong though).", "If only our Belgian intelligence agency did something like that… IF WE HAD ONE! -Phoenix750", "I can confirm, “Make: electronics” is a great book for starters and I also read it sometimes to freshen up on some knowledge. But for starters: beware of the risks of electronics before attempting anything fancy. I’ll write an article on this, but it’s covered a little bit in the book as well. (Yea&hellip;", "Winner: @NitraxWell done @Nitrax for winning this month’s 1337 0f the M0n7h! The community has loved your content from the past month, and have chosen you for this month! I hope you enjoy the perks of being a 1337 0f the M0n7h winner  Hello Loyal 0x00ers! For this month we are open for nominati&hellip;", "Still, do not rely on them. Use a VPN or Tor to connect. Using Tor is trivial with proxychains.", "We got cloaks by default now? -Phoenix750", "You interact with the HostServ bot.", "@oaktree, how do I request one? PM you on 0x00sec? some fancy command on IRC? -Phoenix750", "@Evalion you can also connect over TOR. We use SSL. You can request a vhost too.", "We got cloaks by default now? -Phoenix750", "They’re actually md5 hashes of your IP. Unless you’re a network admin, its a long procedure to decloak someone.", "We got cloaks by default now? -Phoenix750", "@Valentine I don’t make a great nominee at the moment due to my frequent absence. Give the award to someone who puts in a lot more effort! I say @TheDoctor and @0x00pf, aswell as @dtm should be nominates. They’ve put in a REALLY big effort since 0x00sec even began! -Phoenix750", "@Valentine I don’t make a great nominee at the moment due to my frequent absence. Give the award to someone who puts in a lot more effort! I say @TheDoctor and @0x00pf, aswell as @dtm should be nominates. They’ve put in a REALLY big effort since 0x00sec even began! -Phoenix750", "Well, if you’re using EliteBNC, go to their channel on freenode(#EliteBNC) and request another bouncer. You can have 4 bnc connections with one email.", "@Valentine I don’t make a great nominee at the moment due to my frequent absence. Give the award to someone who puts in a lot more effort! I say @TheDoctor and @0x00pf, aswell as @dtm should be nominates. They’ve put in a REALLY big effort since 0x00sec even began! -Phoenix750", "@Valentine I don’t make a great nominee at the moment due to my frequent absence. Give the award to someone who puts in a lot more effort! I say @TheDoctor and @0x00pf, aswell as @dtm should be nominates. They’ve put in a REALLY big effort since 0x00sec even began! -Phoenix750", "We wanted more control and privacy.", "And why the sudden change? My bouncer provider doesn’t allow me to switch servers! btw sorry for my long absence, last week has been busy  -Phoenix750", "@pry0cc, @Evalion, @worz, @Joe_Schmoe and @dtm P.S. (even @oaktree)", "We often forget that we also started somewhere and it was hard. Publishing articles like this on 0x00sec makes it easier for new people. Good job @Valentine, I myself am going to do a series like this sooner or later. However, I disagree that live booting is the safest option for newcomers. The saf&hellip;", "VM, also known as Virtual Machine, doesn’t have access to your NIC directly. You will need an external WLAN adapter and support for USB in the VM.", "Spoderman pls. Well he is right too, but be sure to check if your wifi chip is compatible too @spylegion. -Phoenix750", "Well look who’s back! First things first: are you running from outside a VM and is your wifi chipset supported by aircrack? -Phoenix750", "Today I wanted to compose a more technical article on one of the subjects which I take a lot of pride in anonymity. PiratingPirating is ‘unfortunately’ a very prominent and popular term in our modern society. Everybody (or almost) everybody pirates, or have at the very least tried it once or twic&hellip;", "Let’s be honest here and I think everyone can agree on this: There is no such thing as a “Free VPN”. You ALWAYS pay them in some way. If it’s not money it’s your data, like @pry0cc said. I recommend AirVPN by far. It is super cheap (7€ a month is very VERY little) and they have proven their trustwo&hellip;", "Prior researches on google could have answered your question… I think that remedial courses about binding shell should help you to fully understand this topic. Lastly, avoid using tools / scripts that you don’t really understand … You don’t want to be a skid right ? I’m sorry if it sounds harsh but&hellip;", "Let’s be honest here and I think everyone can agree on this: There is no such thing as a “Free VPN”. You ALWAYS pay them in some way. If it’s not money it’s your data, like @pry0cc said. I recommend AirVPN by far. It is super cheap (7€ a month is very VERY little) and they have proven their trustwo&hellip;", "I can top that. proxy.sh is offering $2.75 a month (if you pay yearly) The solid package offers 57 countries. I have personal experience with frootvpn and my experience is mostly positive. They’re fairly quick and always works, as well as competitive pricing.", "Let’s be honest here and I think everyone can agree on this: There is no such thing as a “Free VPN”. You ALWAYS pay them in some way. If it’s not money it’s your data, like @pry0cc said. I recommend AirVPN by far. It is super cheap (7€ a month is very VERY little) and they have proven their trustwo&hellip;", "Tells person to not follow someone else’s footsteps, later on tells them to learn memory or else they aren’t dank enough. gg @_py -Phoenix750", "@Evalion: I know, I’m glad someone saw the irony.", "Tells person to not follow someone else’s footsteps, later on tells them to learn memory or else they aren’t dank enough. gg @_py -Phoenix750", "Let’s be honest here and I think everyone can agree on this: There is no such thing as a “Free VPN”. You ALWAYS pay them in some way. If it’s not money it’s your data, like @pry0cc said. I recommend AirVPN by far. It is super cheap (7€ a month is very VERY little) and they have proven their trustwo&hellip;", "I think the best way would be to read books (like, a shitload of them) and then after every chapter code your own software with the concepts you just learned so you understand how to use them. It’s not theory &gt; practice or theory &lt; practice, but theory == practice. -Phoenix750", "Don’t swell it, we all make mistakes at one point. Although it wouldn’t be bad practice to back up your claims with sources next time  -Phoenix750", "When @dtm has too much time on his hands, he hacks games. When I have too much time on my hands…  [image]EDIT: No this isn’t my speaker burning, but I’ve done similar things, if not worse. EDIT 2: For those crazy enough to try this (or those who have lost their will to live): you can achieve thi&hellip;", "Everybody knows. Fire == Cool.", "When @dtm has too much time on his hands, he hacks games. When I have too much time on my hands…  [image]EDIT: No this isn’t my speaker burning, but I’ve done similar things, if not worse. EDIT 2: For those crazy enough to try this (or those who have lost their will to live): you can achieve thi&hellip;", "When @dtm has too much time on his hands, he hacks games. When I have too much time on my hands…  [image]EDIT: No this isn’t my speaker burning, but I’ve done similar things, if not worse. EDIT 2: For those crazy enough to try this (or those who have lost their will to live): you can achieve thi&hellip;", "When @dtm has too much time on his hands, he hacks games. When I have too much time on my hands…  [image]EDIT: No this isn’t my speaker burning, but I’ve done similar things, if not worse. EDIT 2: For those crazy enough to try this (or those who have lost their will to live): you can achieve thi&hellip;", "When @dtm has too much time on his hands, he hacks games. When I have too much time on my hands…  [image]EDIT: No this isn’t my speaker burning, but I’ve done similar things, if not worse. EDIT 2: For those crazy enough to try this (or those who have lost their will to live): you can achieve thi&hellip;", "When @dtm has too much time on his hands, he hacks games. When I have too much time on my hands…  [image]EDIT: No this isn’t my speaker burning, but I’ve done similar things, if not worse. EDIT 2: For those crazy enough to try this (or those who have lost their will to live): you can achieve thi&hellip;", "Hello 0x00’ers! Hope you’re having a snappy day. I hope you’re excited because a load of new things are coming to 0x00sec Announcement 0x00 - Tool Release - PupperA few days ago I was talking to some people on the IRC, and they commented that it would be absolutely awesome to have some kind of to&hellip;", "@pry0cc it’s not a bad idea, but what if someone wants to add their own link he/she/apache found? -Phoenix750", "make a PR on github!  lol.", "@pry0cc it’s not a bad idea, but what if someone wants to add their own link he/she/apache found? -Phoenix750", "@pry0cc it’s not a bad idea, but what if someone wants to add their own link he/she/apache found? -Phoenix750", "ChallengeAs promised, I’ve posted the challenge for Section 1. This challenge is pretty simple for most, but for the beginners it could be a challenge. The challenge is simple, create a script using bash. Except, this script can’t be any random script, but instead I want to see something like this: &hellip;", "Don’t swell it, we all make mistakes at one point. Although it wouldn’t be bad practice to back up your claims with sources next time  -Phoenix750", "Don’t swell it, we all make mistakes at one point. Although it wouldn’t be bad practice to back up your claims with sources next time  -Phoenix750", "Don’t swell it, we all make mistakes at one point. Although it wouldn’t be bad practice to back up your claims with sources next time  -Phoenix750", "Don’t swell it, we all make mistakes at one point. Although it wouldn’t be bad practice to back up your claims with sources next time  -Phoenix750", "How does “patience” play a role here? 150 tries is 150 tries. -Phoenix750", "Lmao. My bad. I re-read what I posted and sorry.", "@Evalion I couldn’t have said it better x) shutz_c0de", "How does “patience” play a role here? 150 tries is 150 tries. -Phoenix750", "Unless it’s a small wordlist.", "@pry0cc I never said they didn’t  @Valentine Google locks you out after a 150-ish attempts if I recall correctly. Not even a dictionary attack would be useful then. -Phoenix750", "Which it does. All the major providers do this.", "A way to bypass this restriction exists when the target only locks out your IP: get a list of proxies and change proxy every * amount of attempts. The story is different if the target locks out the account -Phoenix750", "Thanks for the reply. My main reason for asking, was that I found a Kingston DataTraveler G4 64 GB on the known supported devices list, which is widely sold here in Belgium, for about 20€. Was trying to decide what to buy.", "@TheDoctor is right, I don’t own a USB like that myself. But I am pretty sure you can buy a ducky in Belgium. If not, you can order one from the US and get it shipped over. -Phoenix750", "@Evalion only helped me out theoretically. He hasn’t tested this out hisself. If I understood your question right, else ignore me .", "phoenix, knowing we live in the same country, did you purchase a ducky, or a usb stick to try this out ? if so, what were your experiences ?", "Glad to here that from you . I’m excited for your next hardware posts .", "There are a few things in this world that are very underrated. Your proficiency in C# is one of them. Good job as usual. -Phoenix750", "There are a few things in this world that are very underrated. Your proficiency in C# is one of them. Good job as usual. -Phoenix750", "Hey mates! Maybe some of the elder members remember my series about C# CrackMe Challenges. After a little break where I focussed on other stuff I’m now back with an introduction to MSIL patching. Before you start with this post I recommend you to have a look at my other parts first . They teach som&hellip;", "We often forget that we also started somewhere and it was hard. Publishing articles like this on 0x00sec makes it easier for new people. Good job @Valentine, I myself am going to do a series like this sooner or later. However, I disagree that live booting is the safest option for newcomers. The saf&hellip;", "Yes you learn, but what are you with learning when tons of hard work prior to your hacking days have been utterly destroyed (or at least for that guy/girl. You know, a newbie usually doesn’t know digital forensics )? -Phoenix750", "Yes you learn, but what are you with learning when tons of hard work prior to your hacking days have been utterly destroyed (or at least for that guy/girl. You know, a newbie usually doesn’t know digital forensics )? -Phoenix750", "Yes you learn, but what are you with learning when tons of hard work prior to your hacking days have been utterly destroyed (or at least for that guy/girl. You know, a newbie usually doesn’t know digital forensics )? -Phoenix750", "We often forget that we also started somewhere and it was hard. Publishing articles like this on 0x00sec makes it easier for new people. Good job @Valentine, I myself am going to do a series like this sooner or later. However, I disagree that live booting is the safest option for newcomers. The saf&hellip;", "We often forget that we also started somewhere and it was hard. Publishing articles like this on 0x00sec makes it easier for new people. Good job @Valentine, I myself am going to do a series like this sooner or later. However, I disagree that live booting is the safest option for newcomers. The saf&hellip;", "We often forget that we also started somewhere and it was hard. Publishing articles like this on 0x00sec makes it easier for new people. Good job @Valentine, I myself am going to do a series like this sooner or later. However, I disagree that live booting is the safest option for newcomers. The saf&hellip;", "Linux: Linux is a hacker’s choice when it comes to hacking  in general, but Linux isn’t exactly use friendly for beginners. The point of Section 1 in this series is the Linux Operating System in general. Once the basics are down then we can move on to more complicated subjects, but we all have to s&hellip;", "We often forget that we also started somewhere and it was hard. Publishing articles like this on 0x00sec makes it easier for new people. Good job @Valentine, I myself am going to do a series like this sooner or later. However, I disagree that live booting is the safest option for newcomers. The saf&hellip;", "What is up with this community and Base64? I really don’t get it why it is so special. Can someone explain? -Phoenix750", "Its cool. It maintains everything and is borderline readable. Plus its easily recognisable.", "What is up with this community and Base64? I really don’t get it why it is so special. Can someone explain? -Phoenix750", "Good job on this, @TheDoctor. If ya got any more fancy hardware projects, I’m happy to cooperate. -Phoenix750", "Good job on this, @TheDoctor. If ya got any more fancy hardware projects, I’m happy to cooperate. -Phoenix750", "Make a new partition on your drive inside Windows and install Linux on there. -Phoenix750", "I looked up porn on a school computer.  [image]Now for a serious reply: the most illegal thing I have ever done was not with a computer but with (you guessed it) electricity/electronics. In the early days when I was exploring the fundamental techniques of radio, I assembled a powerful transmitter &hellip;", "Hey Mates! This time I’ll tell you how you can build your own Bad USB for about 10$. It’s pretty easy, but requires a compatible USB Stick. RequirementsYou’ll need an USB Stick with the Phison 2303 (2251-03) microcontroller installed. Sadly you can’t just ask in your favourite hardware shop for &hellip;", "Yo. We aren’t NB xD We aren’t gonna censor this  If authorities want this gone then screw them!", "I looked up porn on a school computer.  [image]Now for a serious reply: the most illegal thing I have ever done was not with a computer but with (you guessed it) electricity/electronics. In the early days when I was exploring the fundamental techniques of radio, I assembled a powerful transmitter &hellip;", "How about we focus on more basic stuff for the new people? Perhaps you can do some tuts on that? -Phoenix750", "Ahh, finally: tutorials aimed to the beginner. Excellent work @0x00pf. -Phoenix750", "Heheh… I attempted to dual boot a version of Linux and ended up messing up my Windows Partition! It’s nothing though, I got a new Windows OS version for another try.", ":)… that is what I meant… actually some microcontroller have a few bytes of RAM… but that is indeed a mistake. Thanks for pointing it out. I’ll fix it", "If you are reading this is because you want to be a hacker. Therefore, you are automatically a wannabe. It does not sound that cool, but it is actually pretty cool. It means that you still have a lot of exciting things to discover!!! First things first. This is going to be a joint course on C and a&hellip;", "Thanks… Glad to hear you like it", "Ahh, finally: tutorials aimed to the beginner. Excellent work @0x00pf. -Phoenix750", "We should need to mix adspace and the donationsite in the adspace. -Phoenix750", "We should need to mix adspace and the donationsite in the adspace. -Phoenix750", "I looked up porn on a school computer.  [image]Now for a serious reply: the most illegal thing I have ever done was not with a computer but with (you guessed it) electricity/electronics. In the early days when I was exploring the fundamental techniques of radio, I assembled a powerful transmitter &hellip;", "That would be great! I’m a new girl who wants to learn as much as humanly possible!!", "How about we focus on more basic stuff for the new people? Perhaps you can do some tuts on that? -Phoenix750", "You wouldn’t like a post from me on how the Linux command-line works  Thanks for sharing your thoughts", "Doesn’t need to be you, anyone who wants to can do it! -Phoenix750", "You wouldn’t like a post from me on how the Linux command-line works  Thanks for sharing your thoughts", "@0x00pf I plan to do a short series on the introduction of offensive security which will cover passive &amp; active recon, exploitation, and maintaining access, so new people can follow. I will however not talk about more advanced topics like how the Linux command line works (not in detail atleast, I wi&hellip;", "Hey @Evalion, do you have any specific topic in mind?", "@0x00pf I plan to do a short series on the introduction of offensive security which will cover passive &amp; active recon, exploitation, and maintaining access, so new people can follow. I will however not talk about more advanced topics like how the Linux command line works (not in detail atleast, I wi&hellip;", "Hey @Evalion, do you have any specific topic in mind?", "How about we focus on more basic stuff for the new people? Perhaps you can do some tuts on that? -Phoenix750", "I looked up porn on a school computer.  [image]Now for a serious reply: the most illegal thing I have ever done was not with a computer but with (you guessed it) electricity/electronics. In the early days when I was exploring the fundamental techniques of radio, I assembled a powerful transmitter &hellip;", "I second @oaktree. However, if you are new to this you should use a VM. I recommend starting out with Ubuntu because it is quite well documented and is pretty versatile. Don’t use Unity though! I personally like Xubuntu the most, but you can get any flavor you desire. Also, If you really want to l&hellip;", "I second @oaktree. However, if you are new to this you should use a VM. I recommend starting out with Ubuntu because it is quite well documented and is pretty versatile. Don’t use Unity though! I personally like Xubuntu the most, but you can get any flavor you desire. Also, If you really want to l&hellip;", "Dual booting is an alternative to all of those.", "Let’s hope people will buy ads then. -Phoenix750", "I guess if they aren’t obtrusive and if they are relevant, they will be fine. I just hope it will not damage the content somehow. -Phoenix750", "They won’t be obtrusive, nor will they be irrelevent. After all, we choose the advertisers; we choose the ads. This isn’t some google adsense.", "I think if the ads stick to our global topic, it’s fine. For example ads from http://hakshop.myshopify.com/ would be acceptable (in my oppinion ). And somehow the site has to be kept running. If donations doesn’t work, other ways have to do the job… |-TheDoctor-|", "I know that we need the money but I doubt if ads are a good idea. The main reason a lot of people, including me, come here is because unlike other sites, this site has (had) not a single ad in it. I guess it’s fine if the ads aren’t intrusive, but I’d personally rather not have them. -Phoenix750", "I have a number of passwords but they don’t seem to work when entered in the little prompt that pops up. Am I finished, or should I have a pass for this little prompt? EDIT: Ok, read Sergeantsploit’s answer above and think I got it, thanks for the challenge @0x00pf ! Here’s roughly what I did: ca&hellip;", "You know an article is good when I understand it. -Phoenix750", "You know an article is good when I understand it. -Phoenix750", "You know an article is good when I understand it. -Phoenix750", "UPDATE: Please refer to Linux Internals - The Art Of Symbol Resolution for a more detailed and updated analysis of the concept. Hey peeps! I hope you’re all doing great. It’s been a long time since my last post. Anyway, today I present to you something completely different from what you’ve been use&hellip;", "You know an article is good when I understand it. -Phoenix750", "How about reverse tethering (giving your android internet through your PC)? -Phoenix750", "I love how realistic they make the hacking look. I am surprised at the extent of the writers to even contact real hackers to make it look as legit as possible. However, the fact that conspiracy is too much pressed in the show and I am an anti bs-conspiracy guy (like ffs EVERYONE knows there is a 1%&hellip;", "I love how realistic they make the hacking look. I am surprised at the extent of the writers to even contact real hackers to make it look as legit as possible. However, the fact that conspiracy is too much pressed in the show and I am an anti bs-conspiracy guy (like ffs EVERYONE knows there is a 1%&hellip;", "Too bad I don’t understand forensics well enough (yet) to complete this challenge. Kudos to @sergeantsploit for finding such a straightforward solution and writing a detailed explanation though! -Phoenix750", "I love how realistic they make the hacking look. I am surprised at the extent of the writers to even contact real hackers to make it look as legit as possible. However, the fact that conspiracy is too much pressed in the show and I am an anti bs-conspiracy guy (like ffs EVERYONE knows there is a 1%&hellip;", "I love how realistic they make the hacking look. I am surprised at the extent of the writers to even contact real hackers to make it look as legit as possible. However, the fact that conspiracy is too much pressed in the show and I am an anti bs-conspiracy guy (like ffs EVERYONE knows there is a 1%&hellip;", "Too bad I don’t understand forensics well enough (yet) to complete this challenge. Kudos to @sergeantsploit for finding such a straightforward solution and writing a detailed explanation though! -Phoenix750", "I love how realistic they make the hacking look. I am surprised at the extent of the writers to even contact real hackers to make it look as legit as possible. However, the fact that conspiracy is too much pressed in the show and I am an anti bs-conspiracy guy (like ffs EVERYONE knows there is a 1%&hellip;", "Telling us how to generate the file would be a huge help to me. It would enable me to explore the method used so I can understand the gibberish better. And I’d assume that in the scenario you described I would know how said file was generated  Then again, forensics aren’t my art. -Phoenix750", "Telling us how to generate the file would be a huge help to me. It would enable me to explore the method used so I can understand the gibberish better. And I’d assume that in the scenario you described I would know how said file was generated  Then again, forensics aren’t my art. -Phoenix750", "I’d love to be able to kill/paralyze anyone by just thinking about it. I need a psychotherapist… -Phoenix750", "@sergeantsploit Well done  and great write up! Alternative way to get the passwords: In this simple case you can just run strings in the image to get the passwords @Evalion This is how the image was generated: $ dd if=/dev/zero of=disk_dump.img bs=1K count=100$ mkfs.vfat disk_dump.img$ mkdi&hellip;", "Telling us how to generate the file would be a huge help to me. It would enable me to explore the method used so I can understand the gibberish better. And I’d assume that in the scenario you described I would know how said file was generated  Then again, forensics aren’t my art. -Phoenix750", "Telling us how to generate the file would be a huge help to me. It would enable me to explore the method used so I can understand the gibberish better. And I’d assume that in the scenario you described I would know how said file was generated  Then again, forensics aren’t my art. -Phoenix750", "It is not a real partition. It is very small and is almost empty so it can be compressed a lot. If somebody is interested I can write a couple of lines on how to generate the file… in case nobody mentions this in the comments.", "How do you even put an entire partition into a single file? (except dd) -Phoenix750", "Well, what about starting a wifi hotspot on your PC? P.S.: If your device is rooted (and your using Windows ), this application may work http://forum.xda-developers.com/showthread.php?t=1371345", "Atleast worth a try though. -Phoenix750", "I’d love to be able to kill/paralyze anyone by just thinking about it. I need a psychotherapist… -Phoenix750", "You are really evil !", "How about reverse tethering (giving your android internet through your PC)? -Phoenix750", "I’d love to be able to kill/paralyze anyone by just thinking about it. I need a psychotherapist… -Phoenix750", "I heard it takes a horrible amount of effort and even then some apps don’t recognize the connection.", "How about reverse tethering (giving your android internet through your PC)? -Phoenix750", "I’d love to be able to kill/paralyze anyone by just thinking about it. I need a psychotherapist… -Phoenix750", "power greater in scope or magnitude than that which is considered natural or has previously existed. Hacking doesn’t sound like any of that. Hacking is a natural instinct in humans, even if it isn’t computer-related. so both the “natural” and “previously existed” arguments can be declared as inva&hellip;", "I believe it to be a skill, but if you get the right person behind the keyboard…sexy! I love people who will stand up and do what is right. Anonymous is an idea. Some people are morons. I like the idea and I like the people who are kind. I’m not talking get walked all over in the name of kindness,&hellip;", "Anonymous might have had a solid point back in 2010, but now this once great idea is nothing more but a group of people with big mouths (not saying big mouths for the bad), but are too much of pussies to actually turn their words into action. Sad to see such good ideologies go to waste honestly. An&hellip;", "Anonymous might have had a solid point back in 2010, but now this once great idea is nothing more but a group of people with big mouths (not saying big mouths for the bad), but are too much of pussies to actually turn their words into action. Sad to see such good ideologies go to waste honestly. An&hellip;", "When I think of hackers… I think of two types. Type Awesome (Type A): They care about themselves, their families and majority of people. Type Fail (Type F): They care about themselves. Period. Looks, religions, gender, sex… That all varies in both types. I love the Type A.", "@pry0cc That movie only encourages the bs stereotype society has of us. At least that is my opinion. Hackers &amp; hoodies is one of those retarded things that the media has stamped onto us, while it is in fact not true, and I find it sad that even Mr. Robot is following this trend. When I think about &hellip;", "It may not be a superpower (as in supernatural) but it does turn people into superheroes. Take the people who are active participants in the Anonymous Idea. They are superheroes to me (as well as many others). They might not be supernatural, but they are naturally super. And as all superheroes… They&hellip;", "You are not a failure. Because failing is the stepping stone to learning. Remember that the same boiling water that softens the potato also hardens the egg. It isn’t about your circumstances, it’s about what you’re made of in the end. Best of luck, hope to see you soon! -Phoenix750", "Edward Snowden is defined as a criminal because he exposed the truth of a corrupt nation. We would be defined criminals because we got butthurt over a single, non-important and terrible phishing mail. One is whistleblowing, and the other is just overreacting. There is a clear difference between th&hellip;", "Hmmm, I guess you’re right then. -Phoenix750", "My point was simply to highlight the fact that Morality and Legality are two very different things.", "Edward Snowden is defined as a criminal because he exposed the truth of a corrupt nation. We would be defined criminals because we got butthurt over a single, non-important and terrible phishing mail. One is whistleblowing, and the other is just overreacting. There is a clear difference between th&hellip;", "Neither 0x00sec nor its affiliates are liable for any act, legal or otherwise, that you commit as a result of this post.", "Edward Snowden is defined a Criminal, does that make him a bad person?", "I wouldn’t do that. Not in the name of 0x00sec at least. He may be a criminal himself, but committing a crime against a criminal also makes you a criminal  -Phoenix750", "I wouldn’t do that. Not in the name of 0x00sec at least. He may be a criminal himself, but committing a crime against a criminal also makes you a criminal  -Phoenix750", "You should reply, but mess with him instead. Some guys of the Belgian national television once pulled this off, and it was funny as hell. -Phoenix750", "You should reply, but mess with him instead. Some guys of the Belgian national television once pulled this off, and it was funny as hell. -Phoenix750", "You should reply, but mess with him instead. Some guys of the Belgian national television once pulled this off, and it was funny as hell. -Phoenix750", "Hey guys! Check out this awful phishing attempt I received in my email! For OPSEC reasons, I’ve changed any occurrence of my name to “Doe.” Yes, he addressed me by my last name. Subject: Dear Doe,Message:Dear Doe, I am Barrister Fredrick Adonko, a Legal adviser to my late clientMr.D.E.Doe,a &hellip;", "You should reply, but mess with him instead. Some guys of the Belgian national television once pulled this off, and it was funny as hell. -Phoenix750", "Are vulnerable WPS routers/AP’s still a thing nowadays? -Phoenix750", "Let me guess… you used wifi-phisher? And default passwords don’t count  -Phoenix750", "Some people unfortunately set up strong wifi passwords  -Phoenix750", "As evidenced by this message, yes. And the router looks like it’s at least 5 years old.", "As evidenced by this message, yes. And the router looks like it’s at least 5 years old.", "Nope. WPS Pixie attack, recovered in 17 seconds.", "Are vulnerable WPS routers/AP’s still a thing nowadays? -Phoenix750", "Nope. WPS Pixie attack, recovered in 17 seconds.", "Let me guess… you used wifi-phisher? And default passwords don’t count  -Phoenix750", "Some people unfortunately set up strong wifi passwords  -Phoenix750", "The guy whose wifi I’m using right now has “9e76a692” as his password. That’s pretty strong, right? Yet here I am. There’s always a way.", "Some people unfortunately set up strong wifi passwords  -Phoenix750", "I should learn C… Seriously though, I’ve been whining all over IRC for some good books to recommend, but only got “learn C the hard way” and the book by Ritchie. And don’t tell me that is enough, because I’m pretty sure this fancy stuff isn’t covered in either of the two! (or is it?). Basically, wh&hellip;", "A superpower is when you are capable of something which is not considered possible by humans. Computers are built to work in a specific way, and to understand other devices depending on their language. Just like we as humans, can communicate with other humans depending on their languages. I agree d&hellip;", "I think we can draw a conclusion already from this debate: Hacking itself is not a superpower, but it can be used to achieve superpower-like things. -Phoenix750", "@pry0cc I wouldn’t underestimate the skills cooks have. And there are quite surprisingly many people who are capable of hacking. But I took cooks as an example. We could instead also say the same for martial artists, SAS soldiers, etc… While it is true that Bruce and Tony have spent a lot of time o&hellip;", "Hacking is not a super power. It’s a skill. It’s as simple as that. Unless you can raise traffic barriers, bridges, explode helicopters, stop trains, etc. with just a single push on your phone, like you can in W_D, hacking is not a superpower. And let’s not forget that Aiden is NOT hacking with his&hellip;", "@pry0cc That movie only encourages the bs stereotype society has of us. At least that is my opinion. Hackers &amp; hoodies is one of those retarded things that the media has stamped onto us, while it is in fact not true, and I find it sad that even Mr. Robot is following this trend. When I think about &hellip;", "@pry0cc I wouldn’t underestimate the skills cooks have. And there are quite surprisingly many people who are capable of hacking. But I took cooks as an example. We could instead also say the same for martial artists, SAS soldiers, etc… While it is true that Bruce and Tony have spent a lot of time o&hellip;", "power greater in scope or magnitude than that which is considered natural or has previously existed. Hacking doesn’t sound like any of that. Hacking is a natural instinct in humans, even if it isn’t computer-related. so both the “natural” and “previously existed” arguments can be declared as inva&hellip;", "Hacking is not a super power. It’s a skill. It’s as simple as that. Unless you can raise traffic barriers, bridges, explode helicopters, stop trains, etc. with just a single push on your phone, like you can in W_D, hacking is not a superpower. And let’s not forget that Aiden is NOT hacking with his&hellip;", "I am on IRC, nothing happens. I leave for a few hours, then this shit happens… fml  [image]-Phoenix750", "I think the “bs stereotype” you refer to is more than a writers portrayal of what he thinks hackers look and act like. I think the stereotype that exists is one that connects to human desire to connect and communicate, mostly with other human beings, but in our case with machines. Machines don’t ar&hellip;", "@pry0cc That movie only encourages the bs stereotype society has of us. At least that is my opinion. Hackers &amp; hoodies is one of those retarded things that the media has stamped onto us, while it is in fact not true, and I find it sad that even Mr. Robot is following this trend. When I think about &hellip;", "I think we can draw a conclusion already from this debate: Hacking itself is not a superpower, but it can be used to achieve superpower-like things. -Phoenix750", "@pry0cc I wouldn’t underestimate the skills cooks have. And there are quite surprisingly many people who are capable of hacking. But I took cooks as an example. We could instead also say the same for martial artists, SAS soldiers, etc… While it is true that Bruce and Tony have spent a lot of time o&hellip;", "power greater in scope or magnitude than that which is considered natural or has previously existed. Hacking doesn’t sound like any of that. Hacking is a natural instinct in humans, even if it isn’t computer-related. so both the “natural” and “previously existed” arguments can be declared as inva&hellip;", "Hacking is not a super power. It’s a skill. It’s as simple as that. Unless you can raise traffic barriers, bridges, explode helicopters, stop trains, etc. with just a single push on your phone, like you can in W_D, hacking is not a superpower. And let’s not forget that Aiden is NOT hacking with his&hellip;", "Ok, I think the time has come for me to join your sweet discussion here . First, I think the thought that hacking can be seen as a superpower is of course not right, when you take it literally. But I think it can be treated metaphoric. “Events” like the Panama Papers (Interesting that nobody else u&hellip;", "I would reccomend watching this https://youtu.be/dR7CbXMjya8", "Hacking is not a super power. It’s a skill. It’s as simple as that. Unless you can raise traffic barriers, bridges, explode helicopters, stop trains, etc. with just a single push on your phone, like you can in W_D, hacking is not a superpower. And let’s not forget that Aiden is NOT hacking with his&hellip;", "power greater in scope or magnitude than that which is considered natural or has previously existed. Hacking doesn’t sound like any of that. Hacking is a natural instinct in humans, even if it isn’t computer-related. so both the “natural” and “previously existed” arguments can be declared as inva&hellip;", "@pry0cc I wouldn’t underestimate the skills cooks have. And there are quite surprisingly many people who are capable of hacking. But I took cooks as an example. We could instead also say the same for martial artists, SAS soldiers, etc… While it is true that Bruce and Tony have spent a lot of time o&hellip;", "I think we can draw a conclusion already from this debate: Hacking itself is not a superpower, but it can be used to achieve superpower-like things. -Phoenix750", "I think we can draw a conclusion already from this debate: Hacking itself is not a superpower, but it can be used to achieve superpower-like things. -Phoenix750", "I think we can draw a conclusion already from this debate: Hacking itself is not a superpower, but it can be used to achieve superpower-like things. -Phoenix750", "I can absolutely see your points. What does everybody else think?", "@pry0cc I wouldn’t underestimate the skills cooks have. And there are quite surprisingly many people who are capable of hacking. But I took cooks as an example. We could instead also say the same for martial artists, SAS soldiers, etc… While it is true that Bruce and Tony have spent a lot of time o&hellip;", "@pry0cc I wouldn’t underestimate the skills cooks have. And there are quite surprisingly many people who are capable of hacking. But I took cooks as an example. We could instead also say the same for martial artists, SAS soldiers, etc… While it is true that Bruce and Tony have spent a lot of time o&hellip;", "Such a decent argument. I’ve almost got no arguments left. But I’ll see how many more rounds of devils advocate I can play. Cooks aren’t super (no disrespect to cooks!) because a lot of them exist.  After all, the value of something is often defined by its scarcity. If everybody was a millionaire, &hellip;", "Hacking in my opinion is merely a skill. It’s how you use it that can make it a superpower. However it is a bit funny because people often think of hackers as having superpowers- but that’s only because of how the media portrays them.", "@pry0cc I wouldn’t underestimate the skills cooks have. And there are quite surprisingly many people who are capable of hacking. But I took cooks as an example. We could instead also say the same for martial artists, SAS soldiers, etc… While it is true that Bruce and Tony have spent a lot of time o&hellip;", "Hacking is not a super power. It’s a skill. It’s as simple as that. Unless you can raise traffic barriers, bridges, explode helicopters, stop trains, etc. with just a single push on your phone, like you can in W_D, hacking is not a superpower. And let’s not forget that Aiden is NOT hacking with his&hellip;", "power greater in scope or magnitude than that which is considered natural or has previously existed. Hacking doesn’t sound like any of that. Hacking is a natural instinct in humans, even if it isn’t computer-related. so both the “natural” and “previously existed” arguments can be declared as inva&hellip;", "Such a decent argument. I’ve almost got no arguments left. But I’ll see how many more rounds of devils advocate I can play. Cooks aren’t super (no disrespect to cooks!) because a lot of them exist.  After all, the value of something is often defined by its scarcity. If everybody was a millionaire, &hellip;", "power greater in scope or magnitude than that which is considered natural or has previously existed. Hacking doesn’t sound like any of that. Hacking is a natural instinct in humans, even if it isn’t computer-related. so both the “natural” and “previously existed” arguments can be declared as inva&hellip;", "Hacking is not a super power. It’s a skill. It’s as simple as that. Unless you can raise traffic barriers, bridges, explode helicopters, stop trains, etc. with just a single push on your phone, like you can in W_D, hacking is not a superpower. And let’s not forget that Aiden is NOT hacking with his&hellip;", "You should tell me more about it when I get on IRC later today. -Phoenix750", "I can see your reasoning and appreciate your point of view. The way we define if it is, or not, stems from our definition of super power. This dictionary puts it as [quote] &quot;power greater in scope or magnitude than that which is considered natural or has previously existed.[/quote] I don’t think po&hellip;", "power greater in scope or magnitude than that which is considered natural or has previously existed. Hacking doesn’t sound like any of that. Hacking is a natural instinct in humans, even if it isn’t computer-related. so both the “natural” and “previously existed” arguments can be declared as inva&hellip;", "Hacking is not a super power. It’s a skill. It’s as simple as that. Unless you can raise traffic barriers, bridges, explode helicopters, stop trains, etc. with just a single push on your phone, like you can in W_D, hacking is not a superpower. And let’s not forget that Aiden is NOT hacking with his&hellip;", "Hacking is not a super power. It’s a skill. It’s as simple as that. Unless you can raise traffic barriers, bridges, explode helicopters, stop trains, etc. with just a single push on your phone, like you can in W_D, hacking is not a superpower. And let’s not forget that Aiden is NOT hacking with his&hellip;", "I can see your reasoning and appreciate your point of view. The way we define if it is, or not, stems from our definition of super power. This dictionary puts it as [quote] &quot;power greater in scope or magnitude than that which is considered natural or has previously existed.[/quote] I don’t think po&hellip;", "Besides Social Engineering, recon is by far the most important aspect of hacking. Without recon, all the greatest hackers of our time probably wouldn’t be able to hack anything. Besides, just shoving one exploit after another, when there are thousands of exploits in Metasploit alone, is inefficient. &hellip;", "We need more tutorials like these. -Phoenix750", "I recently have just finished watching “The Internet’s own Boy”; a film about Aaron Swartz. He alone has achieved a lot in terms of politics and ‘hacking’ society before his tragic suicide. During the Documentary he and his brothers speak of Programming being a super power, as they are able to achi&hellip;", "Hacking is not a super power. It’s a skill. It’s as simple as that. Unless you can raise traffic barriers, bridges, explode helicopters, stop trains, etc. with just a single push on your phone, like you can in W_D, hacking is not a superpower. And let’s not forget that Aiden is NOT hacking with his&hellip;", "I’m considering making an alert bot that links with my phone via Push bullet so.that people can get hold of me, sort of an IRC pager. Would you wanna be on the bot?", "I am on IRC, nothing happens. I leave for a few hours, then this shit happens… fml  [image]-Phoenix750", "I feel ya mate", "I am on IRC, nothing happens. I leave for a few hours, then this shit happens… fml  [image]-Phoenix750", "I am on IRC, nothing happens. I leave for a few hours, then this shit happens… fml  [image]-Phoenix750", "I am on IRC, nothing happens. I leave for a few hours, then this shit happens… fml  [image]-Phoenix750", "I’m not really a programmer (yet), so I don’t really care. However, I believe I can transfer schematics of my electronics to git, so I vote yes. -Phoenix750", "Actually works the same as bash (PS can be considered as a bash/cmd mesh with COM and WMI extensions). So if you tee, or write a file like stream, or profile-log, you’ll write to disk, not by default. BUT, PS does have a command history which gets written under the profile you’re using - and is ses&hellip;", "Now I am wondering, would this file binder also work to bind a text file into a PowerShell script? Because if it can, you can just use PowerSploit to get a payload on there using SE that way. PowerShell also doesn’t write to the disk unless told to do (atleast that’s what I heard), so that could als&hellip;", "It might be able to but I’ve never tested PowerShell scripts. It doesn’t necessarily need an executable to work, so it’s probably possible, e.g. a PowerShell script and an image file.", "It might be able to but I’ve never tested PowerShell scripts. It doesn’t necessarily need an executable to work, so it’s probably possible, e.g. a PowerShell script and an image file.", "Now I am wondering, would this file binder also work to bind a text file into a PowerShell script? Because if it can, you can just use PowerSploit to get a payload on there using SE that way. PowerShell also doesn’t write to the disk unless told to do (atleast that’s what I heard), so that could als&hellip;", "I’m not really a programmer (yet), so I don’t really care. However, I believe I can transfer schematics of my electronics to git, so I vote yes. -Phoenix750", "I’m not really a programmer (yet), so I don’t really care. However, I believe I can transfer schematics of my electronics to git, so I vote yes. -Phoenix750", "I’ll just message you them when I have time later today", "I’ve got a couple good ones if you’d like!", "I should learn C… Seriously though, I’ve been whining all over IRC for some good books to recommend, but only got “learn C the hard way” and the book by Ritchie. And don’t tell me that is enough, because I’m pretty sure this fancy stuff isn’t covered in either of the two! (or is it?). Basically, wh&hellip;", "I should learn C… Seriously though, I’ve been whining all over IRC for some good books to recommend, but only got “learn C the hard way” and the book by Ritchie. And don’t tell me that is enough, because I’m pretty sure this fancy stuff isn’t covered in either of the two! (or is it?). Basically, wh&hellip;", "There could be material out there which discusses different “flavours”(?) of C like WinAPI but I learned it from reading the documentation and copy and pasting code from all over the internet (especially Stack Overflow). A lot of the code I couldn’t understand at first but over time as I familiarize&hellip;", "I should learn C… Seriously though, I’ve been whining all over IRC for some good books to recommend, but only got “learn C the hard way” and the book by Ritchie. And don’t tell me that is enough, because I’m pretty sure this fancy stuff isn’t covered in either of the two! (or is it?). Basically, wh&hellip;", "A pretty simple thing, but it hasn’t been suggested yet for some reason. If it is possible, users who have reached a certain trust level (I recommend the “member” trust level) should have the ability to change the title displayed behind their names by themselves, and not have a mod do it for them. I&hellip;", "There is actually a members lounge… People who are members who higher have access to this category. That might be a brilliant idea; to put it in the members lounge.", "A lounge sounds interesting indeed. Would love to share some of my stories I’ve encountered while gaming! -Phoenix750", "0x00sec as we all know is a great Hacking and Computer Science community. I thought that having a category for some funny stuff, memes etc related to computers and hacking would be great. I just wanted to know the view of the community over this so here is my poll. Should we have a category for fun&hellip;", "A lounge sounds interesting indeed. Would love to share some of my stories I’ve encountered while gaming! -Phoenix750", "I never worked with Ruby (or any program language, really) for that matter. But I guess Discourse could be fragile if we are careless. -Phoenix750", "I never worked with Ruby (or any program language, really) for that matter. But I guess Discourse could be fragile if we are careless. -Phoenix750", "A pretty simple thing, but it hasn’t been suggested yet for some reason. If it is possible, users who have reached a certain trust level (I recommend the “member” trust level) should have the ability to change the title displayed behind their names by themselves, and not have a mod do it for them. I&hellip;", "A pretty simple thing, but it hasn’t been suggested yet for some reason. If it is possible, users who have reached a certain trust level (I recommend the “member” trust level) should have the ability to change the title displayed behind their names by themselves, and not have a mod do it for them. I&hellip;", "A pretty simple thing, but it hasn’t been suggested yet for some reason. If it is possible, users who have reached a certain trust level (I recommend the “member” trust level) should have the ability to change the title displayed behind their names by themselves, and not have a mod do it for them. I&hellip;", "So me and @dtm have talked on this and the conclusion is that Lulz is not really what we want this category to achieve. I fear having just Lulz will make us the next 9Gag. Lulz is actually a part of this category we want to name 0x00 and Chill. This is the place we propose to have a social section f&hellip;", "Ah and I recall a pretty good C/C++ tut on NB by @Evalion, if you’d want to go check that out.", "@pry0cc I disagree. If you exploit a Windows/OSX machine, what are you going to do next? Exactly, post exploitation. Knowing how Windows/OSX works can be a great boost in this. Example: getting a shell on Windows but not being able to use the Windows command prompt leaves you stranded. 0x00sec shou&hellip;", "@pry0cc I disagree. If you exploit a Windows/OSX machine, what are you going to do next? Exactly, post exploitation. Knowing how Windows/OSX works can be a great boost in this. Example: getting a shell on Windows but not being able to use the Windows command prompt leaves you stranded. 0x00sec shou&hellip;", "You are right bro. You should be!", "@pry0cc I disagree. If you exploit a Windows/OSX machine, what are you going to do next? Exactly, post exploitation. Knowing how Windows/OSX works can be a great boost in this. Example: getting a shell on Windows but not being able to use the Windows command prompt leaves you stranded. 0x00sec shou&hellip;", "Question-Suggestion regarding Windows: As @Evalion mentioned, it is imperative that you know what you are attacking. And on IRC I picked up that not all of us know how Windows enterprise network and configurations work. Maybe it would be viable to create a Microsoft category which would be used to&hellip;", "I agree. Nice to see you back.", "@pry0cc I disagree. If you exploit a Windows/OSX machine, what are you going to do next? Exactly, post exploitation. Knowing how Windows/OSX works can be a great boost in this. Example: getting a shell on Windows but not being able to use the Windows command prompt leaves you stranded. 0x00sec shou&hellip;", "For example @airth with his very fundamental but very well written subnetting article. Or to @Evalion from whom we can expect a lot of hardware hacking in the future. Just to people who have a little more experience as the others in this community. So it would be awesome if i see the articles the&hellip;", "Hello fellas! I’m happy to announce that I have free time and will be more active here! Also, I want to share my experience and my journey: Everything started five years ago. I was searching forums to learn C++ and C#, but stopped for a while to go on vacation. Upon returning from that trip, I was &hellip;", "You are not a failure. Because failing is the stepping stone to learning. Remember that the same boiling water that softens the potato also hardens the egg. It isn’t about your circumstances, it’s about what you’re made of in the end. Best of luck, hope to see you soon! -Phoenix750", "Sorry to hear that friend, I sympathize with you. If I put in as much time studying course material as I spend researching whatever catches my attention I would excel in academics. With that being said, you’re not a failure. The fact that you are on this site and contributing means you definitely h&hellip;", "Attitude is important. Have a good one, and you’ll be more likely to succeed. Put time into what needs it and you’ll get results.", "You are not a failure. Because failing is the stepping stone to learning. Remember that the same boiling water that softens the potato also hardens the egg. It isn’t about your circumstances, it’s about what you’re made of in the end. Best of luck, hope to see you soon! -Phoenix750", "10/10 I approve. [image]", "@unh0lys0da you are right. Phone manufacturers implement all kinds of stuff to make reverse engineering their hardware nearly impossible. In order to put the firmware on the microcontrollers, they use their own secret programmers, so no JTAG or PICkit programmers ;). @CtrlAltDelete, fear not! Like &hellip;", "@unh0lys0da you are right. Phone manufacturers implement all kinds of stuff to make reverse engineering their hardware nearly impossible. In order to put the firmware on the microcontrollers, they use their own secret programmers, so no JTAG or PICkit programmers ;). @CtrlAltDelete, fear not! Like &hellip;", "Serial pins on a smartphone would be very small and I doubt there are any. Reverse engineering is something smartphone manufracturers will try to prevent as much as possible. Nevertheless, one way or another they must’ve used this or JTAG, or something else to put the stuff on the chips (I think) @&hellip;", "too late. i opened it up and now the fbi are here!!! ah Actually that sounds about right as I can’t connect through any other method, but I have no soldering tools here and I don’t want to…mess anything up. I kind of share this with other people D:", "Who even uses their ISP’s default router anyways? @airth -Phoenix750", "10/10 I approve. [image]", "10/10 I approve. [image]", "10/10 I approve. [image]", "Right. I know the solution. @Evalion is with me on this I’m sure. Steps to Solve your Awful IssueRemove the screws on the bottom of the modemLook for some ambiguous pinsPoke around with a osciliator trying to find a signalSolder your serial cable to the pins, hopefully you’ve found them by loo&hellip;", "How to Perform Open-Heart Surgery in Six Easy Steps by @pry0cc and @Evalion. @Sea: Don’t actually open up the router. Okay?", "10/10 I approve. [image]", "How to Perform Open-Heart Surgery in Six Easy Steps by @pry0cc and @Evalion. @Sea: Don’t actually open up the router. Okay?", "Right. I know the solution. @Evalion is with me on this I’m sure. Steps to Solve your Awful IssueRemove the screws on the bottom of the modemLook for some ambiguous pinsPoke around with a osciliator trying to find a signalSolder your serial cable to the pins, hopefully you’ve found them by loo&hellip;", "The culture and community are also favorites of mine.", "Who even uses their ISP’s default router anyways? @airth -Phoenix750", "The culture and community are also favorites of mine.", "The subculture of the hacking Community. The thing I especially like about the Infosec community is that the hacker cells are embedded amongst society. We literally live amongst those whom we are trying to protect. And that is what makes hackers strong: they can be everywhere. -Phoenix750", "The subculture of the hacking Community. The thing I especially like about the Infosec community is that the hacker cells are embedded amongst society. We literally live amongst those whom we are trying to protect. And that is what makes hackers strong: they can be everywhere. -Phoenix750", "OWASP works just like any other vulnerability scanner. You can google how a vulnerability scanner works. -Phoenix750", "OWASP works just like any other vulnerability scanner. You can google how a vulnerability scanner works. -Phoenix750", "OWASP works just like any other vulnerability scanner. You can google how a vulnerability scanner works. -Phoenix750", "OWASP works just like any other vulnerability scanner. You can google how a vulnerability scanner works. -Phoenix750", "Hello homies and homets! PySec/Airth here coming at you with some 1337 subnetting. This article was originally posted on Null Byte but since I joined the 0x00sec team and there are a ton of new comers, I decided to re-upload some of them so people won’t get confused with the rest of the posts I will&hellip;", "Alternate Title: Picking Up Women: For Hackers.", "We did it! 100 users!Hello 0x00’ers! A couple of weeks ago, this community started off as a fun new place to teach, learn and discuss Infomation Security, following the swift decline in activity at Nullbyte. Between three humble hackers on the #nullbyte IRC channel; Me, @oaktree and @unh0lys0da wor&hellip;", "Hello Hackers ! Welcome to this my new tutorial ( or at least sharing some tips ) . Here you will learn how to use Netcat and what is Netcat. Netcat is the swiss army knife for hacker and network administrator. If you want to test a simple server/client app that you programmed in your favorite lan&hellip;", "There is unreadable code. And then there’s JSchmoe code… -Phoenix750", "SET is great when you have a short space of time at hand, however sometimes you want to know whats actually going on under the hood or have found a site you can’t clone with SET. Step 1: Select Your Target!The First Thing You’re Going to Want to Do Is Select the Site Login You Wish to Clone! For T&hellip;", "There is unreadable code. And then there’s JSchmoe code… -Phoenix750", "Direct Download to bypass popups =", "Real MVP. -Phoenix750", "There is unreadable code. And then there’s JSchmoe code… -Phoenix750", "for i in range(int(raw_input(&quot;Please enter the number of drivers in your family: &quot;))): print(&quot;The amount of insurance for &quot;+raw_input(&quot;Driver &quot;+str(i+1)+&quot; name: &quot;)+&quot;: $&quot;+str(str([1150 if (16 &lt;= age &lt;= 19) else ( 1050 if (20 &lt;= age &lt;= 25) else ( 900 if age &gt; 25 else 0)) for age in [int(raw_input(&quot;Dri&hellip;", "There is unreadable code. And then there’s JSchmoe code… -Phoenix750", "Yes. Meaning anyone under 16", "Just wondering: “any other age” gets the basic price for their insurance? -Phoenix750", "I am currently writing a program in C++ as well. Expect it to be up later! -Phoenix750", "I am currently writing a program in C++ as well. Expect it to be up later! -Phoenix750", "I’ll be writing it in C++. I would say Python is also eligible for that particular program.", "Does it need to be written in any specific language? -Phoenix750", "I can confirm that Facebook patched this a long time ago. -Phoenix750", "I can confirm that Facebook patched this a long time ago. -Phoenix750", "Glad to see my pupil has joined us as well. Welcome to our community! -Phoenix750", "Glad to see my pupil has joined us as well. Welcome to our community! -Phoenix750", "Hello 0x00sec ! i’m glad i joined this awesome community also i will be every single day here and will try to help with what i can ! Phoenix was the guy who motivated me to keep doing things like those ! thank you man. Also i would like to suggest to create new category something like for example we&hellip;", "Glad to see my pupil has joined us as well. Welcome to our community! -Phoenix750", "Request granted. -Phoenix750", "I agree, this would make us an actual company. That would require degrees and certificates. And more importantly, real identities.", "I would advice against doing pentests. We are after all a community, not a registered infosec research center. Companies have no way of checking if we are legitimate and thus they won’t trust us. And honestly, I can’t blame them. Not to mention all the juridical trouble to deal with. Furthermore, p&hellip;", "Thanks for these suggestions @okznokz! For a chat room, we do have an IRC, but you can access it without a special client (if thats what you were worried about) at https://blog.0x00sec.org/irc We do have a section for community members, but it isn’t really developed. This might actually be a reall&hellip;", "Do you have any other idea for the site ?", "1.) Might be looked into by @pry0cc. 2.) I believe that sections already accomplish this 3.) We already have that. 4.) Might again be looked into by @pry0cc. 5.) Adding sharing buttons also adds malicious code from G+ and Facebook to our site. But it might be open for discussion. I hope I helpe&hellip;", "1.) Might be looked into by @pry0cc. 2.) I believe that sections already accomplish this 3.) We already have that. 4.) Might again be looked into by @pry0cc. 5.) Adding sharing buttons also adds malicious code from G+ and Facebook to our site. But it might be open for discussion. I hope I helpe&hellip;", "First, I want to congratulate you on a great site! Looks terrific and its good to see some familiar faces (?) here. I’ve missed you all! Second, I did launch a certificate website at www.white-hat-hacker.com. This is only for certifications. I am still working on a site with tutorials et al for our&hellip;", "Glad to have you on here! And yes, having a cooperation between 0x00sec and your site would be ideal! That is why I will make separate series on each site respectively. After all, we are one community. -Phoenix750", "Glad to have you on here! And yes, having a cooperation between 0x00sec and your site would be ideal! That is why I will make separate series on each site respectively. After all, we are one community. -Phoenix750", "Glad to have you on here! And yes, having a cooperation between 0x00sec and your site would be ideal! That is why I will make separate series on each site respectively. After all, we are one community. -Phoenix750", "I am currently writing an article for newcomers. I’ll make sure to include this! -Phoenix750", "It could sound simple for those who already have some knowledge about hacking. But for beginners (like me) this task could be a mystery. To discover or resolve an IP address from a domain is quite simple, in Linux systems you can just open your terminal and type: host &quot;domain name&quot; dig “domain n&hellip;", "I understand that mate, I only put it up as a last scenario plan we should at least consider. I mean I really don’t think we’ll be thinking about whether knowledge or free or not (although I think it should be), when the site’s struggling. I really don’t want that to ever happen, but my point of vie&hellip;", "I am currently writing an article for newcomers. I’ll make sure to include this! -Phoenix750", "I would advice against doing pentests. We are after all a community, not a registered infosec research center. Companies have no way of checking if we are legitimate and thus they won’t trust us. And honestly, I can’t blame them. Not to mention all the juridical trouble to deal with. Furthermore, p&hellip;", "Hello, My name is WireWise, today I will show you how to how to write some anti-forensics code in Python 3. None of this code is low-level anti-forensics(rootkits) in the way there is no kernel or user land hooks(I’m learning that and hopefully will post about it someday). Most of the code will be &hellip;", "Hello Hackers ! In this topic, I will share you some link and some tips on how to find good resources to learn “Hacking” The first thing to do is maybe learn a programming language I start in learning C when I was younger but I didn’t go too  deep in this programming language. A good starting poi&hellip;", "I am currently writing an article for newcomers. I’ll make sure to include this! -Phoenix750", "I am currently writing an article for newcomers. I’ll make sure to include this! -Phoenix750", "I would advice against doing pentests. We are after all a community, not a registered infosec research center. Companies have no way of checking if we are legitimate and thus they won’t trust us. And honestly, I can’t blame them. Not to mention all the juridical trouble to deal with. Furthermore, p&hellip;", "I agree on that. -Phoenix750", "Wow that’s awesome! I really like the idea of doing something to support the site, rather than just going “GIVE US MONEY PLZ”. I had an idea to do security scans and security assements for companies/people. 0x00sec could become a Pentesting company. We don’t exactly have a shortage of talented peopl&hellip;", "I agree that knowledge should be free, but I would love to donate money to keep this site up. It wouldn’t be required to donate, but if we want to, we should be able to.", "As some of you already know, I will be building a small electronics lab later this year, which will allow me to build my designs like EMP’s and spy gadgets. I might auction them on ebay and the money can go to 0x00sec! Though I think it would be illegal to put stuff like that on ebay… -Phoenix750", "As some of you already know, I will be building a small electronics lab later this year, which will allow me to build my designs like EMP’s and spy gadgets. I might auction them on ebay and the money can go to 0x00sec! Though I think it would be illegal to put stuff like that on ebay… -Phoenix750", "I don’t know about the others, but I am really against that. Knowledge should be free! We will pick our money elsewhere. -Phoenix750", "I don’t get all the hate on this game. I started playing it recently and yes, it is not realistic to real hacking. But seriously guys, does it need to be? Like Cromical said, COD won’t make you an elite soldier. Same goes for Hacker Experience. It is not meant for learning, it is meant for entertain&hellip;", "I’m not claiming he plagiarized either. I’m just saying that what he wrote looks similar. -Phoenix750", "So did you directly copy this from another website or have I found your little facebook page?", "This also looks similar to me… -Phoenix750", "IntroductionAs a hacker or anything else related to security or hacking, you should know the most famous hacking attack a.k.a The Man in the middle Attack. This attack is the easiest attack that should be known by all of security engineer and hackers. I’ve seen a lot of people (mainly script kidd&hellip;", "Hello 0x00’ers! To help drive discussion and encourage contributors, we are introducing a weekly “contributor of the week” award, which will be known as “l33t of the w33k”  We (moderators) will read through the posts and topics and assign up to two awards for the best quality and most frequent cont&hellip;", "Nice to see you on here Phoenix", "I don’t get all the hate on this game. I started playing it recently and yes, it is not realistic to real hacking. But seriously guys, does it need to be? Like Cromical said, COD won’t make you an elite soldier. Same goes for Hacker Experience. It is not meant for learning, it is meant for entertain&hellip;", "I agree to that. -Phoenix750", "Probably shouldn’t be in this section then. Perhaps in an Entertainment section?", "Probably shouldn’t be in this section then. Perhaps in an Entertainment section?", "I don’t get all the hate on this game. I started playing it recently and yes, it is not realistic to real hacking. But seriously guys, does it need to be? Like Cromical said, COD won’t make you an elite soldier. Same goes for Hacker Experience. It is not meant for learning, it is meant for entertain&hellip;"]}