{"user": "FFY00", "history": ["everything is AI ready, as in thatnothing is AI ready and we know beans about it", "sounds cool right? No. That’s a bit stupid IMO. Here’s my reaction when reading the project page: Meadow is the world’s first, modern, secure, professional IoT platform. Hum??? It combines the best of all worlds; it has the power of RaspberryPi, the computing factor of an Arduino No, thi&hellip;", "sounds cool right? No. That’s a bit stupid IMO. Here’s my reaction when reading the project page: Meadow is the world’s first, modern, secure, professional IoT platform. Hum??? It combines the best of all worlds; it has the power of RaspberryPi, the computing factor of an Arduino No, thi&hellip;", "sounds cool right? No. That’s a bit stupid IMO. Here’s my reaction when reading the project page: Meadow is the world’s first, modern, secure, professional IoT platform. Hum??? It combines the best of all worlds; it has the power of RaspberryPi, the computing factor of an Arduino No, thi&hellip;", "sounds cool right? No. That’s a bit stupid IMO. Here’s my reaction when reading the project page: Meadow is the world’s first, modern, secure, professional IoT platform. Hum??? It combines the best of all worlds; it has the power of RaspberryPi, the computing factor of an Arduino No, thi&hellip;", "Do you think that switching to your browser’s private browsing mode or incognito mode will make you anonymous? Then click: https://www.nothingprivate.ml/ Don’t actually use your real name  A cool little proof of concept, awareness-raising project", "sounds cool right? No. That’s a bit stupid IMO. Here’s my reaction when reading the project page: Meadow is the world’s first, modern, secure, professional IoT platform. Hum??? It combines the best of all worlds; it has the power of RaspberryPi, the computing factor of an Arduino No, thi&hellip;", "sounds cool right? No. That’s a bit stupid IMO. Here’s my reaction when reading the project page: Meadow is the world’s first, modern, secure, professional IoT platform. Hum??? It combines the best of all worlds; it has the power of RaspberryPi, the computing factor of an Arduino No, thi&hellip;", "Hello, 0x00ers! As you may have heard me talk about before, I am a strong advocate of using labs and CTF platforms for learning to hack and learning the skills involved in performing pentests from day to day. I believe they’re a great way to learn new skills, practice and validate your enumeration&hellip;", "There’s a list of known-to-be-vulnerable devices at https://aliasrobotics.com/bounties.htm#rvdp. We’d advise to start from those robots and contribute with additional vulns (chances are there will be many more).", "Do you have any recommendations on products to start doing hardware reversing?", "This is actually better than the book I’m reading on ASM. Now I understand most of the things that I was missing. Thanks for writing this, it’s really really helpful", "Okay, so here’s my personal setup. Simple Desktop - Budgie (Gnome based) [Desktop] Simple pop-up terminal (Quake mode) - Tilix  [Popup-Terminal]Using the terminal - Tilix (compiling gdc - gcc based D compiler)  [Terminal]Email - Evolution (fully working PGP setup - sign/encryption)  [E&hellip;", "Since I haven’t been so active in the past few months because of my lack of time, I’m coming back with some new knowledge to spread around. The 0x00sec drone is on the way to be accomplished right? So why not understand how drones generally work and even build your own. Disclaimer: All the informat&hellip;", "I’m in your IRC pic… lololololol. Anyways, pretty dope setup right there. Might just give Arch a go again, but meh… might not either. I have a lot of shit atm that I need to backup first.", "I’m in your IRC pic… lololololol. Anyways, pretty dope setup right there. Might just give Arch a go again, but meh… might not either. I have a lot of shit atm that I need to backup first.", "Since some people asked me for the config, here it is. Be sure to change the home button image with your Avatar, or other image you might feel like, and to add the css provided to your Custom CSS section. I also have several Plugins, which may have some minor impact on look. You probably can fin&hellip;", "Thank you! I can share the config if you want.", "Thank you! I can share the config if you want.", "Okay, so here’s my personal setup. Simple Desktop - Budgie (Gnome based) [Desktop] Simple pop-up terminal (Quake mode) - Tilix  [Popup-Terminal]Using the terminal - Tilix (compiling gdc - gcc based D compiler)  [Terminal]Email - Evolution (fully working PGP setup - sign/encryption)  [E&hellip;", "Thank you! I can share the config if you want.", "Nice dude! I love your discord!", "Okay, so here’s my personal setup. Simple Desktop - Budgie (Gnome based) [Desktop] Simple pop-up terminal (Quake mode) - Tilix  [Popup-Terminal]Using the terminal - Tilix (compiling gdc - gcc based D compiler)  [Terminal]Email - Evolution (fully working PGP setup - sign/encryption)  [E&hellip;", "Okay, so here’s my personal setup. Simple Desktop - Budgie (Gnome based) [Desktop] Simple pop-up terminal (Quake mode) - Tilix  [Popup-Terminal]Using the terminal - Tilix (compiling gdc - gcc based D compiler)  [Terminal]Email - Evolution (fully working PGP setup - sign/encryption)  [E&hellip;", "Okay, so here’s my personal setup. Simple Desktop - Budgie (Gnome based) [Desktop] Simple pop-up terminal (Quake mode) - Tilix  [Popup-Terminal]Using the terminal - Tilix (compiling gdc - gcc based D compiler)  [Terminal]Email - Evolution (fully working PGP setup - sign/encryption)  [E&hellip;", "It was a request from @pry0cc in his topic. You’re right. The most of the people could handle that. But it’s also important to show the real beginners how to get it.", "Just curious, is it really needed a topic for this? I would think most people here could handle that.", "Just curious, is it really needed a topic for this? I would think most people here could handle that.", "Okay, so here’s my personal setup. Simple Desktop - Budgie (Gnome based) [Desktop] Simple pop-up terminal (Quake mode) - Tilix  [Popup-Terminal]Using the terminal - Tilix (compiling gdc - gcc based D compiler)  [Terminal]Email - Evolution (fully working PGP setup - sign/encryption)  [E&hellip;", "Okay, so here’s my personal setup. Simple Desktop - Budgie (Gnome based) [Desktop] Simple pop-up terminal (Quake mode) - Tilix  [Popup-Terminal]Using the terminal - Tilix (compiling gdc - gcc based D compiler)  [Terminal]Email - Evolution (fully working PGP setup - sign/encryption)  [E&hellip;", "CoinHiveOkay, we have talked in the past about mining for CoinHive in the terminal. The only option presented was to run chromium in headless mode. I just found a project on github that implements the CoinHive API in Node.js making a fully fledge application to mine XMR. It has a nice UI (still ter&hellip;", "PrefaceThis quick article will give a short introduction on what fuzzers are, how they work and how to properly setup the afl - american fuzzy lop fuzzer to find flaws in arbitrary projects. Well known alternatives to afl (for the same or other purposes): boofuzz: Network Protocol Fuzzing for Hu&hellip;", "Do you have any particular goal? If not, you should just learn what you feel like. Learn what makes you feel good. If you do have a particular goal, you should point it out so we can give more specific advice .", "I thought this was pretty funny.  [25%20AM]", "I agree with FFY00 if you don’t have any particular goal , just keep going and learn what do you love", "yahh i love reverse engineering , Malware , Exploit dev and hardware stuff", "Do you have any particular goal? If not, you should just learn what you feel like. Learn what makes you feel good. If you do have a particular goal, you should point it out so we can give more specific advice .", "Why do people need to make everything so 1337? That only makes you look bad.", "Ok, so I’ve solved it but I’m not too sure how much information you actually want so I guess I will just split it into two spoiler tags  What does the binary want from me?A quick look into the binary tells you that it reads in 33 characters  (32 actual characters and the last one as a terminato&hellip;", "Hey, I have been reverse engeneering the protocol from my SteelSeries Rival 310. You can find my work here. I would also like to reverse engineer the firmware of the mouse because there are still things I don’t understand. I have the firmware files that I have extracted from the official driver (the&hellip;", "There is nothing wrong with being yourself but modifying a kali distro doesn’t really need its own tutorial. And to be fair, this IS the kind of tutorial you would see on l33t h4x0r sites like hackforums and the like. Also, I didn’t see a tutorial anywhere on this thread, just screenshots and a link&hellip;", "In case it wasn’t clear, I was trying to say that I am sorry. So, I am sorry. I wasn’t trying to offend you. If you have anything you want to say to me, please come by the irc. Thanks, FFY00", "this is exactly why I hate people and society…i try to be myself and do something nice and this is the result", "I didn’t meant it like that. It did came out a bit aggresive and negative, but that was not what I was trying to do.", "I think you should keep your negative ass comment to yourself …first off second … I am sorry that’s just my style nobody told me you were the sole judge and jury on whats 1337 and whats not…lol third … not everything needs to be as plain as white bread and not everything is cli so again keep your&hellip;", "Why do people need to make everything so 1337? That only makes you look bad.", "The book looks great. Yes biting the bullet and spending time on a Windows box and clicking away through the GUI seems like a must. The obscured nature of Windows internals and GUI vs CLI oriented thing is a good point also.", "The book looks great. Yes biting the bullet and spending time on a Windows box and clicking away through the GUI seems like a must. The obscured nature of Windows internals and GUI vs CLI oriented thing is a good point also.", "I think there a not a lot of write-ups/tutorials for windows because most of the linux users don’t want to put up with all of the microsoft bullshit. If you want to get started with windows command line, a batch tutorial would work. After that you may want to learn a bit of powershell. For the other&hellip;", "I think there a not a lot of write-ups/tutorials for windows because most of the linux users don’t want to put up with all of the microsoft bullshit. If you want to get started with windows command line, a batch tutorial would work. After that you may want to learn a bit of powershell. For the other&hellip;", "Knowledge is Power But like all power, there are those who want to keep it for themselves but em not one of them. I was feeling bored and I start checking my bookmarks and I found these linked in my bookmarks so I thought I should make a list and share with others because knowledge should be free .&hellip;", "Thanks! I actually knew about Azeria Labs but totally forgot. I was also watching this videos on the Cortex-M architecture https://www.youtube.com/channel/UCB_pO4oDYxxbsRPZ-5RluAA.", "@_py   I’m not that good with ARM actually. @Wunkolo seems to know a lot more than me. (I can also really recommend GPATEK and Tonc for learning ARM as the GBA kinda forces you to use normal ARM and THUMBS as the different memory regions have different IO sizes, I’ve just experimented with it a li&hellip;", "Sounds like an idea. I haven’t been able to join the irc at all lately though for some reason but I’m up for making some little challenges based in ARM.", "Thumb code is just one of the facets of the ARM arch so it might be hard to find a book or discipline around just Thumb code in particular. Thumb is just a subset of sorts for an ARM processor so once you learn the ARM side of things, you’ll find that Thumb code is just one particular feature of mos&hellip;", "Thanks! That was definitely helpful! Do you know some good books (or other resources) on ARM, more particularly, Thumb? I have messed a bit with x86 binaries and those are easy to understand because you have an entry point. I am interested in reverse engineering more physical devices like this but I&hellip;", "Thanks! That was definitely helpful! Do you know some good books (or other resources) on ARM, more particularly, Thumb? I have messed a bit with x86 binaries and those are easy to understand because you have an entry point. I am interested in reverse engineering more physical devices like this but I&hellip;", "I managed to open the 1.33 firmware file just fine in IDA Pro after reading the data-sheet and knowing where certain addresses should be mapped to. Here’s the datasheet for the STM32F103 Check out the memory map of Section 4 to give you some insight on the address space so you’ll know where to map&hellip;", "Hey, I have been reverse engeneering the protocol from my SteelSeries Rival 310. You can find my work here. I would also like to reverse engineer the firmware of the mouse because there are still things I don’t understand. I have the firmware files that I have extracted from the official driver (the&hellip;", "I want to see some write-ups, i am still learning in the area of reversing and love reading write-ups about ctf’s", "So it’s been a while since I last wrote an article and I think it’s time for a new one. Since the straight forward smash stacking has already been covered plenty, I decided to start this serie with ret2libc. It is assumed that you already understand the normal exploiting techniques, so make sure y&hellip;", "I have always wanted to dive a bit deeper into how to linux kernel internals work. To do this I figured a good starting point would be to create a small proof of concept rootkit! You can find the code for the rootkit on github https://github.com/jordan9001/superhide. This is a very simple rootkit. &hellip;", "This isn’t going to be specifically about OpenBSD, because without taking Linux in comparison, you’ll miss details on how things have turned out to be. I have been spending some time lately following what the situation is on the BSD front and in the Linux community, and I apologise in advance if I h&hellip;", "Maybe coinhive’s API?", "I have yet to discover why that bug occurs. Sometimes refreshing the page fixes it.", "Looks like the leaderboard isn’t updatiing my score.", "CoinHiveOkay, we have talked in the past about mining for CoinHive in the terminal. The only option presented was to run chromium in headless mode. I just found a project on github that implements the CoinHive API in Node.js making a fully fledge application to mine XMR. It has a nice UI (still ter&hellip;", "Yes, I think that would be cool. I don’t know if we can modify the pool in CoinHive’s script easily but it would be a good idea to keep the browser miner available.", "CoinHiveOkay, we have talked in the past about mining for CoinHive in the terminal. The only option presented was to run chromium in headless mode. I just found a project on github that implements the CoinHive API in Node.js making a fully fledge application to mine XMR. It has a nice UI (still ter&hellip;", "Yes, I think that would be cool. I don’t know if we can modify the pool in CoinHive’s script easily but it would be a good idea to keep the browser miner available.", "Nice man! I am doing it right now and it works a treat. Since I am on arch, the only dependency I had to install was lib32-gconf About the pools, once we’ve reached our payout, could we modify the existing in-browser to use another pool? I think it would be cool to start our own mining pool, eithe&hellip;", "CoinHiveOkay, we have talked in the past about mining for CoinHive in the terminal. The only option presented was to run chromium in headless mode. I just found a project on github that implements the CoinHive API in Node.js making a fully fledge application to mine XMR. It has a nice UI (still ter&hellip;", "CoinHiveOkay, we have talked in the past about mining for CoinHive in the terminal. The only option presented was to run chromium in headless mode. I just found a project on github that implements the CoinHive API in Node.js making a fully fledge application to mine XMR. It has a nice UI (still ter&hellip;", "I don’t get that either but according to this analysis from 2013 of browser password managers: When a Firefox profile is first created, a random key called an SDR key and a salt are created and stored in a file called “key3.db”. This key and salt are used in the 3DES (DES-EDE-CBC) algorithm to enc&hellip;", "oops, had old ff in mind. thing is, why 3des and not aes?", "Why on Earth would it still use 3DES!?!?!", "yes it is, you just need to set a master password. please don’t make any claims without information. “Firefox uses triple DES in CBC mode with Master Password”", "hint: it’s not encrypted", "I only use Firefox’s encrypted password manager.", "I only use Firefox’s encrypted password manager.", "basically it’s a command to change the root directory used in the shell. you can install a full linux sytem with a directory", "yes, you can run debian with chroot", "true. but it’s made for arch or debian, so still needs porting. look at the code. It’s arch commands, i’m using arch so i know", "and you can always setup a full linux environement with chroot like kali nethunter", "(self-promo mode on) @FFY00 and @7ri_pl3 in case you miss it.  (self-promo mode off)", "That’s why you have busybox.", "you got arch or debian on your android? it’s got a hell of commands that android doesn’t even support. Would need porting, if even possible at all.", "(Yawn) Morning once again. Valentine here with another Nmap tutorial. This time I’m gonna talk about Scripts in Nmap. Scripts in Nmap are probably one of my favorite features. Not only can they figure out the users on the system but also bruteforce the password. I discovered these scripts not to lo&hellip;", "Cool! Since it’s all in bash, it should be able to run in android.", "So we all want it, a server type coinhive miner that doesnt need a browser and to do this we need to figure out how to create our own copy of its networking and hashing protocols, So i have taken the liberty to format the miner script as best i can as well as start finding where the hell the socket &hellip;", "Yes, I’ve seen that too. That’s not any information related to the real pool, that’s regarding the CoinHive’s API. The only way to make the miner run natively with CoinHive would be to edit a miner to implement the CoinHive API which is just too much work. Instead it would be easier just to mine in &hellip;", "The pool is behind CoinHive API, you never get direct access to it.", "i think that you either get the pool by logging into the coinhive network ‘API’ or the pool IS coinhive", "Yes, I’ve seen that too. That’s not any information related to the real pool, that’s regarding the CoinHive’s API. The only way to make the miner run natively with CoinHive would be to edit a miner to implement the CoinHive API which is just too much work. Instead it would be easier just to mine in &hellip;", "iv been digging around the js code for a bit but i dont know much about javascript and havent found out for defanate what the http connection headers are like but i was able to dig out some interesting things like the Params for the headers var params={site_key:this._siteKey,type:&quot;anonymous&hellip;", "You’re right. But it’s better than nothing. The thing is, if we get a real pool, we need a lot of people in it, or else it will be a waste of power.", "You’re right. But it’s better than nothing. The thing is, if we get a real pool, we need a lot of people in it, or else it will be a waste of power.", "This still wont be optimized for performance. Maybe we can get a real pool.", "This still wont be optimized for performance. Maybe we can get a real pool.", "Running and Mining from CoinHive in the Linux Command LineAs you may be aware, 0x00sec has begun offering Monero Mining in the browser via Javascript. If you’re like me, you have some server somewhere that can happily take the load, but it’s headless, and you don’t want to be leaving a web browser &hellip;", "Yeah, that would be cool. I’ve been minig for supportxmr.", "Yeah, that would be cool. I’ve been minig for supportxmr.", "Spreadshirt doesn’t have hats that that are printed. I have no issue with people getting them custom made.", "Hum, that’s not very different from what I’ll be running. Do you have discord or other similar app from communication? If you have discord, you can add me FFY00#1854.", "Hardware: Dell optiplex x2usrp b210moto g5 plusSoftware: OpenAirInterface EPCSRSeNBUbuntu 16.04 running 4.10 - low latency kernelSo the optiplex’s are my EPC and eNB machines and the moto is my test UE. Right now the EPC and eNB are connected by a straight ethernet connection, but becaus&hellip;", "Cool! What’s your current setup (hardware/software)? When my LimeSDR ships (8~10 days) I will use OpenAirInterface to attempt this.", "Yeah I’ve got a fully working 5G LTE base station running. I’ve just been trying to optimize it and make it a viable testbed for network experiments.", "talk to pry0cc he really should get some added to the store.", "how much for an hat?", "Oh, that’s interesting. Have you had any success? I’m going to university next year.", "I am a lab assistant for a wireless system research group at my university. I’ve mainly been working on setting up and optimizing a LTE network lately.", "Thanks but andrewback I’ll test once they receive one of the final version boards. We should get the graph of the performance across the spectrum before the boards start to be shipped. But what do you do for work?", "I am getting one of these in work so I should be able to test anything you would want to know after it arrives.", "Thanks, I had a quick look and it looks great.", "Okay, we just got an update about the matching networks present in the device. There will be 2 sets of networks (two for Tx and two for Rx). They should match High and Low bands. I’m more optimistic about this but I still recommend to wait until we get information about the actual performance. In th&hellip;", "Here", "Hey, can someone point me to some books (or other resources) on the Windows API? I feel the need to create custom exploitation tools for windows (ex. a mimikatz like program with uac bypass) but I’m not really familiarized with the API. I have already read some of Gerg Hoglund’s book, “Rootkits: Sub&hellip;", "Usually Radio applications are achieved by an real circuit inside the device. For example, the radio you have in your car. It has a circuit which will do FM demodulation. The analog radio signal will be supplied in the input and then the circuit will convert it to data, in this case audio. The diffe&hellip;", "Usually Radio applications are achieved by an real circuit inside the device. For example, the radio you have in your car. It has a circuit which will do FM demodulation. The analog radio signal will be supplied in the input and then the circuit will convert it to data, in this case audio. The diffe&hellip;", "Usually Radio applications are achieved by an real circuit inside the device. For example, the radio you have in your car. It has a circuit which will do FM demodulation. The analog radio signal will be supplied in the input and then the circuit will convert it to data, in this case audio. The diffe&hellip;", "Usually Radio applications are achieved by an real circuit inside the device. For example, the radio you have in your car. It has a circuit which will do FM demodulation. The analog radio signal will be supplied in the input and then the circuit will convert it to data, in this case audio. The diffe&hellip;", "Usually Radio applications are achieved by an real circuit inside the device. For example, the radio you have in your car. It has a circuit which will do FM demodulation. The analog radio signal will be supplied in the input and then the circuit will convert it to data, in this case audio. The diffe&hellip;", "I’m still waiting for my full-sized LimeSDR board to ship. It’s scheduled for September 30. The LimeSDR Mini looks really cool. The main problem is that the FPGA only has 16k PLG. Also, one of the problems is that it only has one set of matching networks and I don’t think It’s great if you want to g&hellip;", "Added the defcon media server link.", "I’ll contribute with radio stuff. I’m just waiting for my LimeSDR to ship.", "I would go with one of the drone controllers, I don’t know the complexity of the used protocol but it shouldn’t that hard. The NRF24L01is also pretty good.", "@FFY00 Thanks for your answer! Well, what I meant was - which device (HC-12, NRF24L01, RadioLink T8FB, Turnigy 6X) should be easier to hack", "I would go with one of the drone controllers, I don’t know the complexity of the used protocol but it shouldn’t that hard. The NRF24L01is also pretty good.", "@FFY00 Thanks for your answer! Well, what I meant was - which device (HC-12, NRF24L01, RadioLink T8FB, Turnigy 6X) should be easier to hack", "Thanks @_py , there’s so much going on right now, exams and such, that I haven’t had the time to be active. @afiskon , the LimeSDR documentation is not fancy at all because the team hadn’t had much time to work on it, but it will get you started and working properly, no worries. If you need more he&hellip;", "I recently have been playing around with Msfvenom and found that you can actually inject a payload inside an already legitimate .APK file. You can do this by downloading the app using a third party site, lets say we downloaded Youtube’s app or something. Say you wanted to set up a reverse TCP shell &hellip;", "I’m not an expert in Deep Learning or Neural Networks but from my experience, using ReLU as an activation, instead of sigmoid, results in more acurate results. The more non-linear the function is the mode descriminative the model is.", "@FFY00 is your guy for SDR, though he hasn’t been active lately.", "https://ghostbin.com/paste/6kho7 https://pastebin.com/BMb543G9 On July 5, 2015, Hacking Team’s Twitter account was compromised by an unknown assailant who ended up publishing 400GB of data including alleged e-mails, invoices, and source code of the company. Zero days for Adobe Flash( CVE-2015-5119&hellip;", "This would be really interesting! That’s something I would definitely read.", "Thanks @_py , there’s so much going on right now, exams and such, that I haven’t had the time to be active. @afiskon , the LimeSDR documentation is not fancy at all because the team hadn’t had much time to work on it, but it will get you started and working properly, no worries. If you need more he&hellip;", "@FFY00 is your guy for SDR, though he hasn’t been active lately.", "Add this method to the setup and remove the first delay. The method will wait til teensy is detected as a keyboard, this will save you some time. Original Code: https://github.com/samyk/usbdriveby/blob/master/usbdriveby_windows.ino void waitForDrivers()        {            while (!(keyboard_leds&hellip;", "I’ve just seen your code and I think you should make the most server sided you can. You’re relying on javascript to do most of the work which make it hackable. If you need something just text me.", "I didn’t though of that from that prespective, I guess you’re kinda right.", "Firstly. We are not relying on JavaScript to do most of the work. We have a backend (PHP), to do server side functions, and then the front-end (JavaScript) to do client side functions. The compartmentalisation is sound. Since it’s using the backend as an API it would be possible to write a CLI clie&hellip;", "I’ve just seen your code and I think you should make the most server sided you can. You’re relying on javascript to do most of the work which make it hackable. If you need something just text me.", "We are having shell acess here, which means we have already hacked the site, We have to make it more client side to make it look less suspicious. (You did’t want to add files that can conform your attack. Did’t you  )", "We are having shell acess here, which means we have already hacked the site, We have to make it more client side to make it look less suspicious. (You did’t want to add files that can conform your attack. Did’t you  )", "I’ve just seen your code and I think you should make the most server sided you can. You’re relying on javascript to do most of the work which make it hackable. If you need something just text me.", "This is actually better than the book I’m reading on ASM. Now I understand most of the things that I was missing. Thanks for writing this, it’s really really helpful", "Since 0x00sec’s conception, 0x00sec has relied entirely on the wallets of the admins, as well as the donations from kind people in the community for funding. Starting today, the new official sponsor of 0x00sec is Sequoia Cyber Solutions!  [Sequoia]These guys are doing some really great things wit&hellip;", "This looks very interesting. Will definitely try to install gnuradio 3.6 with it.", "Yesterday, I joined the 0x00sec IRC channel and, as many other times, @dtm come up with an interesting concept… and I had to try. The idea was pretty challenging and I have not completely come up with a full implementation but I manage to get a minimal Proof of Concept program to illustrate the conc&hellip;", "TOR… I only use a VPN over TOR if it is blocked on the websites I’m trying to access.", "Nice! I haven’t used qubes before. I’ve heard it’s good though?", "My setup is primarily qubes-os with i3wm. In qubes I use to setup a whonix gateway vm and a kali (or other distro) vm.", "My setup is primarily qubes-os with i3wm. In qubes I use to setup a whonix gateway vm and a kali (or other distro) vm.", "0x00sec has used Cloudflare for a while; mainly for security reasons. Cloudflare is great. And it’s secure as well. But one thing is a little annoying. Captchas. I use Tor on a daily basis, and the two biggest problems with Tor are Exit Nodes and Captcha’s, Exit nodes have been notorious for runnin&hellip;", "Alright! After receiving positive responses to my proposal, I’m ready to start this [C] Dynamic Memory series. Here are some suggested prerequisites: Basic Understanding of Imperative ProgrammingBasic C Programming KnowledgeConfidence with PointersAnd what pointers representWhether or no&hellip;", "Hello, my 0x00’ers! You may have noticed @0x00pf’s awesome reverse engineering content, and you may have noticed he has posted raw binaries (without source), now, of course, it’s reverse engineering, the challenge is about not knowing the source. But how do you and I know that @0x00pf is not a mad &hellip;", "Hey mates, today I’ve got a much more interesting challenge for you to solve . We’ll reverse a CrackMe and expand our skills in MSIL Patching to dump the unpacked executable straight from within the program. This will be much more complicated than our copy &amp; paste solution from last time but when y&hellip;", "Never heard of it before but it seems to be really cool . I’ll have a look at it within the next few days!", "I usually use dnSpy, it’s an upgraded version of ILSpy", "I usually use dnSpy, it’s an upgraded version of ILSpy", "Do you know your Android phone have a shell?. Do you know that it is a reduced version of busybox?. Do you know you can recompile it and add some important missing applets? If you don’t, keep reading. This is gonna be quick and easy! NOTE: This a rewrite of something I wrote some time ago for othe&hellip;", "If you had read Part II of this series you may have missed a couple of details. Consider this post as a short addendum to Part II including those details. The first you may have noted is that there was no ARM or MIPS code in there. Actually, the paper was already quite long and, to be honest, I tho&hellip;", "This is actually better than the book I’m reading on ASM. Now I understand most of the things that I was missing. Thanks for writing this, it’s really really helpful", "Glad to see you have come back to this humble course. Hope you are eager to get a lot more stuff to digest. Grab some coffee and relax. I have been claiming that this course is going to be different to all those that you find over the Internet. Right now, I should introduce a whole bunch of boring &hellip;", "This is actually better than the book I’m reading on ASM. Now I understand most of the things that I was missing. Thanks for writing this, it’s really really helpful", "This is actually better than the book I’m reading on ASM. Now I understand most of the things that I was missing. Thanks for writing this, it’s really really helpful", "This is actually better than the book I’m reading on ASM. Now I understand most of the things that I was missing. Thanks for writing this, it’s really really helpful", "If you are reading this is because you want to be a hacker. Therefore, you are automatically a wannabe. It does not sound that cool, but it is actually pretty cool. It means that you still have a lot of exciting things to discover!!! First things first. This is going to be a joint course on C and a&hellip;", "As it doesn’t look that @dtm is going to cover linux stuff, I have wrote a quick and dirty version of the great PE File Infector paper from @dtm but targeting ELF binaries specifically under GNU/Linux systems. The process I will describe is slightly different from the one explained in the PE counte&hellip;", "Add this method to the setup and remove the first delay. The method will wait til teensy is detected as a keyboard, this will save you some time. Original Code: https://github.com/samyk/usbdriveby/blob/master/usbdriveby_windows.ino void waitForDrivers()        {            while (!(keyboard_leds&hellip;", "Yeah, I will do when I have some time.", "I’ve already done this with the Teensy 3.2 You should check this also: https://github.com/samyk/usbdriveby", "I’ve already done this with the Teensy 3.2 You should check this also: https://github.com/samyk/usbdriveby", "Yeah, I will do when I have some time.", "Yeah, I will do when I have some time.", "Sounds interesting! If you don’t mind, you could write a post about it!", "@SmartOne not quite. I didn’t use the teensy to do the same thing than you but I used the same concept.", "Hi @FFY00, Just want to ensure you didn’t get me wrong  My idea was to check if any plugged-in USB has the Phison microcontroller and the overwrite it with the BadUSB firmware. Did you accomplish this?", "I’ve already done this with the Teensy 3.2 You should check this also: https://github.com/samyk/usbdriveby", "Good trick… I’ll try", "Add this method to the setup and remove the first delay. The method will wait til teensy is detected as a keyboard, this will save you some time. Original Code: https://github.com/samyk/usbdriveby/blob/master/usbdriveby_windows.ino void waitForDrivers()        {            while (!(keyboard_leds&hellip;", "Add this method to the setup and remove the first delay. The method will wait til teensy is detected as a keyboard, this will save you some time. Original Code: https://github.com/samyk/usbdriveby/blob/master/usbdriveby_windows.ino void waitForDrivers()        {            while (!(keyboard_leds&hellip;", "I’ve already done this with the Teensy 3.2 You should check this also: https://github.com/samyk/usbdriveby"]}