{"user": "hasp0t", "history": ["Hey guys, I’ve been lurking here for a few months and finally decided to join… and the first Weekly HTB challenge is for the box that I co-wrote! Initial access is fairly easy, privesc is pretty difficult. I would strongly advise not reading the forums on HTB about Waldo, they are very spoilery las&hellip;", "A few weeks ago the HackTheBox 0x00sec team was created and since then no less than 38 of our fine members have joined. In that time we have rocketed up to 113th place on the team leader-board (from 350th). This is no small accomplishment. I do, however, think we can do even better and get on the To&hellip;", "Welcome to the inaugural Leap Security and 0x00sec CTF!! We have teamed up with the guys at Leap Security to bring you this challenging fun-filled event. The CTF has no limitations on participants as it is open to anyone (no registration required) – think of it as our gift back to the community!  [&hellip;", "Awesome job @pry0cc. I will try to be more active since I’m the owner of the channel on IRC. Also, join #htb.", "Woah, big news! Thanks a lot @pry0cc for making this possible  I’ve been absent for some weeks finishing my master’s thesis. I’ll try to catch up with HTB as soon as I have some time to spare.", "Woah, big news! Thanks a lot @pry0cc for making this possible  I’ve been absent for some weeks finishing my master’s thesis. I’ll try to catch up with HTB as soon as I have some time to spare.", "Woah, big news! Thanks a lot @pry0cc for making this possible  I’ve been absent for some weeks finishing my master’s thesis. I’ll try to catch up with HTB as soon as I have some time to spare.", "I like it except as a college student I don’t have a lot of time to play around… I just wish I had more time.", "Hello, 0x00ers! As you may have heard me talk about before, I am a strong advocate of using labs and CTF platforms for learning to hack and learning the skills involved in performing pentests from day to day. I believe they’re a great way to learn new skills, practice and validate your enumeration&hellip;", "Sure it is! There may be dead hours but eventually someone will pop up", "Sure it is! There may be dead hours but eventually someone will pop up", "Sure it is! There may be dead hours but eventually someone will pop up", "Okay, so here’s my personal setup. Simple Desktop - Budgie (Gnome based) [Desktop] Simple pop-up terminal (Quake mode) - Tilix  [Popup-Terminal]Using the terminal - Tilix (compiling gdc - gcc based D compiler)  [Terminal]Email - Evolution (fully working PGP setup - sign/encryption)  [E&hellip;", "What’s up, everyone? This tutorial will show you how to configure your own vulnerable CTF server manually. There exist some scripts which do this job for you but it’s much better when you understand why these vulnerabilities work.  Before we start I recommend you document every change/step. Write &hellip;", "I don’t know who you’re replying to, but since I created the thread, I’ll address this. A hackers setup is something that they show off. Is it serious? No. Is it fun? Yeah! It’s like putting stickers on your laptop. It gives you some sort of individuality with your setup, right down to the experien&hellip;", "##– What is the “Penny”-Guide? – With this guide I want to help the newbies who wants to enter the world of IT-Security and give them a picture which is (in my opinion) essential to understand that it’s much harder than you think. There is a lot of theory and much more practice behind it. ##– My &hellip;", "If you guys get any other tricks, please let me know, we can improve and perfect it, and forgive my poor english. type 1: keywordsexec(&#39;import os ;os.system(&quot;ls&quot;)&#39;)eval(&#39;__import__(&quot;os&quot;).system(&quot;ls&quot;)&#39;)f&#39;&#39;&#39;{__import__(&#39;os&#39;).system(&#39;ls&#39;)}&#39;&#39;&#39;[].__class__.__mro__[-1].__subclasses__()_builtin__.op&hellip;", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "OSINT 0x02 - LinkedIn is not just for jobsSup 0x00’ers, that’s right, I am back with another banger of an article, ready? If you read my last article on OSINT, you’ll know a little bit on how to find dirt on companies, their assets, and how to do all of that passively. Well now I am going to show &hellip;", "Or your math homework. Or anything, really. Z3’s rad.  What is Z3?Z3 is an open-source theorem prover by Microsoft (yes, seriously). In layman’s terms, you can give it any mathematically expressable problem and it will tell you if there is a solution for it and what the solution is. It’s not only &hellip;", "OSINT - Passive Recon and Passive Discovery Of AssetsSup 0x00’ers, to kick this badass series off, I am going to begin with the most important aspect of pentesting. Passive Recon and OSINT. Now, do not let the word ‘passive’ fool you. This is no light recon, you can uncover vast amounts of infomati&hellip;", "Hi 0x00’ers! If you had seen the last ‘show off your setup’ thread, Show off your setup! You’ll notice it was a huge success, and there was a tonne of beautiful systems and setups. Since it was a little while ago and a lot of people have already renewed their existing setup, got new hardware, jump&hellip;", "Oh, it looks like you have so many links in your post that my poor browser was not able to expand them fast enough.", "Ok here is my setup! I run ArchLinux with the i3 tiling window manager. This is configured by myself using a very heavily modified version of OxHak’s config. I am using conky for the top bar. My anonymity setup is fairly simple. I have a collection of VPN’s and I connect to a different one every da&hellip;", "This is my solution to the Vuln OS 2 challenge by c4b3rw0lf. Let’s get started: We were not provided with any logon credentials for the VM so I could not simply login to check the IP address of the target machine (unless I cheated by altering grub). So, the first step was finding the IP address.  &hellip;", "This is my solution to the Tr0ll: 1 challenge by Maleus. The challenge and his webpage can be found here: https://www.vulnhub.com/entry/tr0ll-1,100/ Tr0ll was inspired by the constant trolling of the machines within the OSCP labs. The goal is simple, gain root and get Proof.txt from the /root &hellip;", "In the name of Allah, the most beneficent, the most merciful. Hello everyone, i’ll be writing how it was expected for the tasks I made to be solved.  I finally found some free time, sorry for the late post. So, this article will be splitted to two main parts: I. babyheap II. left I. babyheap&hellip;", "#Preface In this paper we will create a very basic Linux Keylogger. Keylogging is the action of recording every key pressed by the user on a keyboard. Typically this action happens without the user being aware of it, which gives the hacker the opportunity to catch usernames and/or passwords. Our ke&hellip;", "Time to step up the game. Keep in mind there is more than one way to solve it. Good luck. RulesFeel free to pwn the binary on Ubuntu 16.04 or 17.04. Extra credits if you pwn it on 17.04. Don’t ask me for hints. Hints will only be given 1 month after the challenge’s release as long as there a&hellip;", "IntroductionHello folks, I hope you’re doing great! Today’s topic will be once again heap exploitation related. In fact, we’ll be going over the recent updates of glibc’s heap allocator, (pt)malloc, which I’ve researched/reversed lately and decided to present them to you since there is barely any i&hellip;", "There was the following menu as I described: Welcome to your TeamManager (TM)!0.- Exit1.- Add player2.- Remove player3.- Select player4.- Edit player5.- Show player6.- Show teamYour choice:When you enter the choice number, atoi is used behind the scenes to convert your input into an actua&hellip;", "Shuffled Love (you need to register) was one of the Linux 64bits reverse challenges available to be solved during the recent 0x00Sec CTF Winter 2017 edition. This challenge was intended to be easy and at the end 42 persons were able to solve it. Before continuing, I’d like to say that there are man&hellip;", "#Preface In this paper we will create a very basic Linux Keylogger. Keylogging is the action of recording every key pressed by the user on a keyboard. Typically this action happens without the user being aware of it, which gives the hacker the opportunity to catch usernames and/or passwords. Our ke&hellip;", "Hi 0x00’ers, and all those that took part in 0x00ctf 2017! First off, we want to thank all of our challenge creators, admins, and participants. CTFs are a great opportunity for us as a community to sharpen our skills, challenge ourselves and each other with new problems, and meet new people who sha&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "If you are confused about character devices and major/minor numbers like I was after reading this, I found this helpful article: http://derekmolloy.ie/writing-a-linux-kernel-module-part-2-a-character-device", "#Preface In this paper we will create a very basic Linux Keylogger. Keylogging is the action of recording every key pressed by the user on a keyboard. Typically this action happens without the user being aware of it, which gives the hacker the opportunity to catch usernames and/or passwords. Our ke&hellip;", "#Preface In this paper we will create a very basic Linux Keylogger. Keylogging is the action of recording every key pressed by the user on a keyboard. Typically this action happens without the user being aware of it, which gives the hacker the opportunity to catch usernames and/or passwords. Our ke&hellip;", "You are right. If you don’t read the contents of the device file first and the user enters 1024 characters, the logged data will be lost. This example was used for demonstration purposes. Further work should be done in order to keep data without loosing any. Maybe dynamically allocate kernel memory &hellip;", "The keys pressed are identified in 3 different and consecutive levels: Scancodes: The lower level. Is the raw data that the keyboard will send to the kernel. The kernel, depending on the keyboard layout configured, will convert this scancodes to keycodes.Keycodes: Second level. This doesn’t repr&hellip;", "You are right. If you don’t read the contents of the device file first and the user enters 1024 characters, the logged data will be lost. This example was used for demonstration purposes. Further work should be done in order to keep data without loosing any. Maybe dynamically allocate kernel memory &hellip;", "The keys pressed are identified in 3 different and consecutive levels: Scancodes: The lower level. Is the raw data that the keyboard will send to the kernel. The kernel, depending on the keyboard layout configured, will convert this scancodes to keycodes.Keycodes: Second level. This doesn’t repr&hellip;", "Question: If we wipe the buffer in keys_pressed, are we potentially losing some data if it’s not written to the file in dev_read first? Great tut. Enjoyed it a lot.", "#Preface In this paper we will create a very basic Linux Keylogger. Keylogging is the action of recording every key pressed by the user on a keyboard. Typically this action happens without the user being aware of it, which gives the hacker the opportunity to catch usernames and/or passwords. Our ke&hellip;", "#Preface In this paper we will create a very basic Linux Keylogger. Keylogging is the action of recording every key pressed by the user on a keyboard. Typically this action happens without the user being aware of it, which gives the hacker the opportunity to catch usernames and/or passwords. Our ke&hellip;", "It’s awesome to see your first article @hasp0t! I really enjoyed reading through this. I do know however have some questions for you. I see that you are only logging ASCII printable characters, and that is all dandy, as long as somebody is typing everything correctly, but what occurs when somebody&hellip;", "#Preface In this paper we will create a very basic Linux Keylogger. Keylogging is the action of recording every key pressed by the user on a keyboard. Typically this action happens without the user being aware of it, which gives the hacker the opportunity to catch usernames and/or passwords. Our ke&hellip;", "#Preface In this paper we will create a very basic Linux Keylogger. Keylogging is the action of recording every key pressed by the user on a keyboard. Typically this action happens without the user being aware of it, which gives the hacker the opportunity to catch usernames and/or passwords. Our ke&hellip;", "#Preface In this paper we will create a very basic Linux Keylogger. Keylogging is the action of recording every key pressed by the user on a keyboard. Typically this action happens without the user being aware of it, which gives the hacker the opportunity to catch usernames and/or passwords. Our ke&hellip;", "I have always wanted to dive a bit deeper into how to linux kernel internals work. To do this I figured a good starting point would be to create a small proof of concept rootkit! You can find the code for the rootkit on github https://github.com/jordan9001/superhide. This is a very simple rootkit. &hellip;", "If you make an account, and get a 403 or 500 error message, just click the profile tab, it throws up and error but works fine. Ignore it for now, we’ll fix it soon.", "Hello nullers, Retr1 here. I have a suggestion today for the admins (@pry0cc, @oaktree, @IoTh1nkN0t, @_py, @fraq). Thread closingAs a matter of fact, our staff team has decided to discourage necrobumping. And rightfully so, don’t get me wrong. However, I believe that closing the specific thread is&hellip;", "Hi, I hope I’m still in time to give an answer to this challenge! I really had a good time solving it  I have a working KeyGen in python, let me know if you want a writeup about how I got it! Here are my examples: my name is p3rla - 6b79246c5f6d692c6777247c3f7e6865 myfirstsolvedchallenge:) - 6b&hellip;", "Hi, I hope I’m still in time to give an answer to this challenge! I really had a good time solving it  I have a working KeyGen in python, let me know if you want a writeup about how I got it! Here are my examples: my name is p3rla - 6b79246c5f6d692c6777247c3f7e6865 myfirstsolvedchallenge:) - 6b&hellip;", "Well done @p3rla! Glad to hear you liked it! As I said to @Noswis, please go ahead publishing your keygen and write up. To all other 0x00sec members… just hurry up, I’ll stop granting   Tier-0 Challenger Solver badges when a solution (keygen or write-up) is publicly posted!.. You still can get yo&hellip;", "Hi, I hope I’m still in time to give an answer to this challenge! I really had a good time solving it  I have a working KeyGen in python, let me know if you want a writeup about how I got it! Here are my examples: my name is p3rla - 6b79246c5f6d692c6777247c3f7e6865 myfirstsolvedchallenge:) - 6b&hellip;", "Hey, I’m a bit late to the party but I finally got some working serials here!  The next thing I’m working on is getting a serial for any arbitrary string automatically using a keygen.  Perhaps I’ll even do a little writup of the process if people are interested in how I got the serials. Anyways, tha&hellip;", "Hello folks! I hope you’re all doing great! Since there’s a plethora of reversing/crackme challenges on 0x00sec, it’s time to step up the game with some binary exploitation one since that happens to be my favorite field as well. ###Difficulty Average ###Objective Get a shell. ###Rules ASLR&hellip;", "Hey, pwntools developer here! Here’s some additional pro tips you may want to integrate into your blog payload = str(foo)payload += pack(bar)payload += bazCan be collapsed down into a single statement with the flat() function. payload = flat(foo, bar, baz)Integers are passed to pack, string&hellip;", "Nice write-up @exploit! For those who don’t quite get the theory behind that technique, I’d highly recommend reading the reference links. TL;DR - When a signal occurs, the kernel “pauses” the process’s execution in order to jump to a signal handler routine. In order to safely resume the execution &hellip;", "Hoodies are cool. 0x00sec is cool. You know what is even cooler? 0x00sec Hoodies.We get it, you’re a badass, and you love hacking + computers. But you would look even more badass with one of these bad boys. [image][image]Do you want something more understated? Okay. We gotcha.  [image] [i&hellip;", "You are overwriting only the return address. ROP gadgets are missing. Are you sure you’re leaking a legit libc address? Where do you return after the leak? Doesn’t look like you’re returning to the right place. Why did you hardcore the address of bin/sh? ASLR should be on. Below is @exploit’s P&hellip;", "A leak in binary exploitation is basically 85% of the pwning process. A leak is practically achieved by leveraging the functionality of the binary in order to get value(s) back from it. One of the simplest and probably the most common way of leaking data is by ROP-ing to a function which prints som&hellip;", "Hello! Can you give me a hint on how to leak an address? Once I get the leak, I’m pretty sure I’ll be able to exploit it. Thank you very much for the challenge! Learning a lot", "Hello! Can you give me a hint on how to leak an address? Once I get the leak, I’m pretty sure I’ll be able to exploit it. Thank you very much for the challenge! Learning a lot", "Hello 0x00ers! Recently, we have added new badges to the site that are awarded to people who solve the challenges posted here. Currently, these badges are: Tier 0 Challenge SolverTier 1 Challenge SolverMore will be added when enough people earn these badges… – @oaktree", "###Solving a Heap exploitation challenge  In the name of Allah, the most beneficent, the most merciful. Thanks to @_py and @n0tnu11  who encouraged me, to write about such thing… I want to say sorry, cause i don’t write alot more articles, you know guys, studies … It wasn’t easy for me to&hellip;", "lol [image]", "Hello folks! I hope you’re doing great. This is my first ever CTF write-up yay! During the last couple of weeks, @IoTh1nkN0t, @dtm, @kowalski and myself, took part in picoCTF. It’s an “entry-level” CTF, which practically means, it’s made for CTF rookies! Well, you needed a little bit of experience &hellip;", "Cryptography is an ancient mathematical science that was originally used for military communications, and designed to conceal the contents of a message should it fall into the hands of the enemy. Recent developments in cryptography have added additional uses, including mechanisms for authenticating &hellip;", "Thank you very much for you response! You are actually right, I’m mixing 32bit and 64bit. I’ll take a look at these articles", "Thank you very much for you response! You are actually right, I’m mixing 32bit and 64bit. I’ll take a look at these articles", "Hi @p3rla, Thanks for following the tutorial and for your feedback.I have seen that happening some time ago. As far as I remember it  happens when you mix up 32bits and 64bits code. In those cases you need to do some extra work to invoke the system call. I’m not sure if I took notes from those test&hellip;", "Hi there! I’m new around here. I tried to follow this tutorial and it sort of worked out. It generates the shell but immediately after it finishes the child process (which is /bin/dash), why is that? Thanks!", "Hello peeps! Been a while. I hope you’re all doing great. This write-up was supposed to be up way sooner to be honest. Recently, @oaktree coded an IRC bot with dynamic linking features which motivated me to finally take the initiative and finish this god damn paper. So without further ado, @oaktree &hellip;"]}