{"user": "hiepdang", "history": ["Hey folks! this topic details how to overflow a buffer, bypass DEP (Data Execution Prevention) and take control of the executable Recommended PrerequisitesC/C++ language, a basic level would be finex86 Intel AssemblyFamiliarity with Buffer OverflowDebuggers/DisassemblyThe binaryFile Virust&hellip;", "#Introduction Hi everyone ! Today, we will start to making the malware application for the Android OS, before you begin with this tutorial. If you want to be confortable with the tutorial you should have some basic knowledge of Java/Android programming ( class, method, permission). If you don’t un&hellip;", "DISCLAIMER: Article originally published on immunIT. Hi fellas, Today, I will introduce you to a new tool, developed for the sake of one of my pentesting engagement, named XIP. XIP claims to provide an efficient way to generate a list of IP addresses, using a set of mutations, in order to bypas&hellip;", "Thanks for nice tutorial!", "Thanks for nice tutorial!", "Clientside Exploitation - Tricks of the Trade 0x01 - Sharpshooter + SquibblyTwoHi! I hope you’re well, today I am going to show you something that is common knowledge in the red teaming community, people use this kind of thing every day without thinking about it. However, if you’re new to security,&hellip;", "Here’s all the malware I’ve been collecting from my honeypot. Enjoy the Park! [image]", "Time to step up the game. Keep in mind there is more than one way to solve it. Good luck. RulesFeel free to pwn the binary on Ubuntu 16.04 or 17.04. Extra credits if you pwn it on 17.04. Don’t ask me for hints. Hints will only be given 1 month after the challenge’s release as long as there a&hellip;", "Just create a account and send a PM to @0x6e756c6c on here or on the IRC.", "Just create a account and send a PM to @0x6e756c6c on here or on the IRC.", "Greetings my fellow hackers, As we continue with our series, the AMUNET app becomes complicated with new functionalities and structures to understand. We’ll sail right through. As stated earlier in previous tutorials, the app doesn’t fully exists because I build them before I share so forgive me if&hellip;", "Greetings my fellow hackers, As we continue with our series, the AMUNET app becomes complicated with new functionalities and structures to understand. We’ll sail right through. As stated earlier in previous tutorials, the app doesn’t fully exists because I build them before I share so forgive me if&hellip;", "is there any slot for me?", "EDIT, For up-to-date information on connecting to IRC: https://0x00sec.org/faq#irc Not sure if this is where I should post this, but couldn’t really pick an appropriate sub category of how-to and figured that this was best to be seen by every 0x00sec member as soon as they join so they can be part &hellip;", "This weekend we participated in Whitehatvn Grandprix CTF and this is one of the 2 real challenges we managed to solve. Big thanks to @L0k1 for executing exploit while challenge was officially down, getting us flag quicker (and for being help in brainstorming). Description: manhndd is running a s&hellip;", "We now have a newly created 0x00sec team on HackTheBox. Direct message me on 0x00sec or join #htb on IRC and leave a message with the regulars if you want to be added to the team. Notes: You cannot join more than one team on HTBThere is zero entry requirements to join our team. Just being an 0x&hellip;"]}