{"user": "hkh4cks", "history": ["I’m happy to share my code and open to any improvements. miniOS Feel free to contribute", "I’m happy to share my code and open to any improvements. miniOS Feel free to contribute", "What’s up boys &amp; girls? Before we enter the world of pentesting, first of all we have to prepare for that. It’s important to know how to learn. The reason for this is the quantity of the information you will collect and you have to work with. Furthermore it’s important to structure your thoughts, n&hellip;", "Great cheatsheet  My go  to command for sqlmap is $ sqlmap --level 5 --depth 3 --dump-allTakes fair amount of time TBH, but does the job", "Guess it’s time for me to join in and push for the conquest of i3 (@Evalion). [obligatory “I use Arch Linux”]  [image] I’m very proud of my terminal.  It’s Termite with oh-my-zsh, tmux, powerline.  Colors are from terminal.sexy, collection/trim-yer-beard.  Powerline configs have been modified to &hellip;", "@pry0cc true  about HackTheBox!!", "@pry0cc true  about HackTheBox!!", "They do. But I’ve got plenty of Ram and CPU resources.", "They do. But I’ve got plenty of Ram and CPU resources.", "On arch linux, which packages do you use for slack and discord? The one built with Electron? Don’t they take up lot of CPU resources?", "PrefaceA file inclusion vulnerability is a type of vulnerability that is most commonly found to affect web applications that rely on a scripting run time. This issue is caused when an application builds a path to executable code using an attacker-controlled variable in a way that allows the attac&hellip;", "Great cheatsheet  My go  to command for sqlmap is $ sqlmap --level 5 --depth 3 --dump-allTakes fair amount of time TBH, but does the job", "Awesome write-up man!! This was a great machine!!", "This is my write-up for the Calamity machine provided by HackTheBox and created by forGP. To get root you are required to write a custom exploit that re-enables data execution on the stack and to know how to dance around in memory like a boss. I’m still a little hazy on some parts so if there are a&hellip;", "Awesome write-up man!! This was a great machine!!", "As @SmartOne suggested. It would be really cool to have a wiki with useful links. Simply edit this topic and away you go! Blogs Security blog(s) overviewPenetration Testing Blog by @hkh4cksNews The Hacker News Security Affairs WIRED (Security Category) SANS Newsletter(s) (For&hellip;", "https://securityonion.net/ About Security Onion Security Onion is a Linux distro for intrusion detection, network security monitoring, and log management. It’s based on Ubuntu and contains Snort, Suricata, Bro, OSSEC, Sguil, Squert, ELSA, Xplico, NetworkMiner, and many other security tools. The ea&hellip;", "#Preface In this paper we will create a very basic Linux Keylogger. Keylogging is the action of recording every key pressed by the user on a keyboard. Typically this action happens without the user being aware of it, which gives the hacker the opportunity to catch usernames and/or passwords. Our ke&hellip;", "Are stickers available? What’s the cost?", "I came accross this pretty good URL scanner called urlscan. It is still in beta but it works pretty good and is accurate and can obtain a lot of information. Plus it is a passive recon tool, meaning you don’t touch the target directly. +5 stealth! Just a quick find I wanted to share https://urlsca&hellip;", "Are stickers available? What’s the cost?", "Hey! A very quick little tutorial here, (really not advanced at all), but may save you a tonne of time. Big scary disclaimer: I don’t advise pirating blah blah, I cannot be held responsible for the billions of dollars of “theft” you do with this. Blah Blah. Don’t sue me. Here’s the deal - You’re a&hellip;", "Hey people! During my learning process I experimented a lot with this VM. In my opinion the vulnerabilities on this VM are pretty simple and you can optimize and improve your methodology on it. On this walkthrough I will show you how I’ll go through without using MSF, Nessus, OpenVAS, etc. For th&hellip;", "Why do you do this, fraq?Occasionally I’ll encounter myself doing something in Linux I don’t do very often and I know other people aren’t doing much as well. When that happens, I try to document the stupid, quirky things I did. Maybe for posterity, maybe because I need a life, I dunno. What is the&hellip;", "Looks like bunch of emojis", "Looks like bunch of emojis", "What is Hacktoberfest?Every year, Digital Ocean and Github partner up to encourage contributions to open-source projects. If you sign up for Hacktoberfest (just sign up, that’s all!) they help you find projects you can contribute to as well as sending you stickers and what-not. If you open 5 pull r&hellip;", "I’m planning to get some issues carved out tonight, so check the repo tomorrow!", "Monero coins", "Monero coins", "What are we mining exactly? I don’t get it…", "What are we mining exactly? I don’t get it…", "Great cheatsheet  My go  to command for sqlmap is $ sqlmap --level 5 --depth 3 --dump-allTakes fair amount of time TBH, but does the job", "Great cheatsheet  My go  to command for sqlmap is $ sqlmap --level 5 --depth 3 --dump-allTakes fair amount of time TBH, but does the job", "Great cheatsheet  My go  to command for sqlmap is $ sqlmap --level 5 --depth 3 --dump-allTakes fair amount of time TBH, but does the job", "Hello all again!It’s been a while since the  Python Package for creating backdoors thingie and all that time I have been researching a way to properly create a stager for a Python backdoor script that has dependencies. *You know stagers! The lil’ things that set the stage for the real thing to run&hellip;", "Is there a way to identify which type of hashing algorithm is used just by looking at the hash value? Plus I have the same question about encoding techniques. Is it possible to identify which encoding technique is used to encode a particular string? If there’s a way, I would like to know how it ca&hellip;", "Hmmm… I think I can put some insight onto this. From my experience, there’s no right exploit or as you ask, which ports are the most vulnerable. If the port is open, it is vulnerable. There’s many exploits for a single service. I use Google along with msf or even 0day which is a great source of kno&hellip;", "Or you could watch few walkthroughs of retired machines to get some idea about how you go about enumerating machines. Walkthroughs by Ippsec is a good source", "Yo, this is a ruby script that randomly/procedurally generates Virtual Box VMs for you to practice hacking on.", "I think the first machine you should try must be Legacy. Then try Lame and then you can decide after that. Hope this helps", "Take a look", "You may take a look at this", "Is there a way to identify which type of hashing algorithm is used just by looking at the hash value? Plus I have the same question about encoding techniques. Is it possible to identify which encoding technique is used to encode a particular string? If there’s a way, I would like to know how it ca&hellip;", "Is there a way to identify which type of hashing algorithm is used just by looking at the hash value? Plus I have the same question about encoding techniques. Is it possible to identify which encoding technique is used to encode a particular string? If there’s a way, I would like to know how it ca&hellip;", "The Cyberlypics is a global CTF (what one isn’t, really?) with a $60 entry fee. The finals are in The Netherlands. Beyond that, it’s nothing too special. We did our pre-challenge challenge last night over some stupid registration stuff.", "Hello NullSec, Joker back with another tool that I wrote today. As the title says this is a portscanner that I’ve decided to code to learn more about packets and how they work. This is a very simple program that basically does a SYN scan. Issue is that most systems would block this type of scan and &hellip;", "Awesome Stuff!! Thanks for sharing", "Awesome Stuff!! Thanks for sharing", "Ok, so I’ve coded a very basic reverse shell that I’ve now decided to allow any member  to access and view the code, but before I post the code I gotta thank @0x00pf for his awesome tutorial and @Joe_Schmoe for  STELF which inspired me to code this shell. I’m trying to add functionality to my shell,&hellip;", "Running Nmap from Chat with LegobotChatops for hackers! For those of you who saw my shenanigans in IRC earlier, this is the promised post on what I was doing. For those who missed it or don’t hang out in IRC, shame! This is an announcement of a new package I released today, description of how to u&hellip;", "The Cyberlypics is a global CTF (what one isn’t, really?) with a $60 entry fee. The finals are in The Netherlands. Beyond that, it’s nothing too special. We did our pre-challenge challenge last night over some stupid registration stuff.", "What is it? I’m new to CyberLympics", "Getting Stealthy with StelfHello 0x00’ers! In this tutorial, I am going to be giving away some content that has been sought after for a long time. Everybody knows that most prebuilt tools such as Metasploit don’t work, payloads generated by them, or encoders used with them. They get picked up by a&hellip;", "Hey, guys (and gals)! Long time no see. I &#39;ve been working hard on several projects and stuff lately so I was just an observer all that time. Observing this page and several projects starting on github, I was really impressed with how many backdoor projects are being created. I remember reading a&hellip;", "I recently have been playing around with Msfvenom and found that you can actually inject a payload inside an already legitimate .APK file. You can do this by downloading the app using a third party site, lets say we downloaded Youtube’s app or something. Say you wanted to set up a reverse TCP shell &hellip;", "As @pry0cc insisted that I create a post on how I manually signed a apk file in my post. As requested, here it is. Although please see this link here which is the reference that I used for my so called 1337 hax. Before I begin, what you’ll need is: MetasploitMsfvenomPayloadkeytooljarsignerA b&hellip;", "Hey guys my name is Adam and I am brand new to the area of linux and pentesting in general. I am starting my journey in pentesting by learning linux and some of the tools that pen testers use. I came across this site while looking for labs to do online and thought I would share it. If it has alread&hellip;", "Realmode Assembly - Writing bootable stuff - Part 3Part 3: Building &amp; RunningWhat is this?This is going to be a walk-through in writing an Operation System in assembly which operates purely in Realmode. Goal will be writing different kernels from a simple “Hello World” over small terminal progr&hellip;", "Realmode Assembly - Writing bootable stuff - Part 3Part 3: Building &amp; RunningWhat is this?This is going to be a walk-through in writing an Operation System in assembly which operates purely in Realmode. Goal will be writing different kernels from a simple “Hello World” over small terminal progr&hellip;", "Hello, I am not a low-level guy but I thought this will be a good link to share and a lot of you may get interested in this. I will keep sharing such link if you all want.", "Learned so many things from this writeup. Thanks @Leeky I’m still very new to RE, but I understood almost everything from this writeup", "Learned so many things from this writeup. Thanks @Leeky I’m still very new to RE, but I understood almost everything from this writeup", "#0x00sec CTF Writeup - Forward then ReverseSo yeah, I finally got time to write a writeup for @Deshi’s CTF but I sadly only have stuff written down for the RE challenge (mainly because the other stuff I solved was pretty easy and didn’t require more than a quick google search or simple stuff like &hellip;", "For Pentesting, a lot of corporate networks are going to be using Windows Server at some point in their stack. Usually a domain controller or even just a samba file share. Thus, my post-exploitation skill in the windows environment is woefully subpar when compared with Linux. I think a live CTF on &hellip;", "I’d say being able to set up our own, members-only lab environment would be incredible, and push the community to another level. It would facilitate more(and different) CTF events, teach people about Windows(Linux is drastically over represented), etc.", "Would love to solve Windows CTFs. And would also love to learn more about it from the experts.", "Morning folks. I know its been a while since ive posted here, life has been crazy,  and my company just agreed on a takeover of another blue team company,  so I’ve been dealing with all that fun legal stuff. Id like the communities input on something.  I’ve been speaking to my Microsoft rep for th&hellip;", "Reverse Engineering and Crackme challengesThis topic is an aggregation of Crackme and reverse engineering challenges developed for 0x00sec. Please discuss the challenges in the thread they were originally posted or on IRC in #challenges This curation is based entirely on my own whim and not a comp&hellip;", "This has nothing to do with crackmes. This field is called exploit development. Though you need reverse engineering knowledge, exploit dev steps it up way more because you have to find bugs by reading assembly. That being said, exploit dev is a mindset, but you can learn the basic-beginner metholog&hellip;", "@_py are there any tutorials to learn it? I’m really interested in such problems. And also crack me problems… Does it come under exploit development?", "Hello 0x00’ers! @zSec gave us the idea to make a Wiki with working services for things such as email relays, SMS spoofing and the like. Feel free to edit this and add things you have tried and tested. The more we add in useful things, with a very quick way to access them, the more useful this page w&hellip;", "I want to extend it further. But it’s just difficult and time consuming for me to do it alone", "I want to extend it further. But it’s just difficult and time consuming for me to do it alone", "Interesting stuff there! I never messed with protected mode before but I see lots of familiar code.   I also see that you are working with both C and Assembly which is apparently quite common but I’ve never messed with that either (as I mainly did real mode assembly to get into x86 assembly). Is th&hellip;", "Interesting stuff there! I never messed with protected mode before but I see lots of familiar code.   I also see that you are working with both C and Assembly which is apparently quite common but I’ve never messed with that either (as I mainly did real mode assembly to get into x86 assembly). Is th&hellip;", "I’m happy to share my code and open to any improvements. miniOS Feel free to contribute", "I’m happy to share my code and open to any improvements. miniOS Feel free to contribute", "I’m happy that you enjoyed it! The next parts that I’ve planned will be about How to Run/Build it and Writing a small input/output console kernel. I haven’t messed with the Interrupt Service Routines that much yet, only ever written a custom keyboard handler with it, I’m very interested in your co&hellip;", "Great tutorial. I’ve completed this part.  Also I’ve implemented ISR and IRQ. I would like to know what’s next!", "Great tutorial. I’ve completed this part.  Also I’ve implemented ISR and IRQ. I would like to know what’s next!", "I’ve modified the exploit as needed (at least it’s the right way)  Change payload from .ps1 file so that it executes our exe to get a reverse shell as admin", "No. Not yet  Stay tuned…", "No. Not yet  Stay tuned…", "Are stickers available? What’s the cost?", "Hi everyone ! Hope you’re all doing well. So today I will show you how you can build your own virtual lab ( For malware analysis or pentest lab ), in this Tutorial I will use proxmox who is an Open Source Server solution. Table of contentWhy ProxmoxDownloading ProxmoxUpload the iso Why Proxm&hellip;", "Maybe I will do another tutorial about : How to make a Malware Lab Machine under proxmoxHow to create an Enterprise networkThis can be helpful", "I’ve modified the exploit as needed (at least it’s the right way)  Change payload from .ps1 file so that it executes our exe to get a reverse shell as admin", "I haven’t gotten a root shell on optimum yet. But someone on Slack told me you have to modify the exploit, he did not say which, but im conficent it’s this one. If anyone else has rooted optimum, please chime in.", "Loading powershell  from meterpreter was new to me. Although I’m getting the following output and it stops: [+] Command execution completed: __ __ ___ ___   ___     ___ ___ ___ |  V  |  |  | |  ||   |  |  | |     |_  || || . || | |  |  | ||||||_|   |___|___|___|                [by b33f -&gt; @&hellip;", "I just tried running PS on Optimum without problems. I got reverse meterpreter shell. Loaded powershell. Uploaded script straight to disk(no memory tricks) Ran from meterpreter: Powershell_execute “Import-Module C:\\Users\\kostas\\test\\script.ps1; Invoke-XXXXX”", "Try with iex and load &gt; run from memory", "Did the exact thing for many times… No luck whatsoever I get no output when I run it.", "Try with &quot;powershell.exe -Executionpolicy bypass -Noprofile -File &quot;path\\to\\script.ps1&quot; Or you could use iex and load the script in memory and execute, that usually works around the executionpolicy if i remember correctly… Edit: Take a look at this: https://www.fireeye.com/content/dam/fireeye-www/g&hellip;", "I read both the articles. It helped to increase my knowledge. But unfortunately didn’t solve the purpose. I’m still unable to perform Priv Esc. Found an exploit though, but it’s not working as expected. I’m not able to run powershell using -executionpolicy bypass rule", "Please don’t post solutions / walkthroughs. I STRONGLY recommend everyone to read this: https://www.hackthebox.eu/en/home/rules Especially Rule 7. I think it’s not fair to participate in such an awesome learning experience, that is - on top of that - offered for FREE and then shit all over their &hellip;", "Yeah, PrivEsc is a bitch on those machines. There’s a machine that’s very similar to Optimum (in the way you get a shell) - don’t remember the name rn - but you will have even LOWER privileges than on Optimum. I’ll just leave this here, maybe you can give me a tip on how to get system once you’ve &hellip;", "I haven’t done OPTIMUM myself, but here is two great links for Windows priv esc http://www.fuzzysecurity.com/tutorials/16.html https://pentest.blog/windows-privilege-escalation-methods-for-pentesters/", "I haven’t done OPTIMUM myself, but here is two great links for Windows priv esc http://www.fuzzysecurity.com/tutorials/16.html https://pentest.blog/windows-privilege-escalation-methods-for-pentesters/", "How do I escalate privilege on Windows 2012 R2 (Build 9600)? I’m working on OPTIMUM machine and I have owned the user (which was easy) Payload:  windows/meterpreter/reverse_tcp When I try to use getsystem, I get  [-] priv_elevate_getsystem: Operation failed: The environment is incorrect. The f&hellip;", "Thanks @unh0lys0da for the tutorial, found it nice and clear. Just wanted to say for anyone on a 64bit system(which is surely most of us by now?) you can still compile and link everything as 32 bit like so: nasm -f elf -o shell.o shell.asm &lt;&lt; no change here ld -m elf_i386 -o shell shell.o &lt;&lt; use &hellip;", "I would like to participate as well. It’d be great if someone adds me to their team Thanks", "As promised, here is the shellcode tutorial once again RequirementsAlright so this isn’t going to be msfvenom tutorial. (shellcodes are payloads). This tutorial will focus on writing shellcodes using Assembly. Knowledge of C and Assembly is highly recommend. Also knowing how the stack works is a&hellip;", "Hi fellas, A few days ago, I decided to start my adventure in the reverse engineering domain. I was quickly overwhelmed by a bunch of information and op codes that confused me a lot, even with solid knowledge in assembly and programming. Reverse engineering can seem complex at the first glance, ho&hellip;", "(post withdrawn by author, will be automatically deleted in 24 hours unless flagged)", "I DO AGREE. Oh My ZSH is bae.", "Imagine this: You’re a pentester. A long-lost relative has left you a fortune in his will. To keep the money, you have to fulfill just one wish: spend it all on tech (from Amazon, because then you’d be buying a beer or some server time for 0x00sec while still getting some cool stuff for yourself). I&hellip;"]}