{"user": "jl3", "history": ["[image]", "PwnWiki have a goodcommand list too… i always refer to it… pwnwiki.io Linux Privesc", "Sneaky one, hello world", "Sneaky one, hello world", "This can be good if cronjobs are presents, checking for new processes #!/bin/bashIFS=$&#39;\\n&#39;old=$(ps -eo command)while true; do        new=$(ps -eo command)        diff &lt;(echo &quot;$old&quot;) &lt;(echo &quot;$new&quot;)        sleep 1        old=$newdone", "This can be good if cronjobs are presents, checking for new processes #!/bin/bashIFS=$&#39;\\n&#39;old=$(ps -eo command)while true; do        new=$(ps -eo command)        diff &lt;(echo &quot;$old&quot;) &lt;(echo &quot;$new&quot;)        sleep 1        old=$newdone", "Rooted it, hit me up on IRC if you need a push in the right direction", "The hard truth. Well said.", "Again people waste their time to customize their system instead of learning how systems work. When their system was customized as they wanted it to be, they open a bunch of C or Python code, look at that bunch of code and it makes them happy and makes feel like they’re really true-hackers. You spen&hellip;", "Well to my knowledge it’s installed on all major distros. Guess the exception is RHEL/CentOS and a lot of servers run that. So you have definitely made the right decision. Great work!", "reminds me of the early 00’s when ryan1918 was around, we had pretty much huge chunks of ‘plug n play’ type code that noobs were just slapping together and running. (he was arrested btw, and the scene moved on) I think a project like this should help move security forward, it may not be the “pc” wa&hellip;", "Well to my knowledge it’s installed on all major distros. Guess the exception is RHEL/CentOS and a lot of servers run that. So you have definitely made the right decision. Great work!", "Awesome project man, looking forward to reading your writeup! But what’s the reason you went for python2 instead of 3?", "Good question - support for python3 may be implemented in the future, and my reasoning for choosing python2 may be flawed, so please let me know if I have over-looked something. One goal I had for this project was for it to “just work” without needing to install/configure anything - so basically th&hellip;", "If you guys get any other tricks, please let me know, we can improve and perfect it, and forgive my poor english. type 1: keywordsexec(&#39;import os ;os.system(&quot;ls&quot;)&#39;)eval(&#39;__import__(&quot;os&quot;).system(&quot;ls&quot;)&#39;)f&#39;&#39;&#39;{__import__(&#39;os&#39;).system(&#39;ls&#39;)}&#39;&#39;&#39;[].__class__.__mro__[-1].__subclasses__()_builtin__.op&hellip;", "Awesome project man, looking forward to reading your writeup! But what’s the reason you went for python2 instead of 3?", "https://github.com/colental/byob Built this to teach myself Python. Any thoughts?", "Glad to hear you’re interested in it man - I’m getting started on a write-up now!", "[2018-07-22-151915_1920x1080_scrot]Solarized + suckless", "Thank you! good job", "Of course, it’s not that much configured. Like to keep it simple and minimal. dotfiles", "[2018-07-22-151915_1920x1080_scrot]Solarized + suckless", "Could you share config files?", "To kickstart this, I am going to share my setup: This is the imgur album if you wish to peruse, but I am going to post it below anyway:                                                                                  [Album] This is Croc0, and this is my i3wm setup.                          &hellip;", "[2018-07-22-151915_1920x1080_scrot]Solarized + suckless", "[2018-07-22-151915_1920x1080_scrot]Solarized + suckless", "[2018-07-22-151915_1920x1080_scrot]Solarized + suckless"]}