{"user": "Joe_Schmoe", "history": ["Performing a MITM attack on the .NETGuard desktop applicationAuthors:Washi, 766F6964 Abstract:Code obfuscation is a method of preventing third parties from reverse engineering the inner workings of software. One cloud-based service that provides this kind of protection for .NET applications is .&hellip;", "Welcome back to Knowing NullKnowing Null is a series of interviews randomly conducted on the 0x00sec IRC server and compiled here for your convenience. Today’s guest is the ever present pry0cc! But, first, a poll! Who do you want to see next time?fraqdtmricksanchezzSecsprtn0x00pfPhoenix&hellip;", "I run macOS High Sierra (Hackintosh), I like the graphics of the Apple Operating System                       [image]           I usually work with 5 workspaces (Browser, Terminal, Music, VM, Communication)                       [image]           I use iTerm 2 as terminal and Fish as shell&hellip;", "Welcome to the first Knowing Null interview, a serious randomly conducted on the 0x00sec IRC server and compiled here for your convenience. Today’s guest is non other than 0x00sec’s premier benefactor, l0k1! But! Before we jump in, who do you want to see next?suserfraqpry0ccricksanchez0&hellip;", "Hello again! The results of the poll from my last post are very clear, so I’ve decided to go forward with the “Intro to Digital Forensics” topic Like I previously mentioned, this post will cover various topics regarding Digital Forensics, hopefully serving as a good introduction to the field. I’m n&hellip;", "Greetings my fellow hackers, In the previous tutorial Introduction to Amunet , we learnt Amunet would be a spying Android App. I wouldn’t waste much time as I’ll get straight to the point. In this tutorial, we will only collect installed applications and their associated information but not send t&hellip;", "Hey folks! this topic details how to overflow a buffer, bypass DEP (Data Execution Prevention) and take control of the executable Recommended PrerequisitesC/C++ language, a basic level would be finex86 Intel AssemblyFamiliarity with Buffer OverflowDebuggers/DisassemblyThe binaryFile Virust&hellip;", "Or your math homework. Or anything, really. Z3’s rad.  What is Z3?Z3 is an open-source theorem prover by Microsoft (yes, seriously). In layman’s terms, you can give it any mathematically expressable problem and it will tell you if there is a solution for it and what the solution is. It’s not only &hellip;", "Use send() instead of sr1().", "Use send() instead of sr1().", "OSINT 0x02 - LinkedIn is not just for jobsSup 0x00’ers, that’s right, I am back with another banger of an article, ready? If you read my last article on OSINT, you’ll know a little bit on how to find dirt on companies, their assets, and how to do all of that passively. Well now I am going to show &hellip;", "Use send() instead of sr1().", "IntroSecond write-up here; this is something I just happened upon today while (super) bored at work.  I’m not a math/algorithm nerd by any means, but I did find this pretty fascinating.  This will walk you through what I found and how I moved forward with it. If anyone knows of an official name fo&hellip;", "It’s for when we want to practice MITM", "Like i clearly said…remove my profile/account and all my threads and info", "IntroductionIt was 7:20 pm on my small city, I just buyed a new computer so I was installing Kali, and browsing Vulnhub for a cool and fast CTF.  I stumbled upon a CTF called DEFCON Toronto: Galhad it’s difficulty was on easy, so I guessed It was time for me to play a little.  Warning: EVERYTHI&hellip;", "I managed to open the 1.33 firmware file just fine in IDA Pro after reading the data-sheet and knowing where certain addresses should be mapped to. Here’s the datasheet for the STM32F103 Check out the memory map of Section 4 to give you some insight on the address space so you’ll know where to map&hellip;", "DISCLAIMER: Article originally published on immunIT. Hi fellas, Today, I will introduce you a new tool, developed for the sake of my penetration testing activities, named Drupwn which claims to provide a reliable and efficient way to perform enumerations on Drupal web applications. You may thin&hellip;", "That’s the hard part. You can compile a static, dependency-free tor executable which might be difficult. A quick google search yielded this, could be a good place to start. After you get that onto the victim system, you’ll have to execute it and not get caught by AV. Afterwards, connect through the &hellip;", "Then How would I force victim to use Tor ?", "So a hidden service is exactly what you want to use to stay anonymous. All connections go through the Tor network so your victim won’t be able to tell where your shell is actually connecting.", "Portmapping is not a problem for me The problem is that I don’t want any direct connection to avoid having my ip uncovered, That’s why I put an effort in playing with Ngrok. The victim always connect to Ngrok server and Ngrok server sends to me this connection. But this way Ngrok can see my ip, So,&hellip;", "I don’t know how to help you with ngrok, but why not skip it entirely and set up a Tor Hidden Service? You won’t need to port forward (which I assume is why you are using ngrok) and you won’t have to expose your IP for your shell to connect to. Although, setting up a Tor proxy on the victim machine &hellip;", "I don’t know how to help you with ngrok, but why not skip it entirely and set up a Tor Hidden Service? You won’t need to port forward (which I assume is why you are using ngrok) and you won’t have to expose your IP for your shell to connect to. Although, setting up a Tor proxy on the victim machine &hellip;", "You can also use PyInstaller or py2exe or Nuitka (personally PyInstaller fared very well) to turn your scripts into an executable. However, the executables are very large, in tens of megabytes, compared to e.g. Meterpreter, which is about a megabyte. You also lose out on stealth and using the winapi&hellip;", "Yo, this is a ruby script that randomly/procedurally generates Virtual Box VMs for you to practice hacking on.", "It’s like you didn’t read OP at all.", "It’s like you didn’t read OP at all.", "You can also use PyInstaller or py2exe or Nuitka (personally PyInstaller fared very well) to turn your scripts into an executable. However, the executables are very large, in tens of megabytes, compared to e.g. Meterpreter, which is about a megabyte. You also lose out on stealth and using the winapi&hellip;", "Honestly, I don’t think any legit, serious hacker uses Python RATs and not to offend you or anything but just because you can build something in language X does not mean you should use it. Hell, I can build malware in Brainfuck but it doesn’t mean that I should. “Use the right tool for the right job&hellip;", "I have little experience with python, but… I think you’d benefit from looking at STELF’s source code on gitlab, specifically the compile script. This is a older version of STELF, but @Joe_Schmoe  also has stelfier which is Python converted to C version of STELF. Hopefully this helps you out… Happy&hellip;", "This is my solution to the Vuln OS 2 challenge by c4b3rw0lf. Let’s get started: We were not provided with any logon credentials for the VM so I could not simply login to check the IP address of the target machine (unless I cheated by altering grub). So, the first step was finding the IP address.  &hellip;", "This is my solution to the Tr0ll: 1 challenge by Maleus. The challenge and his webpage can be found here: https://www.vulnhub.com/entry/tr0ll-1,100/ Tr0ll was inspired by the constant trolling of the machines within the OSCP labs. The goal is simple, gain root and get Proof.txt from the /root &hellip;", "This post is part two of a multi-part series. If you haven’t already, please read part one here: Encrypted Chat: Part I Welcome BackAfter gaining an understanding of the concepts behind my encrypted chat server, we’re now ready to take a closer look at the code to see how the client and server ope&hellip;", "Hello, fellow 0x00’ers! First off, I lied. It’s not a botnet. But it enables you to achieve botnet-like abilities. Today I am going to show you something that has been kept a secret for a long time in the hacker community and has never really been made accessible to the average hobbyist. With this&hellip;", "Would that require a signed certificate? Is it possible that a MitM send you their false, unsigned certificate to pretend to be the server? Unless you know 100% what the legitimate certificate looks like.", "Kind of? The ability to check if you are connected to the correct server and people you are talking to would be nice.", "Is that like fingerprinting or something?", "Nice project. I’d suggest adding a way to verify the identity of people you are chatting with, something like SSL certificates.", "Nice project. I’d suggest adding a way to verify the identity of people you are chatting with, something like SSL certificates.", "The ProjectI started programming an encrypted chat client and server to learn more about encryption and how it’s implemented in network protocols (e.g. SSH or HTTPs over TLS). Now that it’s almost complete, I wanted to share what I learned with you. I’m splitting up this series into two posts. The&hellip;", "Nice project. I’d suggest adding a way to verify the identity of people you are chatting with, something like SSL certificates.", "Endianness is a compression thing. You see, the application that connects you to wifi can predict what the password is supposed to be. You only have to type in the first 6 characters and the last one, and the program will use a PBKDF algorithm (PuBlic Key Derivation Finagler) to generate the charact&hellip;", "Firstly, due to my insane schedule, I do not get to interact with all of you as I would like. Let me take this opportunity to state that many of you are doing incredible work with the content of your posts; I do read just about everything released here on the Big 0; I am proud to be here among such&hellip;", "We Need Hackers Now More Than EverI“Yes, I am a criminal. My crime is that of curiosity.” In the years since The Hacker Manifesto was first typed out, much of the internet has changed. It has grown in both size and scope. New protocols have been invented. The web was born. It is altogether diffe&hellip;", "Hiya, I use x64dbg with the xAnalyzer plugin. As to revealing the serial, I just kinda stepped through the code and it popped up at some point. Got lucky I guess.", "Hiya, I use x64dbg with the xAnalyzer plugin. As to revealing the serial, I just kinda stepped through the code and it popped up at some point. Got lucky I guess.", "Hello, this post seems really really old but hope you will see this and reply. I’m new with re and currently using IDA pro. I’m curious which dissasembler do you use? and how were you able to get decrypt version of license. Since as I understand it encrypts the user input and compares it to deab67dd&hellip;", "PrefaceA file inclusion vulnerability is a type of vulnerability that is most commonly found to affect web applications that rely on a scripting run time. This issue is caused when an application builds a path to executable code using an attacker-controlled variable in a way that allows the attac&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "Nice post. But why would you do this, when you could parse HTML with nokogiri in ruby? Or beautifulsoup in python? This is indeed quick n dirty, and gets the job done, but if you haven’t checked out either of those, I strongly recommend you to check them. Scraping is one of my favourite pass-times.&hellip;", "Write an OS just for playing games, can’t get any more optimized than that", "Write an OS just for playing games, can’t get any more optimized than that", "Don’t backdoor with the whole executable ya silly goose, use msfvenom to create download and execute shellcode (or make your own, wink wink)", "Write an OS just for playing games, can’t get any more optimized than that", "Write an OS just for playing games, can’t get any more optimized than that", "Write an OS just for playing games, can’t get any more optimized than that", "Write an OS just for playing games, can’t get any more optimized than that", "Write an OS just for playing games, can’t get any more optimized than that", "Write an OS just for playing games, can’t get any more optimized than that", "Realmode Assembly - Writing bootable stuffPart 6: Let’s write a small game (1/2)What is this?This is going to be a walk-through in writing an Operation System in assembly which operates purely in Realmode. Goal will be writing different kernels from a simple “Hello World” over small terminal pr&hellip;", "Let’s make a CTF about how many YouTube keyloggers you can take over", "READMEIf your antivirus detects this page as malicious, it is most probably because I have pasted some scripts into the article. Do not be alarmed! IntroductionVery recently I’ve (finally) set up a proper malware analysis VM and so I thought that it would be super fun to download some samples fro&hellip;", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "take two paperclips, plug one end into the powerbank’s usb port and the other into laptop. should not explode into flames too quickly", "I doubt there is a version check. Have you tried debugging it yourself and seeing what is the problem?", "It uses https, xfinity is comcast, one of the largest ISPs in US", "Assuming I understand how logging into the hotspot works, does the login page have https?", "Assuming I understand how logging into the hotspot works, does the login page have https?", "The hardest GNU/Linux reverse engineering in the 0x00sec CTF 2017 event was OBFTEANATION. Only 2 person solved this challenge during the competition, so I guess some of you have been waiting for this write up. I just wrote it to be hard but I didn’t try to solve it myself until now. Of course it is&hellip;", "Shuffled Love (you need to register) was one of the Linux 64bits reverse challenges available to be solved during the recent 0x00Sec CTF Winter 2017 edition. This challenge was intended to be easy and at the end 42 persons were able to solve it. Before continuing, I’d like to say that there are man&hellip;", "Hi 0x00’ers, and all those that took part in 0x00ctf 2017! First off, we want to thank all of our challenge creators, admins, and participants. CTFs are a great opportunity for us as a community to sharpen our skills, challenge ourselves and each other with new problems, and meet new people who sha&hellip;", "12/10 2017 1 - Internet ChemotherapyInternet Chemotherapy was a 13 month project between Nov 2016 - Dec 2017. It has been known under names such as ‘BrickerBot’, ‘bad firmware  upgrade’, ‘ransomware’, ‘large-scale network failure’ and even ‘unprecedented terrorist actions.’ That last one was a lit&hellip;", "I have always wanted to dive a bit deeper into how to linux kernel internals work. To do this I figured a good starting point would be to create a small proof of concept rootkit! You can find the code for the rootkit on github https://github.com/jordan9001/superhide. This is a very simple rootkit. &hellip;", "#0x00ctf 2017Hello fellow nullers and lurkers alike, today we are very pleased to announce the biggest 0x00sec CTF of 2017! 0x00ctf will have challenges focussed mainly on Pwning and Reverse Engineering. timedatectl&gt;&gt; 12:30pm December 15th 2017 UTC-50x00ctf will begin at 12:30 pm US Eastern tim&hellip;", "Hello all, I am looking for feedback on my backup finding tool. What is it and what does it do? It’s a Python script that utilizes requests and multiprocessing to concurrently scan a remote file to find a backup of it, given URLs. How does it do it? On a more detailed level, it takes any amount&hellip;", "IntroductionIt has been more than a year since I published the concept of infecting an executable with shellcode here and recently I have been motivated to develop another PoC which follows the same path but at a more advanced level combining knowledge and techniques that I have learned since then.&hellip;", "Looks top neat. How’d you find out about it? Came across while googling for carrot images?", "Same as before, jumped the main dialog box which jumped the entire security cookie script shenanigans. Though found the 2 obfuscated reference points of the Username and Serial long before anything else. Dead end for me! Thanks", "Signed up just to say that I accomplished this; By jumping the loop setup after incorrectly inputting a key Found the initial point of the loop, set to jnz return_equal therefore allowed access. This in turn created the Licence.lic with the key for me with the &#39;accepted key &#39;inside. Not a very ma&hellip;", "I think it’s because there are too many people using the web chat and SOMEONE hasn’t fixed the limits yet", "I think it’s because there are too many people using the web chat and SOMEONE hasn’t fixed the limits yet", "I think it’s because there are too many people using the web chat and SOMEONE hasn’t fixed the limits yet", "Yo, this is a ruby script that randomly/procedurally generates Virtual Box VMs for you to practice hacking on.", "Hello 0x00’ers! As many of you are aware, we are very fortunate to be able to offer 0x00sec as an ad-free service, hopefully forever. As this community grows, it will eventually require more and more just to keep it running. At the present, we receive a minimal amount from Amazon affiliates, anyti&hellip;", "So recently I’ve been re-motivated to do some more game hacking and I thought that I’d do another article to introduce more aspects on top of what I’ve already shown from my previous ones. In the following document, I’ll be detailing the usage of DLL injection and its advantages, a fundamental conce&hellip;", "Yo, this is a ruby script that randomly/procedurally generates Virtual Box VMs for you to practice hacking on.", "There are a variety of different types of electric motors; However, in this article we’re only going to discuss the two simple rotary types of motors. Those being the AC electric motor and the DC electric motor. The difference between the two being the type of magnet in the outer shell of the motor.&hellip;", "Usually Radio applications are achieved by an real circuit inside the device. For example, the radio you have in your car. It has a circuit which will do FM demodulation. The analog radio signal will be supplied in the input and then the circuit will convert it to data, in this case audio. The diffe&hellip;", "Sup folks! I hope you are all doing great. It’s been a long time since my last CTF write-up. The main reason is because I was trying to master the beast called heap exploitation and I’ve yet to learn a ton about it. To showcase one of the modern ways to pwn a heap-based vulnerable binary, I’ll use a&hellip;", "0x00sec GuidelinesCore PrinciplesActions have consequences.You can learn anything from anyone.Ask good questions, not lazy ones.Everybody makes mistakes.Freedom of information is a right.ForumsWhen posting something on the forums, consider these points. Will this be helpful to users othe&hellip;", "Sorry for necroposting, but as the current code didn’t work for me I thought I would add how I fixed it, in case anybody else comes here after me. The payload, although running and passing flow over to _main, made the kernel segfault. The reason being that the CPU state had been corrupted by the sy&hellip;", "This is a ELF infector I wrote while learning NimLang", "yeah fixed… my clipboard has tricked me!", "I think you might have forgotten something here.", "Your traffic can still be de-anonymized even if you take client-side precautions. This involves the 3-letter agencies having 3 nodes that you connect to. That way they have an IP address at the entry node and the data at the exit node and with a little effort they can link the two together. Again it&hellip;", "I think you might have forgotten something here.", "I think you might have forgotten something here.", "Yo, this is a ruby script that randomly/procedurally generates Virtual Box VMs for you to practice hacking on.", "Yo, this is a ruby script that randomly/procedurally generates Virtual Box VMs for you to practice hacking on.", "Greetings, 0x00sec! After much discussion, the 0x00sec mods and admins have put together a new program, a Bounty Program. How it WorksThis very post will be a Wiki. Members will be able to add any topic they’d like to see written about on this site. Other members will see the wiki, scroll through,&hellip;", "Tor has been advertised as an anonymizing network. This will therefore attract a damn lot of shady people, where it has a lot of legitimate users, I can bet that 90%+ of its traffic is for shady purposes. How do a lot of drug dealers, hackers, and other people anonymize themselves? Tor. I would sug&hellip;", "It’s a long-held belief, although not 100% verified, that the NSA has developed a technique for de-anonymyzing traffic being routed through tor. In more recent times, independent researchers have been able to reproduce similar vulnerabilities.", "Why do you think Tor might harm your efforts to hide from the NSA?", "Hi 0x00’ers! Depending on your level of skill, you may be under the impression that using a VPN for all your traffic is a good thing for your privacy, you’ll have been told that using Tor 24/7, or tunneling all your traffic through it may save you from the infamous 3 letter agencies. Whatever crud &hellip;", "Believe it or not i could not find an app which would reboot phone on certain number of failed unlock attempts. Why would anyone want this? To prevent unlocking encrypted devices of course! My setupPhone: galaxy S5 stock rom, rooted and debloated.Encrypt device.Set pattern lock.Set cryptfs pas&hellip;", "Hey Guys, First post here,  I am here to introduce a new aspect of a project I am working on(http://ki.tc). An IP logger with CLI in mind. Now, I have taken an API approach to this, so all calls are JSON dependent. Apart from my introduction, I would appreciate new ideas or rather feedback from th&hellip;", "he actually did it the madman", "Hello NullSec, Joker here with another tutorial or cheatsheet depending on how much in detail I go. This time I am gonna go over one of my favorite tools that I at first overlooked the potential. SQLmap is officially a automatic database takeover tool. I’ve been able to successfully “hack” databases&hellip;", "Continuing the discussion from [Malware Analysis] Case GBC-17_124: The dropper Part I: The get_msg FunctionOur analysis is going pretty well. By now, we know that the get_msg function is the one that gets the data from the network, data that is later dumped into a file. Time to rip it off:       &hellip;", "Cliiiiiickbaaaaaaait", "Cliiiiiickbaaaaaaait", "Can’t you see? I managed to defuse a real nuclear bomb from the famous Dr. von Noizeman.", "Cliiiiiickbaaaaaaait", "Man, those edits were a rollercoaster of emotion", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "he actually did it the madman", "he actually did it the madman", "he actually did it the madman", "Hello all again!It’s been a while since the  Python Package for creating backdoors thingie and all that time I have been researching a way to properly create a stager for a Python backdoor script that has dependencies. *You know stagers! The lil’ things that set the stage for the real thing to run&hellip;", "Hello all again!It’s been a while since the  Python Package for creating backdoors thingie and all that time I have been researching a way to properly create a stager for a Python backdoor script that has dependencies. *You know stagers! The lil’ things that set the stage for the real thing to run&hellip;", "he actually did it the madman", "Hello NullSec, Joker here with another Tutorial. This time I am gonna explain how to crack the password of a SSH which is one of several services that can be cracked with a Password Cracker like Hydra and Medusa. Of course there are other ways to obtain the password like Social Engineering, Exploit,&hellip;", "Yo, this is a ruby script that randomly/procedurally generates Virtual Box VMs for you to practice hacking on.", "Yo, this is a ruby script that randomly/procedurally generates Virtual Box VMs for you to practice hacking on.", "I’m going to chime in on this. For those of you who don’t know me,  I’m L0k1, I run our IRC,  and our Gitlab,  as well as a few other things. I may not be around all the time,  but I’m constantly maintaining stuff.  Before the talks about switching to Discord,  before we had our own IRC,  we were &hellip;", "[image]", "[image]", "Wow, that was fast!  I think I should finally take the time to check out what’s new the IRC", "[image]", "Yo, this is a ruby script that randomly/procedurally generates Virtual Box VMs for you to practice hacking on.", "Me, and a few others have been speaking a lot, and we’ve decided that Discord is a better platform for discussion, as it has more features than IRC, and there are a lot of people who feel much more comfortable using Discord over IRC. EDIT: However, that is not to say that we must all switch to Disc&hellip;", "Yo, this is a ruby script that randomly/procedurally generates Virtual Box VMs for you to practice hacking on.", "Yo, this is a ruby script that randomly/procedurally generates Virtual Box VMs for you to practice hacking on.", "Yo, this is a ruby script that randomly/procedurally generates Virtual Box VMs for you to practice hacking on.", "Yo, this is a ruby script that randomly/procedurally generates Virtual Box VMs for you to practice hacking on.", "Yo, this is a ruby script that randomly/procedurally generates Virtual Box VMs for you to practice hacking on.", "Yo, this is a ruby script that randomly/procedurally generates Virtual Box VMs for you to practice hacking on.", "AFLogical is another methodology that extracts robot devices’ information besides adb. Content suppliers ar employed in this method, saving the extracted information into the device’s American state card. Such information contains contacts, call logs, SMS, transmission electronic communication Servi&hellip;", "I hope the nexter part will be a C compiler for our OS", "I hope the nexter part will be a C compiler for our OS", "Writing in C would kinda defy the assembly part this series is about but I also think that it would be quite interesting. Problem with doing it in real mode is that most compilers don’t support 16bit freestanding output but I have a few compilers to experiment with. So depending on my results with t&hellip;", "I hope the nexter part will be a C compiler for our OS", "I hope the nexter part will be a C compiler for our OS", "Realmode Assembly - Writing bootable stuff - Part 4Part 4: Basic Math OSWhat is this?This is going to be a walk-through in writing an Operation System in assembly which operates purely in Realmode. Goal will be writing different kernels from a simple “Hello World” over small terminal programs t&hellip;", "Hello NullSec, Joker back with another tool that I wrote today. As the title says this is a portscanner that I’ve decided to code to learn more about packets and how they work. This is a very simple program that basically does a SYN scan. Issue is that most systems would block this type of scan and &hellip;", "@Suser thinks I have a good perspective on transitioning from scripting (in my case, Ruby) to programming (in C++). This post deals particularly with Ruby and C++, but some facets are broadly applicable. WhyBefore I list some differences between scripting and programming, I will specify a few rea&hellip;", "Ok, so I’ve coded a very basic reverse shell that I’ve now decided to allow any member  to access and view the code, but before I post the code I gotta thank @0x00pf for his awesome tutorial and @Joe_Schmoe for  STELF which inspired me to code this shell. I’m trying to add functionality to my shell,&hellip;", "Ok, so I’ve coded a very basic reverse shell that I’ve now decided to allow any member  to access and view the code, but before I post the code I gotta thank @0x00pf for his awesome tutorial and @Joe_Schmoe for  STELF which inspired me to code this shell. I’m trying to add functionality to my shell,&hellip;", "###Solving a Heap exploitation challenge  In the name of Allah, the most beneficent, the most merciful. Thanks to @_py and @n0tnu11  who encouraged me, to write about such thing… I want to say sorry, cause i don’t write alot more articles, you know guys, studies … It wasn’t easy for me to&hellip;", "Hi fellas, I found an interesting docker image on Docker Hub, dedicated to TOR hidden service deployement. The README is self explainatory and worth a try.  https://hub.docker.com/r/goldy/tor-hidden-service/ Take your chance to create the new silk road  Best, Nitrax", "Hello guys! I &#39;m in the proud position to announce you that the covertutils Documentation is mostly finished: http://covertutils.readthedocs.io/ There will be constant improvements but the base is ready to give it a read! This Documentation contains a TUTORIAL of course! Create a Backdoor with &hellip;", "Hey @operatorequals o/ For several weeks i was working on project of my own and just posted it on github: Launchpad. It is very much barebones so far. Aim of the project is to create file-less agent that is interacted with through dashboard website. I can totally see your package being VERY useful. &hellip;", "Hey, guys (and gals)! Long time no see. I &#39;ve been working hard on several projects and stuff lately so I was just an observer all that time. Observing this page and several projects starting on github, I was really impressed with how many backdoor projects are being created. I remember reading a&hellip;", "https://ghostbin.com/paste/6kho7 https://pastebin.com/BMb543G9 On July 5, 2015, Hacking Team’s Twitter account was compromised by an unknown assailant who ended up publishing 400GB of data including alleged e-mails, invoices, and source code of the company. Zero days for Adobe Flash( CVE-2015-5119&hellip;", "As @pry0cc insisted that I create a post on how I manually signed a apk file in my post. As requested, here it is. Although please see this link here which is the reference that I used for my so called 1337 hax. Before I begin, what you’ll need is: MetasploitMsfvenomPayloadkeytooljarsignerA b&hellip;", "confusing reverse engineers", "confusing reverse engineers", "confusing reverse engineers", "confusing reverse engineers", "Dynamic Loading of Shared Objects at RuntimeI’ve been doing a lot of tutorials about dynamic stuff. It’s because we trees rustle whenever the wind blows. Anyway, this post comes as an addition to @_py’s Linux Internals - The Art Of Symbol Resolution. This whole thing started when I decided that t&hellip;", "Bah, I already started cracking the old one the proper way  Upon starting, a dialog box shows up, which makes us wait for 5 seconds before the program actually starts. Same thing happens when you try to close it. Let’s find the string “Please wait… 5 seconds”.  [image] It appears two times as &hellip;", "How would you go about letting the DLL  inject itself, without the need for a separate injector? Sorta like meterpreter. Can the DLL read it’s process’ memory and copy itself from there?", "as an alternative to the method above, we also can bruteforce the password by counting the instructions executed which can be done using intel’s pin tool or Linux’s performance analysis tool (perf). this method exploit the fact that the program exits when incorrect character is guessed and executes &hellip;", "There is a parameter argument in CreateRemoteThread that you can use to pass the injected DLL’s module base to the DLL. Using that, it can find its own memory region to reinject itself. EDIT: I’ve modified my TestDLL file to take in the image base as a parameter and here is what it looks like in ac&hellip;", "There is a parameter argument in CreateRemoteThread that you can use to pass the injected DLL’s module base to the DLL. Using that, it can find its own memory region to reinject itself. EDIT: I’ve modified my TestDLL file to take in the image base as a parameter and here is what it looks like in ac&hellip;", "I worded that badly. What I meant is, after the DLL is already injected into some process and running. How can the DLL find itself in the injectee’s memory, read itself and perform reflective injection on another process? Mostly curious about the finding part.", "A DLL is a library, not a standalone executable so you cannot execute it like normal. If I’m correct, there is a potential way to do this which is basically injecting the executable’s memory itself. Of course, this would mean that the DLL code would be part of the main injector at the source level o&hellip;", "How would you go about letting the DLL  inject itself, without the need for a separate injector? Sorta like meterpreter. Can the DLL read it’s process’ memory and copy itself from there?", "Hello, I am not a low-level guy but I thought this will be a good link to share and a lot of you may get interested in this. I will keep sharing such link if you all want.", "I’d say being able to set up our own, members-only lab environment would be incredible, and push the community to another level. It would facilitate more(and different) CTF events, teach people about Windows(Linux is drastically over represented), etc.", "[image]", "[image] [image]", "What a great post! I just started my journey into the INFOSEC field about a month ago. (I’ve been a lurker here for about that long) I currently work in a computer help desk for a big company and after being here for 10 years I am finally wanting to do something more exciting. Back in 2006 I got a &hellip;", "Again, cool challenge! I try to write an easy to follow solution, so that everyone, even beginners, can benefit from these . What’s the first step? Yep, run the program! You’ll see it’s not that easy this time… Our debugger just tells us that the process has terminated: [image] Is this terminat&hellip;", "Guys some of you go about it in a very complex way, it is actually very easy. Solution is exactly same as part 4. At VA 0342FE8 just patch it to mov al, 1; nop. It is serial verification function. With the patch you can enter any name and serial provided it follows regex NOREPLS-%d-%d-%d-%d and it&hellip;", "Guys some of you go about it in a very complex way, it is actually very easy. Solution is exactly same as part 4. At VA 0342FE8 just patch it to mov al, 1; nop. It is serial verification function. With the patch you can enter any name and serial provided it follows regex NOREPLS-%d-%d-%d-%d and it&hellip;", "I do have a plan but there is also some influences from how you guys are cracking them as well.", "Instead of calling IsDebuggerPresent, the program checks the BeingDebugged field of the Process Environment Block SPOILER![spoiler]by itself. Here is the responsible function:  [image]After that we gotta find the license check. All strings seem to be obfuscated and InitCommonControls is gone so in&hellip;", "Patching the program was easy, same solution as the last one, but whoever wrote that serial checking code needs to get a holy water IV and seek the nearest pope because an exorcist will only make things worse.", "Reverse Engineering and Crackme challengesThis topic is an aggregation of Crackme and reverse engineering challenges developed for 0x00sec. Please discuss the challenges in the thread they were originally posted or on IRC in #challenges This curation is based entirely on my own whim and not a comp&hellip;", "Thanks again for the time that you spend creating such challenges for the community mate  I found a weird string referenced in the licence checking function [image]  [image]Then I betted on data obfuscation and tried base64 decoding [image] =&gt; Challenge done", "BackstoryedgyReggie and DownerDanny of edgeS0ft have reviewed the results of the cracking attempts in the previous thread and are quite happy that there is progress in deterring crackers’ attempts at pirating the software. edgyReggie has also noticed that people have been able to share registration&hellip;", "Instead of calling IsDebuggerPresent, the program checks the BeingDebugged field of the Process Environment Block SPOILER![spoiler]by itself. Here is the responsible function:  [image]After that we gotta find the license check. All strings seem to be obfuscated and InitCommonControls is gone so in&hellip;", "The CTF is now over. There would of been 4 hours remaining but somehow the platform took a crap and i can’t even export the team scores so i will post the teams that actually scored anything and following that the specifics of who captured a challenge first. Thanks to all the teams that participated&hellip;", "Also there is regex check for serial validity. What i did is make dummy serial that follows the pattern NOREPLS-0000-0000-0000-REPLS and like you patched single instruction. At start i noped 3 bytes at 00931E01 and it worked, but putting mov al, 1; nop there is better. Three byte patch. To fix debu&hellip;", "Oh! I noticed there was a regex but thought the last part was 4 numbers too! D’oh!", "Also there is regex check for serial validity. What i did is make dummy serial that follows the pattern NOREPLS-0000-0000-0000-REPLS and like you patched single instruction. At start i noped 3 bytes at 00931E01 and it worked, but putting mov al, 1; nop there is better. Three byte patch. To fix debu&hellip;", "Here’s my approach featuring a persistently fully unlocked program; probably there are many better ways but damn it runs… At first I wanted to crack the registering process, so that I would have complete access for further reversing approaches. It’s as easy as in the last part: Just NOP the jmp in&hellip;", "edgyReggie definitely cranked it up a notch. The solution is the same as to the last one: replace the license check with a “mov eax, 1” or change the conditional jump to an uncoditional one. However, this time edgy’s hacker friend suggested adding some IsDebuggerPresent calls; This makes it harde&hellip;", "edgyReggie definitely cranked it up a notch. The solution is the same as to the last one: replace the license check with a “mov eax, 1” or change the conditional jump to an uncoditional one. However, this time edgy’s hacker friend suggested adding some IsDebuggerPresent calls; This makes it harde&hellip;", "edgyReggie definitely cranked it up a notch. The solution is the same as to the last one: replace the license check with a “mov eax, 1” or change the conditional jump to an uncoditional one. However, this time edgy’s hacker friend suggested adding some IsDebuggerPresent calls; This makes it harde&hellip;", "BackstoryedgyReggie is a busy guy… He has a massive workload plus a part time job at the local supermarket on the weekends, and on top of that, he has to develop his software for extra pocket money! Because of this, he does not have the time to spare to learn how to really defeat those dirty cracke&hellip;", "I just made it up on the spot in 10 seconds. I don’t even know if it works or not", "Patching the program was easy, same solution as the last one, but whoever wrote that serial checking code needs to get a holy water IV and seek the nearest pope because an exorcist will only make things worse.", "Patching the program was easy, same solution as the last one, but whoever wrote that serial checking code needs to get a holy water IV and seek the nearest pope because an exorcist will only make things worse.", "Once again thank you. My aim was to patch your program with up to two bytes and create “valid” License.lic file for this patch. Function (0x00401d20) for validating serial key and name combination is expected to returns value 1 for valid license. So I change it in that way. Below is code executed&hellip;", "Patching the program was easy, same solution as the last one, but whoever wrote that serial checking code needs to get a holy water IV and seek the nearest pope because an exorcist will only make things worse.", "[image] Top-notch anti-debugging measures EDIT: Holy crap, Windows troubleshooter fixed it o_O Double edit: Nope, crashes again. And my color scheme has switched to about 2.5 colors, what have you done Oh baby, a triple edit: ay, it works again", "Patching the program was easy, same solution as the last one, but whoever wrote that serial checking code needs to get a holy water IV and seek the nearest pope because an exorcist will only make things worse.", "[image] Top-notch anti-debugging measures EDIT: Holy crap, Windows troubleshooter fixed it o_O Double edit: Nope, crashes again. And my color scheme has switched to about 2.5 colors, what have you done Oh baby, a triple edit: ay, it works again", "Realmode Assembly - Writing bootable stuff - Part 2Part 2: Hello World BootloaderWhat is this?This is going to be a walk-through in writing an Operation System in assembly which operates purely in Realmode. Goal will be writing different kernels from a simple “Hello World” over small terminal p&hellip;", "[image] Top-notch anti-debugging measures EDIT: Holy crap, Windows troubleshooter fixed it o_O Double edit: Nope, crashes again. And my color scheme has switched to about 2.5 colors, what have you done Oh baby, a triple edit: ay, it works again", "[image] Top-notch anti-debugging measures EDIT: Holy crap, Windows troubleshooter fixed it o_O Double edit: Nope, crashes again. And my color scheme has switched to about 2.5 colors, what have you done Oh baby, a triple edit: ay, it works again", "[image] Top-notch anti-debugging measures EDIT: Holy crap, Windows troubleshooter fixed it o_O Double edit: Nope, crashes again. And my color scheme has switched to about 2.5 colors, what have you done Oh baby, a triple edit: ay, it works again", "[image] Top-notch anti-debugging measures EDIT: Holy crap, Windows troubleshooter fixed it o_O Double edit: Nope, crashes again. And my color scheme has switched to about 2.5 colors, what have you done Oh baby, a triple edit: ay, it works again", "Well, finding the serial wasn’t hard as it shows up as soon as you enter the function which checks the entered key: [image]", "Bah, I already started cracking the old one the proper way  Upon starting, a dialog box shows up, which makes us wait for 5 seconds before the program actually starts. Same thing happens when you try to close it. Let’s find the string “Please wait… 5 seconds”.  [image] It appears two times as &hellip;", "Bah, I already started cracking the old one the proper way  Upon starting, a dialog box shows up, which makes us wait for 5 seconds before the program actually starts. Same thing happens when you try to close it. Let’s find the string “Please wait… 5 seconds”.  [image] It appears two times as &hellip;", "I’ve updated a newer version if you’d like to try.", "Well, finding the serial wasn’t hard as it shows up as soon as you enter the function which checks the entered key: [image]", "BackstoryedgyReggie has looked over the previous thread once again and has thought that using such an easy encoding method just isn’t going to cut it. He has created a new serial number and obfuscated it yet again, and is confident that nobody can find it. He has also noticed that people have been &hellip;", "Well, finding the serial wasn’t hard as it shows up as soon as you enter the function which checks the entered key: [image]", "This place is so awesome. I was like, “hey, let’s google how to do that” and the VERY FIRST LINK was an 0x00sec tutorial. You guys rock. Edit (by oaktree):", "It’s for when we want to practice MITM", "It’s for when we want to practice MITM", "It’s for when we want to practice MITM", "It’s for when we want to practice MITM", "It’s for when we want to practice MITM", "Well thanks to @Joe_Schmoe and his rapid refactoring skills. He is re-writing the entire shell. With cool stuff like modules and that. So in fact the gitlab link doesn’t actually work; neither do the instructions here anymore. We’ll make an article when the new version gets released. And it works", "Not bad. You could modify this for other services, such as ssh or telnet. (then build a botnet)", "Not bad. You could modify this for other services, such as ssh or telnet. (then build a botnet)", "Not bad. You could modify this for other services, such as ssh or telnet. (then build a botnet)", "(post withdrawn by author, will be automatically deleted in 24 hours unless flagged)", "Not bad. You could modify this for other services, such as ssh or telnet. (then build a botnet)", "PrefaceThis write up are my thoughts and steps to analyze a given unknown binary. I want to understand the binary to a point where I can freely write about it. So here it is. I’m always open for you pointing out mistakes or giving feedback to me Disclaimer:I won’t look at the assembly code to p&hellip;", "Man…so many. The ones that stand out the most are the ridiculous ones. This was the worst one; it is so bad it is long (sorry everyone): Pivoting onto a manager’s desktop and finding an Excel Workbook entitled “PASSWORDS”. Inside was every current username/password for that manager’s direct report&hellip;", "Awesome post! Do you have any engagement stories to share?", "Man…so many. The ones that stand out the most are the ridiculous ones. This was the worst one; it is so bad it is long (sorry everyone): Pivoting onto a manager’s desktop and finding an Excel Workbook entitled “PASSWORDS”. Inside was every current username/password for that manager’s direct report&hellip;", "Awesome post! Do you have any engagement stories to share?", "Hello everyone. I have made some minor edits since first posting this as to further clarify a couple of points. I joined this community a while ago; I have/had been a lurker for even longer.  A huge part of what made the hacker community what it was (and what it is here) involves a willingness to &hellip;", "What’s in a Red Team?If you’re interested in information security, you’ve probably heard “penetration testing” and “red teaming” used interchangeably. However, for those of us actually doing red teaming, they’re not necessarily the same. So what do they mean? Penetration TestingPenetration testi&hellip;", "Don’t backdoor with the whole executable ya silly goose, use msfvenom to create download and execute shellcode (or make your own, wink wink)", "PrefaceAs always: I stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for t&hellip;", "One of the best article on buffering (buffer cache) / optimization I ever have read. How is GNU yes so fast?", "Create a fake identity and pay using a stolen credit card.", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "Note: I did not do the original work for this. This is an adaptation from Sheila A. Berta’s Exploit DB guide and mdiazcl from github on how to do it. With out further ado, let’s get right on into it shall we?! So, everyone by now (unless you live under a rock) has heard about the NSA tools leaked&hellip;", "Solving a ROP on 64-bit challenge In the name of Allah, the most beneficent, the most merciful. ###Before i begin this article, i want to thank @_py for showing me this beautiful community … This article is for learning purposes… Hello everybody, this my first article ever, i’m not really go&hellip;", "Remember when 0x00sec was home to only the 1335357 of h4ck3rs? Damn kids, get off my IRC server!", "Remember when 0x00sec was home to only the 1335357 of h4ck3rs? Damn kids, get off my IRC server!", "Remember when 0x00sec was home to only the 1335357 of h4ck3rs? Damn kids, get off my IRC server!", "Remember when 0x00sec was home to only the 1335357 of h4ck3rs? Damn kids, get off my IRC server!", "Remember when 0x00sec was home to only the 1335357 of h4ck3rs? Damn kids, get off my IRC server!", "Remember when 0x00sec was home to only the 1335357 of h4ck3rs? Damn kids, get off my IRC server!", "Do you mean 1337357?", "Remember when 0x00sec was home to only the 1335357 of h4ck3rs? Damn kids, get off my IRC server!", "Remember when 0x00sec was home to only the 1335357 of h4ck3rs? Damn kids, get off my IRC server!", "0x00sec turns 0x01!We made it, guys! 0x00sec is a year old. We went from a simple Jekyll blog with only three articles to a respectably-sized, full-on forum with over 500 users. Each day, one or more people took a chance and signed up. [image] Countless Introductions showcase our diversity of int&hellip;", "Now this is not a programming tutorial as most of you are probably hoping for, but I think most of you (if not all) ever had to use git. Wether it is to get involved in our Gitlab or to clone a nice little piece of software you found from GitHub, you’ll most likely use it in the future. I am current&hellip;", "download it from here : http://www.mediafire.com/file/j01kfl2y9hbbv97/viewimages.rar password for rar : 1", "Can you PM me a download link?", "Getting Stealthy with StelfHello 0x00’ers! In this tutorial, I am going to be giving away some content that has been sought after for a long time. Everybody knows that most prebuilt tools such as Metasploit don’t work, payloads generated by them, or encoders used with them. They get picked up by a&hellip;", "There’s no reason to write any sort of staging code honestly, any old http server and shellcode will do", "Did you ever finish the stager functionality? I’d be interested to see that. You’ve completely left this project stagnant for ages!!! Smh  Just kidding Joe.", "Don’t backdoor with the whole executable ya silly goose, use msfvenom to create download and execute shellcode (or make your own, wink wink)", "Getting Stealthy with StelfHello 0x00’ers! In this tutorial, I am going to be giving away some content that has been sought after for a long time. Everybody knows that most prebuilt tools such as Metasploit don’t work, payloads generated by them, or encoders used with them. They get picked up by a&hellip;", "Nymx wants this to run as a dll inside a process. That is infinitely more stealthy than a standalone exe.", "Nymx wants this to run as a dll inside a process. That is infinitely more stealthy than a standalone exe.", "I think that it would be a good exercise for y’all (myself included) to write some decent malware. I’ve been rolling the concept for one around in my head for a few weeks and it would be fun to implement, especially with a small team of people working on it. Here’s a basic concept that is in no wa&hellip;", "VVid0w?! Do you want to write some malware? Come on lets go and hack I never see you anymore Come on IRC It’s like you switched to slack! We used to be so 1337 And now we’re not I wish you would step it up Do you want to write some malware? It doesn’t have to be some malware… Sirens blare&hellip;", "Should be in the best language. But it’s prolly going to be in C.", "We’ll be using C++. I would’ve preferred to use rust, but c++ is better for this application.", "Should be in the best language. But it’s prolly going to be in C.", "Who’s going to look at the address bar if everything is as expected? Most people probably won’t think much of it even if they notice.", "Who’s going to look at the address bar if everything is as expected? Most people probably won’t think much of it even if they notice.", "I don’t know what you’re expecting of me Put under the pressure Of walking in your shoes", "Come on, @Joe_Schmoe! Don’t be __stelf__ish. Make a post!", "I nominate @Joe_Schmoe for his recent post on STELF.", "Yo, found this script recently: https://github.com/Tompazi/confundo What this script does is it replaces letters with similar looking Unicode glyphs. So you feed it a string, and it outputs several strings that look the same, yet use different characters. An example that comes to mind: If your tar&hellip;", "Hi fellas, This short write up follows my previous article, keeping you updated on the progress of unDLP. As I mentioned before, unDLP was mainly focused on data exfiltration through the ICMP protocol. However, after some research and debates on IRC (thanks @suser), I decided to reconsider the pro&hellip;", "Yo, found this script recently: https://github.com/Tompazi/confundo What this script does is it replaces letters with similar looking Unicode glyphs. So you feed it a string, and it outputs several strings that look the same, yet use different characters. An example that comes to mind: If your tar&hellip;", "Yo, found this script recently: https://github.com/Tompazi/confundo What this script does is it replaces letters with similar looking Unicode glyphs. So you feed it a string, and it outputs several strings that look the same, yet use different characters. An example that comes to mind: If your tar&hellip;", "Yo, found this script recently: https://github.com/Tompazi/confundo What this script does is it replaces letters with similar looking Unicode glyphs. So you feed it a string, and it outputs several strings that look the same, yet use different characters. An example that comes to mind: If your tar&hellip;", "Yo, found this script recently: https://github.com/Tompazi/confundo What this script does is it replaces letters with similar looking Unicode glyphs. So you feed it a string, and it outputs several strings that look the same, yet use different characters. An example that comes to mind: If your tar&hellip;", "Yo, found this script recently: https://github.com/Tompazi/confundo What this script does is it replaces letters with similar looking Unicode glyphs. So you feed it a string, and it outputs several strings that look the same, yet use different characters. An example that comes to mind: If your tar&hellip;", "Ever wondered why so many sites don’t allow Unicode to be used in usernames? Yep, that’s the reason… // Edit: A simple online converter: Homoglyph Attack One example: Joe_Schmoe --&gt; Jοe_Schmoe Could you spot the difference? Proof (SHA-256): Original: bb1c1ec26ebae7df700719461ce0a0bc5aac1aac2fa1&hellip;", "Yo, found this script recently: https://github.com/Tompazi/confundo What this script does is it replaces letters with similar looking Unicode glyphs. So you feed it a string, and it outputs several strings that look the same, yet use different characters. An example that comes to mind: If your tar&hellip;", "Yo, found this script recently: https://github.com/Tompazi/confundo What this script does is it replaces letters with similar looking Unicode glyphs. So you feed it a string, and it outputs several strings that look the same, yet use different characters. An example that comes to mind: If your tar&hellip;", "Yo, found this script recently: https://github.com/Tompazi/confundo What this script does is it replaces letters with similar looking Unicode glyphs. So you feed it a string, and it outputs several strings that look the same, yet use different characters. An example that comes to mind: If your tar&hellip;", "Yo, found this script recently: https://github.com/Tompazi/confundo What this script does is it replaces letters with similar looking Unicode glyphs. So you feed it a string, and it outputs several strings that look the same, yet use different characters. An example that comes to mind: If your tar&hellip;", "Yo, found this script recently: https://github.com/Tompazi/confundo What this script does is it replaces letters with similar looking Unicode glyphs. So you feed it a string, and it outputs several strings that look the same, yet use different characters. An example that comes to mind: If your tar&hellip;", "Yo, found this script recently: https://github.com/Tompazi/confundo What this script does is it replaces letters with similar looking Unicode glyphs. So you feed it a string, and it outputs several strings that look the same, yet use different characters. An example that comes to mind: If your tar&hellip;", "I don’t know what you’re expecting of me Put under the pressure Of walking in your shoes", "30 days later and Joe_Schmoe still has no article on stelf…", "Oh no, now I actually have to pay all those people whose votes I bought", "Oh no, now I actually have to pay all those people whose votes I bought", "Oh no, now I actually have to pay all those people whose votes I bought", "Oh no, now I actually have to pay all those people whose votes I bought", "Just transfer the 100 bitcoins to my address. thanks mate", "Oh no, now I actually have to pay all those people whose votes I bought", "JSCHMOE IS THE WINNER! @Joe_Schmoe congrats", "Good morning fellow readers, PrefaceI decided to write another beginner tutorial before we’re stepping into deeper water, so everyone who’s interested in following has basically the same knowledge base when it’s getting more complex. If you’re more advanced and already know what I’m writing about &hellip;", "A Teensy? What’s that?First things first…DO NOT give this to your infant. A Teensy device is a “USB-based microcontroller development system.” Honestly, that’s really all it is. http://imgur.com/56Srx1n BUT WAIT, THERE’S MORE!!&quot;But I thought you just said…&quot; Well, yes, but it is a development&hellip;", "Guess I should FINALLY make a post about it", "Good writeup about a topic I never thought about. I thoroughly enjoyed reading this, well done!", "Good writeup about a topic I never thought about. I thoroughly enjoyed reading this, well done!", "Good writeup about a topic I never thought about. I thoroughly enjoyed reading this, well done!", "The second in a series on microservices. MicroservicesPart 2: The start of microservicesOut of the water, onto land…The motivation for and benefits of a microservices architecture extend far beyond simply breaking down the monolith as mentioned, but for most engineers and companies I’ve spoken &hellip;", "NB: I have filed this under programming because it is in its purest essence a programming problem. However, this extends above and beyond the mere laying of code and into overall systems design I have also decided to break these into shorter chunks of around 1,000-1,200 words each. MicroservicesP&hellip;", "you better write it in python so I can contribute", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "Hello everyone! The entire community is invited to nominate users (themselves or others) to be considered for this month’s 1337 of the m0n7h. Comment somebody who you think should win the 1337 of the M0n7h award and nearing the end of the month we will add those names into a poll for you to choos&hellip;", "I waited for such comment from you  @oaktree is right ! Go outside your comfort zones !", "Why not learn PERL to contribute?", "you better write it in python so I can contribute", "you better write it in python so I can contribute", "you better write it in python so I can contribute", "Fun fact, you can use anything to transport your packets! So you can use ICMP, DNS queries, pipes between processes, infrared diodes and sensors, printer which prints them out then feeds the paper into a scanner, then an OCR program reads them again, machines that fold the paper into airplanes and s&hellip;", "take two paperclips, plug one end into the powerbank’s usb port and the other into laptop. should not explode into flames too quickly", "take two paperclips, plug one end into the powerbank’s usb port and the other into laptop. should not explode into flames too quickly", "@Joe_Schmoe It won’t be that spectacular because powerbanks have quite a large internal resistance that limits the current flow. My simple power bank can push 7A max because of the limit when shorted. Not to say you should do it, but it won’t be that spectacular. -Phoenix750", "take two paperclips, plug one end into the powerbank’s usb port and the other into laptop. should not explode into flames too quickly", "That’s correct. However you may have to carefully adjust your timeouts for some of those transport techniques. The paper planes solution may suppose some serious technical challenges . For the pigeons the process is already standardised: https://tools.ietf.org/html/rfc2549 Regarding DNS… I really&hellip;", "Fun fact, you can use anything to transport your packets! So you can use ICMP, DNS queries, pipes between processes, infrared diodes and sensors, printer which prints them out then feeds the paper into a scanner, then an OCR program reads them again, machines that fold the paper into airplanes and s&hellip;", "Fun fact, you can use anything to transport your packets! So you can use ICMP, DNS queries, pipes between processes, infrared diodes and sensors, printer which prints them out then feeds the paper into a scanner, then an OCR program reads them again, machines that fold the paper into airplanes and s&hellip;", "I promise to write this many months ago, and finally I found some time to do it. Even when a VPN is not really a hacker tool, it is commonly used to make tracing more difficult and to increase privacy and anonymity. We have talked a lot about VPNs from a user point of view but not much about how the&hellip;", "Hello fellow 0x00sec h4x0rz!! Today I’m coming to you with a discussion topic on EDC bags. An EDC bag is something that you carry with you every day, I.E, an &#39;E’very &#39;D’ay &#39;C’arry bag. The Bag.Alright, so, what’s an EDC bag without the bag part?! Personally, I don’t think you need an expensive, s&hellip;", "So it seems my exploits have been found in more WPA2 implimentations?", "I guess this is an open wifi for clients, and this is actually pretty security conscious. They probably enabled AP client isolation, so you can’t easily sniff for sensitive data.", "Well, I was able to do simple recon and login to the router from my phone. So really all it did was serve as a welcome mat…", "I guess this is an open wifi for clients, and this is actually pretty security conscious. They probably enabled AP client isolation, so you can’t easily sniff for sensitive data.", "I guess this is an open wifi for clients, and this is actually pretty security conscious. They probably enabled AP client isolation, so you can’t easily sniff for sensitive data.", "You no doubt have heard of Cookie Sniffing before. You sniff out a cookie, and you have their session, right? Sounds easy. Firesheep made it incredibly easy, and you can do this easily with things like MiTMF or STELF. But what exactly are cookies, how do they work, and how can we exploit them? Let’&hellip;", "STELF - Shell That Exercises Little Fanfare I’m beginning to wonder if we should keep it a little more low-key since it is going to be insanely effective when it’s fully functional. When I say effective, I mean, incredibly stealthy and very resilient. It’s becoming more than just a shell and start&hellip;", "Hi everyone ! Hope you’re all doing well. So today I will show you how you can build your own virtual lab ( For malware analysis or pentest lab ), in this Tutorial I will use proxmox who is an Open Source Server solution. Table of contentWhy ProxmoxDownloading ProxmoxUpload the iso Why Proxm&hellip;", "Oh yeah! We need some malware analysis stuff BADLY. Might help when building STELF.", "Nice script, and it’s written in the most holy language! Well done.", "Nice script, and it’s written in the most holy language! Well done.", "Nice script, and it’s written in the most holy language! Well done.", "Wow ! I’m back here and there are some good stuff that happen ! GitLab and some great tutorial and links that I need to read ! I’m back to finish the Nebula serie and all the things I started here and bring some new Tutorial ! I’ve done some CTF and I’m still learning about Malware analysis but I &hellip;", "Nice script, and it’s written in the most holy language! Well done.", "Nice script, and it’s written in the most holy language! Well done.", "Nice script, and it’s written in the most holy language! Well done.", "Hi fellas, First of all, I wanted to apologize for my lack of activities the last month. Indeed, I was overwhelmed by my work and my training for my OSCP certification which was quite time consuming  By the same token, would you be interested in my feedback about OSCP? YesNo0voters &hellip;", "I nominate @_py for his article on symbol resolution and @oaktree for his article on Dynamic Loading of .so’s After seeing STELF, I also nominate @Joe_Schmoe and  @pry0cc for this awesome piece of h4x0ry", "Avoiding the untrusted publisher pop-up would be simple, we just need to steal Microsoft’s private keys which they use to sign programs. As to changing file modification dates, it will be easy to do. You can do it with powershell or python.", "Avoiding the untrusted publisher pop-up would be simple, we just need to steal Microsoft’s private keys which they use to sign programs. As to changing file modification dates, it will be easy to do. You can do it with powershell or python.", "Not very set up to show anything off screenshot wise as I am out of the game right now thanks to school but I can post my rig stuff for anyone who possibly gives a hoot. Intel i7 4790k Evga Asus z97 32 gb ram Evga Nvidia gtx980. Intend to buy another and possibly one more of these even if it’s e&hellip;", "I wonder why, pry0cc", "Hi 0x00ers, While surfing the web, I stumbled upon a blog post which I found to be very helpful for beginners. Be sure to check out this guide if you want to start a successful cybersec career!   Best Regards, SmartOne", "Guess I should FINALLY make a post about it", "I nominate @_py for his article on symbol resolution and @oaktree for his article on Dynamic Loading of .so’s After seeing STELF, I also nominate @Joe_Schmoe and  @pry0cc for this awesome piece of h4x0ry", "Since 0x00sec’s conception, 0x00sec has relied entirely on the wallets of the admins, as well as the donations from kind people in the community for funding. Starting today, the new official sponsor of 0x00sec is Sequoia Cyber Solutions!  [Sequoia]These guys are doing some really great things wit&hellip;", "You absolutely should.", "Guess I should FINALLY make a post about it", "I resume this old post because this tutorial helped me to develop a complete C# Crypter for a bind shell that I need in my job. You can include the encrypted file as embedded resource in your VS 2005 stub project, selecting Do not copy to the output directory and the file will be embedded in your ex&hellip;", "Hello everyone! The entire community is invited to nominate users (themselves or others) to be considered for this month’s 1337 of the m0n7h. Comment somebody who you think should win the 1337 of the M0n7h award and nearing the end of the month we will add those names into a poll for you to choos&hellip;", "Guess I should FINALLY make a post about it", "I’ll just leave this here… https://git.0x00sec.org/JSchmoe/unnamed-shell", "@Joe_Schmoe We all know why.", "Endianness is a compression thing. You see, the application that connects you to wifi can predict what the password is supposed to be. You only have to type in the first 6 characters and the last one, and the program will use a PBKDF algorithm (PuBlic Key Derivation Finagler) to generate the charact&hellip;", "Endianness is a compression thing. You see, the application that connects you to wifi can predict what the password is supposed to be. You only have to type in the first 6 characters and the last one, and the program will use a PBKDF algorithm (PuBlic Key Derivation Finagler) to generate the charact&hellip;", "Endianness is a compression thing. You see, the application that connects you to wifi can predict what the password is supposed to be. You only have to type in the first 6 characters and the last one, and the program will use a PBKDF algorithm (PuBlic Key Derivation Finagler) to generate the charact&hellip;", "Endianness is a compression thing. You see, the application that connects you to wifi can predict what the password is supposed to be. You only have to type in the first 6 characters and the last one, and the program will use a PBKDF algorithm (PuBlic Key Derivation Finagler) to generate the charact&hellip;", "Endianness is a compression thing. You see, the application that connects you to wifi can predict what the password is supposed to be. You only have to type in the first 6 characters and the last one, and the program will use a PBKDF algorithm (PuBlic Key Derivation Finagler) to generate the charact&hellip;", "Some researchers say that the vulnerability is inside the authentication process, but no one was able to pinpoint what exactly triggers it. It also appears in many routers regardless of manufacturer, suggesting that the WPA2 protocol is flawed. However, users report using strong passwords mitigates &hellip;", "Some researchers say that the vulnerability is inside the authentication process, but no one was able to pinpoint what exactly triggers it. It also appears in many routers regardless of manufacturer, suggesting that the WPA2 protocol is flawed. However, users report using strong passwords mitigates &hellip;", "Some researchers say that the vulnerability is inside the authentication process, but no one was able to pinpoint what exactly triggers it. It also appears in many routers regardless of manufacturer, suggesting that the WPA2 protocol is flawed. However, users report using strong passwords mitigates &hellip;", "We used to hate shitposts on Null Byte, now we got this…  [image]", "Some researchers say that the vulnerability is inside the authentication process, but no one was able to pinpoint what exactly triggers it. It also appears in many routers regardless of manufacturer, suggesting that the WPA2 protocol is flawed. However, users report using strong passwords mitigates &hellip;", "Some researchers say that the vulnerability is inside the authentication process, but no one was able to pinpoint what exactly triggers it. It also appears in many routers regardless of manufacturer, suggesting that the WPA2 protocol is flawed. However, users report using strong passwords mitigates &hellip;", "Some researchers say that the vulnerability is inside the authentication process, but no one was able to pinpoint what exactly triggers it. It also appears in many routers regardless of manufacturer, suggesting that the WPA2 protocol is flawed. However, users report using strong passwords mitigates &hellip;", "Earlier we were discussing in the IRC how kowalski found a really good fast method to crack WPA2. So without further ado! We’ll jump right in. Step 1: Turn on WIFi and scan for networks.You need to make sure the network you select is labeled “WPA2-PSK”, this method won’t work if it is WEP or Open&hellip;", "There’s a typo in both scripts, on the line which prints what model they are attacking. Literally unusable.", "There’s a typo in both scripts, on the line which prints what model they are attacking. Literally unusable.", "There’s a typo in both scripts, on the line which prints what model they are attacking. Literally unusable.", "There’s a typo in both scripts, on the line which prints what model they are attacking. Literally unusable.", "There’s a typo in both scripts, on the line which prints what model they are attacking. Literally unusable.", "There’s a typo in both scripts, on the line which prints what model they are attacking. Literally unusable.", "Do elaborate on it, because it worked just fine for me. EDIT: Oh rofl never mind I see it. Hahaha. “Attcking” . Editing it to fix the typo.", "There’s a typo in both scripts, on the line which prints what model they are attacking. Literally unusable.", "IntroductionHello fellow h4x0rz! I’m sure you’ve all heard about the recent Netgear router exploit, correct?! Well, on this fine day I now present to you this article of Netgear administrator credential finding, using the CVE-2017-5521 vulnerability. (DISCLAIMER: I am offering this article as pur&hellip;", "There’s a typo in both scripts, on the line which prints what model they are attacking. Literally unusable.", "Hello peeps! Been a while. I hope you’re all doing great. This write-up was supposed to be up way sooner to be honest. Recently, @oaktree coded an IRC bot with dynamic linking features which motivated me to finally take the initiative and finish this god damn paper. So without further ado, @oaktree &hellip;", "It is said that once in a while a person has to reinvent himself (I follow Zen philosophy). I believe it’s my time to answer myself to the questions I’ve been pondering upon for quite some time now. So I’ve decided to go on a break, facing the uncertainty of life to refuel the mind. Home is not a p&hellip;", "I know this is probably a really basic thing, but it’s still awesome! Thanks for sharing.", "I know this is probably a really basic thing, but it’s still awesome! Thanks for sharing.", "I know this is probably a really basic thing, but it’s still awesome! Thanks for sharing.", "Some people say that there are three things you have to do before you die: Write a book, have a child and plant a tree. Actually, the three things you have to do before you die are: write your own IRC bot, create a massive framework that only you will ever use and code an awesome  Linux kernel modul&hellip;", "(writes in Valentine with a box next to it and checks it off), JK but for real, @Joe_Schmoe should get it. He’s awesome. Am I too late? xD", "7 days left! Joe_schmoe is right.", "Come on guys, start voting!", "Come on guys, start voting!", "Come on guys, start voting!", ".tk domains are free.", "Imagine you are sitting in an airport, and you feel a sudden urge to browse the Internet. You take out your phone, and there seems to be an open network for travelers. Having safety in mind, you fire up your VPN client. But wait - It can’t connect? You open your browser and witness a horrible sight &hellip;", "And the winner is… @dtm! Congrats. @dtm previously won the old 1337 of the w33k and has contributed many h4rdc0r3 articles about h4x0rzing all sorts of stuff! @IoTh1nkN0t@0x00pf@pry0cc@Joe_Schmoe@Cal0X@dtm@TxS0voters Show resultsHello Loyal 0x00ers! For this month we are op&hellip;", "Looks top neat. How’d you find out about it? Came across while googling for carrot images?", "It was a cold and lonely night… so what better to warm me and keep me company than carrots? Was watching this ^ video and they interviewed some ‘cyber security specialtist’ and he was using this tool. Looked interesting, so I decided to try for myself… turns out it was actually pretty good. EDIT:&hellip;", "Looks top neat. How’d you find out about it? Came across while googling for carrot images?", "Welcome everyone! In this article, I’ll try to briefly introduce you to the amazing Carrot2 Clustering Engine. I don’t know about you, but I only found out about this tool a couple of days ago and I thought it was worth sharing it. So, ###What is Carrot2? Carrot2 is an Open Source Search Results&hellip;", "What’s good, peeps? Before I start this topic, I’d like to sincerely apologise for the huge delay. At the time (before my exams started), I was hyped to deliver a second instalment of game hacking to the forums but I had lost interest due to the exhaustion gathered from exam preparation and particip&hellip;", "Imagine you are sitting in an airport, and you feel a sudden urge to browse the Internet. You take out your phone, and there seems to be an open network for travelers. Having safety in mind, you fire up your VPN client. But wait - It can’t connect? You open your browser and witness a horrible sight &hellip;", "Imagine you are sitting in an airport, and you feel a sudden urge to browse the Internet. You take out your phone, and there seems to be an open network for travelers. Having safety in mind, you fire up your VPN client. But wait - It can’t connect? You open your browser and witness a horrible sight &hellip;", "Imagine you are sitting in an airport, and you feel a sudden urge to browse the Internet. You take out your phone, and there seems to be an open network for travelers. Having safety in mind, you fire up your VPN client. But wait - It can’t connect? You open your browser and witness a horrible sight &hellip;", "Imagine you are sitting in an airport, and you feel a sudden urge to browse the Internet. You take out your phone, and there seems to be an open network for travelers. Having safety in mind, you fire up your VPN client. But wait - It can’t connect? You open your browser and witness a horrible sight &hellip;", "Imagine you are sitting in an airport, and you feel a sudden urge to browse the Internet. You take out your phone, and there seems to be an open network for travelers. Having safety in mind, you fire up your VPN client. But wait - It can’t connect? You open your browser and witness a horrible sight &hellip;", "Imagine you are sitting in an airport, and you feel a sudden urge to browse the Internet. You take out your phone, and there seems to be an open network for travelers. Having safety in mind, you fire up your VPN client. But wait - It can’t connect? You open your browser and witness a horrible sight &hellip;", "@Joe_Schmoe  What does changing nameservers entail?", "You can run iodined on your main computer while away on holidays or a raspberry pi. It takes up barely any resources. If you don’t want to use dot.tk domains you can use any other free domain services, but you need to be able to change nameservers.", "Computers aren’t, though. And I would not wanna use one of those dot.tk spam domains.", "This can’t be real. The legend himself @Joe_Schmoe made a write-up? Dayum!", ".tk domains are free.", "Imagine you are sitting in an airport, and you feel a sudden urge to browse the Internet. You take out your phone, and there seems to be an open network for travelers. Having safety in mind, you fire up your VPN client. But wait - It can’t connect? You open your browser and witness a horrible sight &hellip;", "This can’t be real. The legend himself @Joe_Schmoe made a write-up? Dayum!", "Imagine you are sitting in an airport, and you feel a sudden urge to browse the Internet. You take out your phone, and there seems to be an open network for travelers. Having safety in mind, you fire up your VPN client. But wait - It can’t connect? You open your browser and witness a horrible sight &hellip;", "Imagine you are sitting in an airport, and you feel a sudden urge to browse the Internet. You take out your phone, and there seems to be an open network for travelers. Having safety in mind, you fire up your VPN client. But wait - It can’t connect? You open your browser and witness a horrible sight &hellip;", "Imagine you are sitting in an airport, and you feel a sudden urge to browse the Internet. You take out your phone, and there seems to be an open network for travelers. Having safety in mind, you fire up your VPN client. But wait - It can’t connect? You open your browser and witness a horrible sight &hellip;", "Imagine you are sitting in an airport, and you feel a sudden urge to browse the Internet. You take out your phone, and there seems to be an open network for travelers. Having safety in mind, you fire up your VPN client. But wait - It can’t connect? You open your browser and witness a horrible sight &hellip;", "@0x00pf for the socket article, @IoTh1nkN0t for the PHP shell (now combine the two somehow)", "@0x00pf for the socket article, @IoTh1nkN0t for the PHP shell (now combine the two somehow)", "Hello 0x00’ers. I have made some wallpapers with the 0x00sec logos. I hope you enjoy them. I have attached a compressed tar archive with the full album. (MEGA link, The files are huge because I didn’t compress them.) Enjoy   https://mega.nz/#!7BRQBTyZ!AjsIxERCVe0_l0Ub2jl49vSZ8HViwKtJi2idTuGKESo –F&hellip;", "I agree on @Joe_Schmoe. Not because he’s l33t or anything, but simply because of his badass motherfuckery. -Phoenix750", "I agree on @Joe_Schmoe. Not because he’s l33t or anything, but simply because of his badass motherfuckery. -Phoenix750", "@Joe_Schmoe: He just deserves it.", "@Joe_Schmoe: He just deserves it.", "Clever. Is something like that possible on windows?", "AFAIK there is no direct equivalence to this on Windows. I’m pretty sure it should be possible to reuse the existing connection but I bet the process would probably be pretty different… but I do not know how. Maybe some of the windows guy can provide some details.", "In this paper I will present an elegant technique (it’s my opinion, indeed) to get shell access to a vulnerable remote machine. It is not my own technique but I found it very interesting. The focus of this paper is on this technique and not in the way to exploit the vulnerability. Setting your envi&hellip;", "Clever. Is something like that possible on windows?", "Diffie Hellman key exchange is a way to share an encryption key over an insecure channel. An example from wikipedia: Alice and Bob agree on a prime modulus P = 23 and a base G = 5. Alice then chooses a secret integer, A = 6. Bob also chooses a secret number, B = 15. Alice then computes C = G^A mod&hellip;", "Diffie Hellman key exchange is a way to share an encryption key over an insecure channel. An example from wikipedia: Alice and Bob agree on a prime modulus P = 23 and a base G = 5. Alice then chooses a secret integer, A = 6. Bob also chooses a secret number, B = 15. Alice then computes C = G^A mod&hellip;", "Diffie Hellman key exchange is a way to share an encryption key over an insecure channel. An example from wikipedia: Alice and Bob agree on a prime modulus P = 23 and a base G = 5. Alice then chooses a secret integer, A = 6. Bob also chooses a secret number, B = 15. Alice then computes C = G^A mod&hellip;", "Diffie Hellman key exchange is a way to share an encryption key over an insecure channel. An example from wikipedia: Alice and Bob agree on a prime modulus P = 23 and a base G = 5. Alice then chooses a secret integer, A = 6. Bob also chooses a secret number, B = 15. Alice then computes C = G^A mod&hellip;", "Diffie Hellman key exchange is a way to share an encryption key over an insecure channel. An example from wikipedia: Alice and Bob agree on a prime modulus P = 23 and a base G = 5. Alice then chooses a secret integer, A = 6. Bob also chooses a secret number, B = 15. Alice then computes C = G^A mod&hellip;", "C++ is beginning to win my over. And I must say. Ruby is bae.", "I’ll take a looksie, can’t resist reading best language", "Awesome! Are you using diffie hellman? @Joe_Schmoe is a python freak and loves Diffie xD", "I’ll take a looksie, can’t resist reading best language", "I’ll take a looksie, can’t resist reading best language", "[image]", "Phoenix, making memes out of yourself is frowned upon", "Phoenix, making memes out of yourself is frowned upon", "Phoenix, making memes out of yourself is frowned upon", "You really need to have a VPN under your control if you can even have a hope at trusting it. That said, getting a cloud instance on DigitalOcean or Amazon Lightsail then running OpenVPN on it is a good start.", "Cryptography is an ancient mathematical science that was originally used for military communications, and designed to conceal the contents of a message should it fall into the hands of the enemy. Recent developments in cryptography have added additional uses, including mechanisms for authenticating &hellip;", "Good day all, Seeing as this is my first real post here, and I’m fairly certain a few of you know me, but the large majority don’t, I’ll introduce myself a little, and then continue from there. Names Mike, I go by L0k1 online, which is what most of you will come to know me as. I’ve been involved i&hellip;", "Prepare yourselves and don’t get too jealous. My coding area (AKA h4Xx0r 5p4c3):  [image]Browser/IRC area (for h4xx1ng):  [image]My 1337 af wallpaper:  [image]This is me h4xx1ng into the m41nfr4m3:  [image]h8ters gon h8te.", "I’m loving these setups! SO MANY GOOD IDEAS TO BORROW! I try to keep my setup hardware agnostic and *nix oriented. As such, just about everything that makes my setup mine is saved in my dotfiles. That was I can jump into a new machine of almost any nix flavor and be ready to rock right away. That a&hellip;", "I don’t run any fancy OS (just a Win10 + ParrotSec in dual boot), but I am happy to share my powerful hardware setup for those who are interested: CPU: I7-6700K: This is probably the best price-performance CPU on the market, hands down. With a base clock of 4GHz and 4 physical cores, which can be e&hellip;", "This is the second in a series on ssh config files IntroductionThe previous article in this series was an introduction to the ssh config file, how it can be used, and a teaser of some of the possibilities. You’ve probably already figured out that it’s quite easy to set common config strappings suc&hellip;", "Yesterday, I joined the 0x00sec IRC channel and, as many other times, @dtm come up with an interesting concept… and I had to try. The idea was pretty challenging and I have not completely come up with a full implementation but I manage to get a minimal Proof of Concept program to illustrate the conc&hellip;", "Note that you will need to have GnuPG (GPG) installed before starting the tutorial. The theory behind this is very similar to that of the signing a file, only that clearsigning allows you to sign messages not files. This is ideal for when you want to sign a Tweet, a blog post, or anything else of t&hellip;", "I nominate @fraq. Last minute nomination for his dope SSH posts.", "whoever votes for me gets a free thank you", "@Joe_Schmoe seems to be a pretty 1337 guy edit: extremely handsome and smart too", "whoever votes for me gets a free thank you", "whoever votes for me gets a free thank you", "Winner: @NitraxWell done @Nitrax for winning this month’s 1337 0f the M0n7h! The community has loved your content from the past month, and have chosen you for this month! I hope you enjoy the perks of being a 1337 0f the M0n7h winner  Hello Loyal 0x00ers! For this month we are open for nominati&hellip;", "@Joe_Schmoe seems to be a pretty 1337 guy edit: extremely handsome and smart too", "So I was browsing the net like you do and I came across this security blog.  [image]Looks interesting. Let’s check it out. … What’s this?  [image]u fokin’ w0t m8te? [image] [image] [image]ill bash yer fookin ead in, i sweah on me mum[image]", "Thanks! Yes it’s something JSchmoe is working on. I’m helping to test it and work out the kinks. It’s on the gitlab. It’s essentially a Metasploit clone, but uses the STELF shell and handler rather than meterpreter, which means antivirus doesn’t recognise it at all. It’s still early days but some r&hellip;", "totally not inspired by pry0cc  [image]", "@Joe_Schmoe seems to be a pretty 1337 guy edit: extremely handsome and smart too", "@Joe_Schmoe seems to be a pretty 1337 guy edit: extremely handsome and smart too", "@Joe_Schmoe seems to be a pretty 1337 guy edit: extremely handsome and smart too", "@Joe_Schmoe seems to be a pretty 1337 guy edit: extremely handsome and smart too", "Hmm I don’t know man, this looks like @pry0cc’s month to me…", "@Joe_Schmoe seems to be a pretty 1337 guy edit: extremely handsome and smart too", "@Joe_Schmoe seems to be a pretty 1337 guy edit: extremely handsome and smart too", "@Joe_Schmoe seems to be a pretty 1337 guy edit: extremely handsome and smart too", "@Joe_Schmoe seems to be a pretty 1337 guy edit: extremely handsome and smart too", "@pry0cc, @Evalion, @worz, @Joe_Schmoe and @dtm P.S. (even @oaktree)", "Nope. I call all genders “man/dude”, it makes it much simpler after there are an apparent 37 genders…", "did you just assume their gender", "This is because yaourt uses makepkg to build the packages from PKGBUILD, and running makepkg as root is not advised, because PKGBUILD is simply a bash script, and if it contains some wrong commands, you can cause permanent damage to your system. I prefer using cower for checking AUR updates and then&hellip;", "This is because yaourt uses makepkg to build the packages from PKGBUILD, and running makepkg as root is not advised, because PKGBUILD is simply a bash script, and if it contains some wrong commands, you can cause permanent damage to your system. I prefer using cower for checking AUR updates and then&hellip;", "Thanks for the advice but honestly I’m too lazy to worry about things running as root or not. I’m already annoyed enough about yaourt not letting me install as root", "Thanks for the advice but honestly I’m too lazy to worry about things running as root or not. I’m already annoyed enough about yaourt not letting me install as root", "Using root for everything is a really bad idea. If you’re worried about using pentesting tools which require root privs, use sudo -E or add your user to its group. For example, wireshark wont let you capture packets because it’ll need root privs, but if you add your user to the wireshark group, you &hellip;", "totally not inspired by pry0cc  [image]", "Loving it  I’m getting very 1337 vibes here.", "totally not inspired by pry0cc  [image]", "totally not inspired by pry0cc  [image]", "totally not inspired by pry0cc  [image]", "Ok here is my setup! I run ArchLinux with the i3 tiling window manager. This is configured by myself using a very heavily modified version of OxHak’s config. I am using conky for the top bar. My anonymity setup is fairly simple. I have a collection of VPN’s and I connect to a different one every da&hellip;", "Note that you will need to have GnuPG (GPG)  installed before starting the tutorial. First, a bit of background as to how this works: A digital signature certifies and timestamps a document. If the document is subsequently modified in any way, a verification of the signature will fail. A digit&hellip;", "Hello, my loyal 0x00’ers! You are reading my 4th Installment of Paranoia and a Terminal! Today we are going to discuss how to set up a Tor Service; and how to access it. Tor services are a really good addition to your toolkit as a Paranoid hacker. Tor can be used as an Anonymity tool, but providing&hellip;", "Well, I promised you a complete description of my setup so here we go. The main con that I faced at work was the hardware performance. Indeed, my machine was so slow that I could not even run firefox and my virtual machine at the same time … Consequently, I designed my environment to be as much as &hellip;", "Welcome back! So in my previous post we talked about extracting the places.sqlite file from our target’s computer and there were a couple of things I forgot to mention. First, what actually is a profile? Below is how Mozilla defines a User Profile: ###Mozilla’s Support Page - All of the changes &hellip;", "Hi Friends, In the last time, I’m trying to get deep in the windows Internals section. I found some stuff that maybe can help you also: Windows Internals 6th (Part 1 &amp; 2): http://materias.fi.uba.ar/7508/WI6/Windows%20Internals%20Part%201%20(6th%20Edition).pdf http://materias.fi.uba.ar/7508/WI6/&hellip;", "This is a very thorough write up of an old but previously unknown 0day exploit for Ubuntu 12.04.5, leveraging libgstnsf.so in gstreamer 0.10.x to bypass 64-bit ASLR and DEP. Essentially that version of gstreamer uses 6502 assembly code to emulate the NES’ CPU and sound hardware in realtime, which d&hellip;", "Let’s go on with our special ASM/C programming course. At this point, we roughly know how a computer works, its main components, what is machine code, what is assembly code and how to compile simple programs for a few architectures. In this part we are going to write our first shellcode. Yes, we ar&hellip;", "Hi fellas, Following my conversations with you guys on IRC about the job of pentester, I decided to introduce you the different facets of a pentesting and maybe enlighten gray areas that remain in this domain. Disclaimer : Once again, it will be a long reading  PentestingCompanies spend millions&hellip;", "Hello, 0x00’ers! Welcome to my third (Yes 3rd) instalment of Paranoia and a Terminal! In this episode we will explore URL Forensics - for the Paranoid. In other terms, viewing a site or viewing a link, without falling victim to a social engineering attack if our spidey sense rings alarm bells. Scen&hellip;", "Continuing the discussion from [KEYGENME - EASY] Cracking Your First Program: As requested by @pry0cc, this is a crash course on reverse engineering. Before reading this, you should try to solve @dtm challenge: If you didn’t manage or you want to see somebody else solution keep reading. Our Tar&hellip;", "Hey mates, in the last part I used MSIL to add a File.WriteAllBytes() call, for dumping the packed executable. This time I show you a much easier way for dumping .NET-applications called MegaDumper. MegaDumperMegaDumper is a tool which can easily dump .NET-executables directly from memory withou&hellip;", "#Tiling Window Managers Hey, I am worz/ovtru3. Most of you know me, I have been on the IRC for about two months now. I had promised @pry0cc to do an article on tiling window managers, because few days ago, I was experimenting with almost all the major ones. At last, I settled with i3wm, because it &hellip;", "Continuing the discussion from Plug In To Win - DIY Bad USB [Part 3/3]: You may have read the awesome “Plug In To Win” series from @TheDoctor. It make me recall some experiments I did time ago on HID injection. After some private chat, we agreed to release this extra post to present one more HW alt&hellip;", "Hey Mates! This time I’ll tell you how you can build your own Bad USB for about 10$. It’s pretty easy, but requires a compatible USB Stick. RequirementsYou’ll need an USB Stick with the Phison 2303 (2251-03) microcontroller installed. Sadly you can’t just ask in your favourite hardware shop for &hellip;", "Hi all! Recently we have been able to get our own GitLab server, made possible by @L0k1! Since then we have moved all of 0x00sec’s project there. You can find us at https://gitlab.s-3.tech/groups/0x00sec In this tutorial I will going over how to use Agora to get packages from NullHub. Explanation&hellip;", "Hi all! Recently we have been able to get our own GitLab server, made possible by @L0k1! Since then we have moved all of 0x00sec’s project there. You can find us at https://gitlab.s-3.tech/groups/0x00sec In this tutorial I will going over how to use Agora to get packages from NullHub. Explanation&hellip;", "Since we’ve recently covered DLLs and, in a timely manner, @0x00pf has given us a brilliant paper on infecting processes, I thought that I’d contribute my piece on IAT hooking using a method called DLL injection. In this paper, I will be detailing an implementation of a simple user mode rootkit as a&hellip;", "Get 0x00sec Adspace! 0x00sec is now offering AdSpace! Why are you going to put your ad on 0x00sec?AdBlock-proof! Your ad will exist as a Globally Pinned Topic, which means that it is always there for all users to see. Google Analytics puts us at 6,000 page views per week. This doesn’t include&hellip;", "I’d like to offer a counter-announcement. Mine came first and I designed the whole API and Jason system. MIC DROP", "I’d like to announce that pry0cc’s agora manager sucks butt and null-get is a thousand times better. This message was sponsored by Schmoe Inc", "I’d like to offer a counter-announcement. Mine came first and I designed the whole API and Jason system. MIC DROP", "I’d like to announce that pry0cc’s agora manager sucks butt and null-get is a thousand times better. This message was sponsored by Schmoe Inc", "A while back we used to have a repo on Github, the Community-Code repo; and because there wasn’t much traction on it we decided to delete it. Since then we’ve had many requests to create a GitHub repo and or a GitLab server. Due to a lack of funds we are unable to make a GitLab server, although it &hellip;", "Becoming Anonymous Like a Pro #3: The Inner Workings of TORTORTOR as we know has been broken and hacked, which is why many people are now discarding TOR and moving on. As you should too, because it used to be a great anonymization tool. As we’ve seen with Sabu. How TOR Works Node = RouterWhen&hellip;", "Disclaimer: The synchronisation code is broken since it was written when I had very little knowledge of how it worked. Following from my previous paper, Windows Keylogging - Part I, I will be showcasing and explaining an example implementation of a Windows keylogger named Coeus, after the titan Coe&hellip;", "In my previous article, A Simple Demonstration on Malware Analysis, we dissected an infected program to locate and extract the file infector. To follow up from before, I said that we will be reversing the infector to find out what mechanisms have been included to allow it to perform its task, but in&hellip;", "Atleast worth a try though. -Phoenix750", "I heard it takes a horrible amount of effort and even then some apps don’t recognize the connection.", "EDIT, For up-to-date information on connecting to IRC: https://0x00sec.org/faq#irc Not sure if this is where I should post this, but couldn’t really pick an appropriate sub category of how-to and figured that this was best to be seen by every 0x00sec member as soon as they join so they can be part &hellip;", "(Yawn) Morning once again. Valentine here with another Nmap tutorial. This time I’m gonna talk about Scripts in Nmap. Scripts in Nmap are probably one of my favorite features. Not only can they figure out the users on the system but also bruteforce the password. I discovered these scripts not to lo&hellip;", "Hi fellas, To continue with my CAPTCHA series, I will introduce you the concept of randomness and its applicability to the domain of CAPTCHA breaking with a deeper digression to cryptography, steganography and forensics. Without further ado, I would like to get to the heart of the matter by explai&hellip;", "While tackling a CTF VM from Vulnhub today, I wrote this script to help me figure out if I had a file masquerading as another file-type. I know there is a file command in linux to get file type, but… I was suspicious, wanted to check deeper than the first few bytes, which could have been faked, so y&hellip;", "At some point, your C program is gonna grow. Maintaining all that code in just one file is painful. Even more, you may be using different libraries and typing all those flags every time you want to compile your program also becomes painful. When you get to that point, is time to Make and Split. Hel&hellip;", "Hi ! Today I wanted to talk about how networks work. This is probably the first Tutorial of a Networking series. A lot of people on 0x00sec are good and have decent knowledge ( Programming, Social engineering or Networking ). This series is intended to Newbies and people who want to expand their k&hellip;", "https://nmap.org/book/man-performance.html Speed templates (T1-5) are at the very bottom.", "https://nmap.org/book/man-performance.html Speed templates (T1-5) are at the very bottom.", "Script Kiddies are why we’re here today", "Nope. WPS Pixie attack, recovered in 17 seconds.", "As evidenced by this message, yes. And the router looks like it’s at least 5 years old.", "I used Wifite, I’m more of a script kiddie", "Script Kiddies are why we’re here today", "I used Wifite, I’m more of a script kiddie", "I used Wifite, I’m more of a script kiddie", "I used Wifite, I’m more of a script kiddie", "No chance of accessing wifi… Come on dude, are you a hacker or not?", "What router is it? You seem like a bit of a WPS hacking pro? Right? Prove yourself and upload a How-to", "Nope. WPS Pixie attack, recovered in 17 seconds.", "The guy whose wifi I’m using right now has “9e76a692” as his password. That’s pretty strong, right? Yet here I am. There’s always a way.", "No chance of accessing wifi… Come on dude, are you a hacker or not?", "As evidenced by this message, yes. And the router looks like it’s at least 5 years old.", "As evidenced by this message, yes. And the router looks like it’s at least 5 years old.", "Nope. WPS Pixie attack, recovered in 17 seconds.", "Are vulnerable WPS routers/AP’s still a thing nowadays? -Phoenix750", "Nope. WPS Pixie attack, recovered in 17 seconds.", "Let me guess… you used wifi-phisher? And default passwords don’t count  -Phoenix750", "Nice reference of my HackBack post  @Joe_Schmoe default wpa of router are a lot harder now and I didn’t see wep around. You are lucky to have such a weak password !", "The guy whose wifi I’m using right now has “9e76a692” as his password. That’s pretty strong, right? Yet here I am. There’s always a way.", "The guy whose wifi I’m using right now has “9e76a692” as his password. That’s pretty strong, right? Yet here I am. There’s always a way.", "Some people unfortunately set up strong wifi passwords  -Phoenix750", "No chance of accessing wifi… Come on dude, are you a hacker or not?", "[image] Shortly afterwards, @pry0cc found out that if you change your nickname to a command such as echo, then type in this: “@topic 882;something”, the command would be executed with “something” as an argument. The problem lied in the way the bot interfaced with discourse, by executing a shell co&hellip;", "grab it while it’s hot", "[image] Shortly afterwards, @pry0cc found out that if you change your nickname to a command such as echo, then type in this: “@topic 882;something”, the command would be executed with “something” as an argument. The problem lied in the way the bot interfaced with discourse, by executing a shell co&hellip;", "grab it while it’s hot", "It’s probably a leftover from when you didn’t have “&gt;” blacklisted and I did “@iplookup google.com&gt;&gt;test”", "[image] Shortly afterwards, @pry0cc found out that if you change your nickname to a command such as echo, then type in this: “@topic 882;something”, the command would be executed with “something” as an argument. The problem lied in the way the bot interfaced with discourse, by executing a shell co&hellip;", "grab it while it’s hot", "grab it while it’s hot", "It’s probably a leftover from when you didn’t have “&gt;” blacklisted and I did “@iplookup google.com&gt;&gt;test”", "[image] Shortly afterwards, @pry0cc found out that if you change your nickname to a command such as echo, then type in this: “@topic 882;something”, the command would be executed with “something” as an argument. The problem lied in the way the bot interfaced with discourse, by executing a shell co&hellip;", "[image] Shortly afterwards, @pry0cc found out that if you change your nickname to a command such as echo, then type in this: “@topic 882;something”, the command would be executed with “something” as an argument. The problem lied in the way the bot interfaced with discourse, by executing a shell co&hellip;", "Look what I found in a file called test: Looking up Google.comLocation: Mountain View, CA, United StatesWeather right now:  e[38;5;226m    \\   /    e[0m Sunny e[38;5;226m     .-.     e[0m e[38;5;226m75e[0m – e[38;5;220m77e[0m °Fe[0m      e[38;5;226m  ― (   ) ―  e[0m e[1m↘e[0m e[38;5;220m10e[0&hellip;", "[image] Shortly afterwards, @pry0cc found out that if you change your nickname to a command such as echo, then type in this: “@topic 882;something”, the command would be executed with “something” as an argument. The problem lied in the way the bot interfaced with discourse, by executing a shell co&hellip;", "[image] Shortly afterwards, @pry0cc found out that if you change your nickname to a command such as echo, then type in this: “@topic 882;something”, the command would be executed with “something” as an argument. The problem lied in the way the bot interfaced with discourse, by executing a shell co&hellip;", "[image] Shortly afterwards, @pry0cc found out that if you change your nickname to a command such as echo, then type in this: “@topic 882;something”, the command would be executed with “something” as an argument. The problem lied in the way the bot interfaced with discourse, by executing a shell co&hellip;", "[image] Shortly afterwards, @pry0cc found out that if you change your nickname to a command such as echo, then type in this: “@topic 882;something”, the command would be executed with “something” as an argument. The problem lied in the way the bot interfaced with discourse, by executing a shell co&hellip;", "A pretty simple thing, but it hasn’t been suggested yet for some reason. If it is possible, users who have reached a certain trust level (I recommend the “member” trust level) should have the ability to change the title displayed behind their names by themselves, and not have a mod do it for them. I&hellip;", "There are UAC bypasses available to acquire administrative access. What you require is a technique called DLL Hijacking and it is detailed here by our @Joe_Schmoe on Null Byte - Bypass UAC Using DLL Hijacking.", "We did it! 100 users!Hello 0x00’ers! A couple of weeks ago, this community started off as a fun new place to teach, learn and discuss Infomation Security, following the swift decline in activity at Nullbyte. Between three humble hackers on the #nullbyte IRC channel; Me, @oaktree and @unh0lys0da wor&hellip;", "Buffer Overflow incoming", "def print_staircase(length): print &quot;\\n&quot;.join([str(&quot;#&quot;*i).rjust(length) for i in range(length+1)])E: Now actually a function.", "for i in range(int(raw_input(&quot;Please enter the number of drivers in your family: &quot;))): print(&quot;The amount of insurance for &quot;+raw_input(&quot;Driver &quot;+str(i+1)+&quot; name: &quot;)+&quot;: $&quot;+str(str([1150 if (16 &lt;= age &lt;= 19) else ( 1050 if (20 &lt;= age &lt;= 25) else ( 900 if age &gt; 25 else 0)) for age in [int(raw_input(&quot;Dri&hellip;", "for i in range(int(raw_input(&quot;Please enter the number of drivers in your family: &quot;))): print(&quot;The amount of insurance for &quot;+raw_input(&quot;Driver &quot;+str(i+1)+&quot; name: &quot;)+&quot;: $&quot;+str(str([1150 if (16 &lt;= age &lt;= 19) else ( 1050 if (20 &lt;= age &lt;= 25) else ( 900 if age &gt; 25 else 0)) for age in [int(raw_input(&quot;Dri&hellip;", "for i in range(int(raw_input(&quot;Please enter the number of drivers in your family: &quot;))): print(&quot;The amount of insurance for &quot;+raw_input(&quot;Driver &quot;+str(i+1)+&quot; name: &quot;)+&quot;: $&quot;+str(str([1150 if (16 &lt;= age &lt;= 19) else ( 1050 if (20 &lt;= age &lt;= 25) else ( 900 if age &gt; 25 else 0)) for age in [int(raw_input(&quot;Dri&hellip;", "There is unreadable code. And then there’s JSchmoe code… -Phoenix750", "for i in range(int(raw_input(&quot;Please enter the number of drivers in your family: &quot;))): print(&quot;The amount of insurance for &quot;+raw_input(&quot;Driver &quot;+str(i+1)+&quot; name: &quot;)+&quot;: $&quot;+str(str([1150 if (16 &lt;= age &lt;= 19) else ( 1050 if (20 &lt;= age &lt;= 25) else ( 900 if age &gt; 25 else 0)) for age in [int(raw_input(&quot;Dri&hellip;", "def print_staircase(length): print &quot;\\n&quot;.join([str(&quot;#&quot;*i).rjust(length) for i in range(length+1)])E: Now actually a function.", "for i in range(int(raw_input(&quot;Please enter the number of drivers in your family: &quot;))): print(&quot;The amount of insurance for &quot;+raw_input(&quot;Driver &quot;+str(i+1)+&quot; name: &quot;)+&quot;: $&quot;+str(str([1150 if (16 &lt;= age &lt;= 19) else ( 1050 if (20 &lt;= age &lt;= 25) else ( 900 if age &gt; 25 else 0)) for age in [int(raw_input(&quot;Dri&hellip;", "for i in range(int(raw_input(&quot;Please enter the number of drivers in your family: &quot;))): print(&quot;The amount of insurance for &quot;+raw_input(&quot;Driver &quot;+str(i+1)+&quot; name: &quot;)+&quot;: $&quot;+str(str([1150 if (16 &lt;= age &lt;= 19) else ( 1050 if (20 &lt;= age &lt;= 25) else ( 900 if age &gt; 25 else 0)) for age in [int(raw_input(&quot;Dri&hellip;", "Brevity ftw! You really are a god xD", "def print_staircase(length): print &quot;\\n&quot;.join([str(&quot;#&quot;*i).rjust(length) for i in range(length+1)])E: Now actually a function.", "Brevity ftw! You really are a god xD", "def print_staircase(length): print &quot;\\n&quot;.join([str(&quot;#&quot;*i).rjust(length) for i in range(length+1)])E: Now actually a function.", "def print_staircase(length): print &quot;\\n&quot;.join([str(&quot;#&quot;*i).rjust(length) for i in range(length+1)])E: Now actually a function.", "def print_staircase(length): print &quot;\\n&quot;.join([str(&quot;#&quot;*i).rjust(length) for i in range(length+1)])E: Now actually a function."]}