{"user": "m0nly666", "history": ["anyone got any flags for Stratosphere 10.10.10.64 soon to retire ?", "you are only permitted to be on 1 team at a time", "What level do you need to be to be added to team? do you need to be a “hacker” already or can u join at any rank?? also I have HTB group on FB “Hackthebox”", "you are only permitted to be on 1 team at a time", "The #htb channel on IRC is going to be the better place to ask these questions. This thread is solely for spreading info about joining the team.", "got user on 10.10.10.92 MIscheif … any hints to root?", "anyone got any flags for Stratosphere 10.10.10.64 soon to retire ?", "What do you all think is the best botnet available at the moment? would you consider this one? What are some of the harder botnets to detect ?", "What do you all think is the best botnet available at the moment? would you consider this one? What are some of the harder botnets to detect ?", "What do you all think is the best botnet available at the moment? would you consider this one? What are some of the harder botnets to detect ?", "you are only permitted to be on 1 team at a time", "The bot is such a genious… undetectable… simply awesome!", "Great write up, and major respect to all who helped you .", "Great write up, and major respect to all who helped you .", "There’s no requirements of any sort. Literally as simple as pinging me with your HTB nick and I will add it to the team. You should then see an invite in your account settings and it’s done. Note: There is no time requirement either. I will be happy to add people ad infinitum.", "There’s no requirements of any sort. Literally as simple as pinging me with your HTB nick and I will add it to the team. You should then see an invite in your account settings and it’s done. Note: There is no time requirement either. I will be happy to add people ad infinitum.", "What do you all think is the best botnet available at the moment? would you consider this one? What are some of the harder botnets to detect ?", "Great write up, and major respect to all who helped you .", "Exactly 100 days ago from my writing this, my lab access for Penetration Testing With Kali (PWK) began. PWK is a course offered by Offensive Security intended to prepare you for the OSCP certification exam, a grueling 24 hour endeavor where you must hack roughly 4 out of 5 computers assigned to you &hellip;", "What level do you need to be to be added to team? do you need to be a “hacker” already or can u join at any rank?? also I have HTB group on FB “Hackthebox”", "Ya not looking for hand outs, reason i am on HTB is to sharpen my skills and keep me active obviously i wont turn down flags/walk trough/hints/tips", "Ya not looking for hand outs, reason i am on HTB is to sharpen my skills and keep me active obviously i wont turn down flags/walk trough/hints/tips", "Hey m0nly666! This one, like most of them, are what’s called Jeopardy style CTFs. They’re multiple categories and different difficulty levels per category. This one consisted of: Reverse EngineeringPwnableCryptographyForensicWeb SecurityMiscPeople may join teams and take on these challen&hellip;", "What kinda CTF? Red VS Blue? Team VS Team ? or free for all?? new here and just curious of the setup", "Ya not looking for hand outs, reason i am on HTB is to sharpen my skills and keep me active obviously i wont turn down flags/walk trough/hints/tips", "Can you be more specific about what steps you are following exactly and what issues you are encountering?", "Watching this vdo and still having issues with the Deserialization, basically done the full walk though, keeps giving me an error at the step before the rce code. tried it twice now and get stuck at the same place the same time"]}