{"user": "mf_redstars", "history": ["Sure thing, good luck.", "@mf_redstars Thanks for your suggestion, but as the title says, I’m searching for an active scanning technique. I’m trying to collect information that no more passive gathering can give.", "I’m not sure if anyone mentioned this, but try to also think of this from another angle. (Which is a core fundamental of infosec  ) Research passive information gathering. The more information you have about the target the more ways you can reduce your  ‘active information gathering’. You could uti&hellip;", "When I started studying and learning about exploit development, one of the biggest issues I ran in to was finding a good starting point. I am by no means an expert in this field, but here is a list of some of the material I found helpful while learning (I still am learning and will always be) to res&hellip;", "mf_redstars- Flesh and blood human beings just like you and I have gone to the moon. They did this in an age where information and technology was far less available. Too many have lost site of what the Internet is under all the bullshit: it is the Cosmic Library, the repository of humankind’s acc&hellip;", "mf_redstars- Flesh and blood human beings just like you and I have gone to the moon. They did this in an age where information and technology was far less available. Too many have lost site of what the Internet is under all the bullshit: it is the Cosmic Library, the repository of humankind’s acc&hellip;", "Thank you for writing this up. It gives me hope as someone who’s self taught with no degree and I’m currently doing my OSCP. I’m currently at the Director level in a very large corporation with the hopes of moving into InfoSec either internally or externally.  Most people I’ve spoken with who are cu&hellip;", "Thank you for writing this up. It gives me hope as someone who’s self taught with no degree and I’m currently doing my OSCP. I’m currently at the Director level in a very large corporation with the hopes of moving into InfoSec either internally or externally.  Most people I’ve spoken with who are cu&hellip;"]}