{"user": "Nanobyte", "history": ["The easiest option I can think of is fileless malware: malicious code that is loaded into memory without being stored on the disk. This kind of malicious code works by being passed on to a trusted program, typically PowerShell, through a delivery method that is usually a web page containing JavaScri&hellip;", "0x00sec GuidelinesCore PrinciplesActions have consequences.You can learn anything from anyone.Ask good questions, not lazy ones.Everybody makes mistakes.Freedom of information is a right.ForumsWhen posting something on the forums, consider these points. Will this be helpful to users othe&hellip;", "If you’ve never done a CTF before, this is your chance! They are security challenges people create to up your skills. THIS is how you get better at security. THE GRIND!!! This appears to be a beginner CTF. Categories include: RE, pwnable, cryptography, forensics, websec, misc Pick one you want&hellip;", "Well, you’re out of luck then. There is no way to bind an executable to an image without preserving the extension. If you change the extension your file won’t be interpreted as an executable anymore, so any instruction inside the file will be treated as binary data instead, unless you manage to find&hellip;", "The best interview till now … Great deal of inspiration!", "The best interview till now … Great deal of inspiration!", "Cybrary .it is a good option", "The best interview till now … Great deal of inspiration!", "The best interview till now … Great deal of inspiration!", "Heya everybody!Today, I bring you another Knowing Null Interview with the man you all voted for: fraq! Be sure to stick around after the interview to vote for the next subject. If there’s a question you’d like to see asked in future features, go ahead and leave a comment or ping me on IRC. Here. &hellip;", "Cybrary .it is a good option", "Introduction to Quantum Computing :: Part #1Hello everyone, I hope you are having a wonderful week, day or month. My name is Thirsty-Robot a wannabe hacker that is not really into hacking. I enjoy it, but what I’m really into is theoretical computer science, and also programming. For the past 2 mo&hellip;", "The thesis I presented for my diploma was about physical security, with BadUSB devices taking the most amount of pages. I saw there’s already a pretty good post on how to make your own BadUSB starting from a vulnerable stick (click) but I’d like to make another contribution in the same subject by pr&hellip;", "What’s up boys &amp; girls? Before we enter the world of pentesting, first of all we have to prepare for that. It’s important to know how to learn. The reason for this is the quantity of the information you will collect and you have to work with. Furthermore it’s important to structure your thoughts, n&hellip;", "Hello everyone, My group’s interests is in the intersection between robotics and security. After having been reading for a few months, this is my first post. I hope you find it somehow interesting. Disclaimer: I work at Alias Robotics. I plan on starting to share a few bits here about our work. Hop&hellip;", "Kali is cool, but what do you think about Arch with BlackArch Repo’s? I never really understood why people use Kali, and then install it, when you can install all the packages manually, and have a better system. Do you find Kali is stable? I always find Kali breaks whenever I use it.", "Welcome Back to Knowing Null!This week, you voted to bring in ricksanchez! Let’s just jump right into it.First, I’d like to thank you for joining this series of course, anytime  If people really feel the urge to get toknow more about me this is the perfect chance! Can you tell me and the read&hellip;", "IntroductionThis paper is how to setup your own Honeypot (dionaea). I would say most of us like Reverse Engineering binaries. Many of us have a fascination with malware. Why not combine them and RE some Malware that’s actively being used for exploitation? My tutorial is how to setup a honeypot on &hellip;", "Here’s all the malware I’ve been collecting from my honeypot. Enjoy the Park! [image]", "[+] METHODOLOGY AND PROCESS MODEL Today’s digital world is perpetually evolving, becoming an intrinsic part of our lives, reaching almost every aspect of our society. Criminal Investigations are no exception. However, having technical knowledge and using tools alone is not enough to fully and prope&hellip;", "The difference between evolution and devolution is simply a matter of perspective", "Welcome back to Knowing NullKnowing Null is a series of interviews randomly conducted on the 0x00sec IRC server and compiled here for your convenience. Today’s guest is the ever present pry0cc! But, first, a poll! Who do you want to see next time?fraqdtmricksanchezzSecsprtn0x00pfPhoenix&hellip;", "Exploitation in 2018 - How Pentesting Has ChangedHi 0x00sec! This is the next installment of my pentesting series. If you missed my last two articles, you can read the first one here and the second one here. They are heavily OSINT focussed, and naturally, the next article should be about active rec&hellip;", "Hello again! The results of the poll from my last post are very clear, so I’ve decided to go forward with the “Intro to Digital Forensics” topic Like I previously mentioned, this post will cover various topics regarding Digital Forensics, hopefully serving as a good introduction to the field. I’m n&hellip;", "As requested by @pry0cc, well, not really a request… more like I threw out there a idea and pry volunteered me to do a tutorial. Ok, fine, I guess. Anyways, with that all being said and done as the name suggests this is how to securely connect to IRC using Hexchat and ToR. It isn’t that complicated,&hellip;", "OSINT - Passive Recon and Passive Discovery Of AssetsSup 0x00’ers, to kick this badass series off, I am going to begin with the most important aspect of pentesting. Passive Recon and OSINT. Now, do not let the word ‘passive’ fool you. This is no light recon, you can uncover vast amounts of infomati&hellip;", "I think I will give a small youtube on my plans because who cares, probably with adjoined hangouts so people can join next week, will see if I can rope fraq etc in", "The core would likely be prototyped in csharp or perl but the actual idea is infrastructure based there is no reason anyone could not for instance add a handler for a specific attack vector signature in php or vb  distribution being the king and all", "Hopefully not perl…", "The core would likely be prototyped in csharp or perl but the actual idea is infrastructure based there is no reason anyone could not for instance add a handler for a specific attack vector signature in php or vb  distribution being the king and all", "Hopefully not perl…", "Loved your idea ! In what language would you believe it is better to be developed?", "Good day all, I have a fun project I would like to invest some time into and am interested if anyone would like to join me on the voyage. Quite simply it is an extension of a honeypot, though one with an odd response. When an inbound attack is sent it is caught and run through an engine I will de&hellip;", "OSINT 0x02 - LinkedIn is not just for jobsSup 0x00’ers, that’s right, I am back with another banger of an article, ready? If you read my last article on OSINT, you’ll know a little bit on how to find dirt on companies, their assets, and how to do all of that passively. Well now I am going to show &hellip;", "Yeah, this is a great idea with caveats. Let’s call this what it is: A mentorship program. I’d love to see labels by names that call people out as mentors who can help people with the things you mentioned such as suggesting topics, providing editorial assistance, etc.", "@pry0cc and @fraq  recently announced that 0x00sec will be reformed. They did this in an internal thread in the VIP loungue. I am not the right person to explain it to the big public (the staff will do in the near future probably), but basically we want 0x00sec to be more varied instead of being sol&hellip;", "This is a PoC-style test run for an application that I am currently developing as a personal project. Should anything weird happen, please report it to me and I’ll try to fix it. This is just a simple crackme so it shouldn’t be too hard once you start to figure out what’s happening… maybe…?  Diffic&hellip;", "I thought this was pretty funny.  [25%20AM]", "Message to Mods: I don’t know what category to put this inBDE is a project im working on to get all the data i can from the SQL tables each browser saves Author Assigned Level: WannabeCommunity Assigned Level:NewbieWannabeHackerWizardGuru0voters Show resultsRequired Skills&hellip;", "You have a point . Typos always happen . I corrected already .", "thats cool and all but how you gonna spell recently like that my guy…that dosent look wrong to you when you type it out?", "You have a point . Typos always happen . I corrected already .", "Introduction While testing some android apps on an emulator it shows that the app is not compatible with CPU or getting some error while installing the app on your emulator i will show you how to bypass that easily Notice This may not working with some apps and you will have to use another techn&hellip;", "yes, please do more of these  binaries welcome too…", "PrefaceThis quick article will give a short introduction on what fuzzers are, how they work and how to properly setup the afl - american fuzzy lop fuzzer to find flaws in arbitrary projects. Well known alternatives to afl (for the same or other purposes): boofuzz: Network Protocol Fuzzing for Hu&hellip;", "As alot of people mention in here, never stop searching. I started wheb i was 12 and I started with C++ it took me a long time to really understand it. Every now and then I saw speed coding videos and every little thing I didnt ubderstand I reseaech it. I also read CTF walktroughs even if I wasnt do&hellip;", "I love the fact that this has to do with processor arch. Give us more", "I love the fact that this has to do with processor arch. Give us more", "ARM Crackme - Starting with EOR@Wunkolo and I have decided that there aren’t enough ARM crackmes on the forum and that we should add a few for people that are interested in learning how the architecture works and for those that just want to show their skills  We will start very easy with some chal&hellip;", "I love the fact that this has to do with processor arch. Give us more", "In our walk in linux, there comes a point where we need to hack ( pentest ) in a safe environment. The first thing we usually do is install Virtualization Softwares and install all the distros our system can take. In stages of hacking, to compromise the victim machine, we need some sort of program t&hellip;", "Recently Microsoft released the source code for the Windows NT File Manager . Consider taking a look ! https://github.com/Microsoft/winfile/tree/master/src", "IntroductionHi I&#39;m back again, a plesure to be writing again for everyone on this website. A few days ago I got my hands into a CTF which I&#39;m quite hook on. So I came back and worked overnight because I have also some personal projects.WARNING:  EVERYTHING I’M TYPING AND TEACHING IT’S JUST FOR ED&hellip;", "Hello all, Nestor10 here to share a couple things I’ve learned in my day job as an infosec samurai. If you want to know some vague things about me, you can check out my introduction. So a few months ago, I noticed some emails coming in with really sketchy attachments - a few dozen had been delivere&hellip;", "IntroductionIt was 7:20 pm on my small city, I just buyed a new computer so I was installing Kali, and browsing Vulnhub for a cool and fast CTF.  I stumbled upon a CTF called DEFCON Toronto: Galhad it’s difficulty was on easy, so I guessed It was time for me to play a little.  Warning: EVERYTHI&hellip;", "Knowledge is Power But like all power, there are those who want to keep it for themselves but em not one of them. I was feeling bored and I start checking my bookmarks and I found these linked in my bookmarks so I thought I should make a list and share with others because knowledge should be free .&hellip;", "Recently I moved into a new suburban neighborhood littered with default router access points. One day, I decided I wanted to test my luck and see what I could get by using a simple but very effective Wordlist A few years ago I use to work as a cable installation technician. I’ve noticed most techni&hellip;", "Greeting to the Community of 0x00sec , I am Nanobyte and this is my first post on this forum so please excuse me for any mistakes or any misinfo that I may write! This essay is about the rise of mobile technologies and the rise of the newest technology the 5G so without further a do … For someone&hellip;", "Greeting to the Community of 0x00sec , I am Nanobyte and this is my first post on this forum so please excuse me for any mistakes or any misinfo that I may write! This essay is about the rise of mobile technologies and the rise of the newest technology the 5G so without further a do … For someone&hellip;", "The ProjectI started programming an encrypted chat client and server to learn more about encryption and how it’s implemented in network protocols (e.g. SSH or HTTPs over TLS). Now that it’s almost complete, I wanted to share what I learned with you. I’m splitting up this series into two posts. The&hellip;", "So, I am again up with a new article to share. It is a great write-up by Rob Brown. It is about penetration testing an Active Directory. This is useful for the penetration testers who are into internal penetration testing. https://markitzeroday.com/pass-the-hash/crack-map-exec/2018/03/04/da-from-ou&hellip;", "Really loved your essay there … But don’t you think that hackers can be more than just techies? I mean Psycology, Biology , Neuroscience (even astrophysics) are considered hackable sciences too … Not to mention that there is plenty of curiousity for such fields !", "I would honestly expand that a bit further and say we need the weird thinkers in every discipline. We need medical hackers. We need agricultural hackers. We need all kinds of hackers in every field.", "This totally reads like a counter part to the not too long ago published phrack article The Fall of Hacker Groups. While it was an interesting read with a lot of truth in it I think the author neglected the part that hackers in general somewhat evolved over time too, even when trying to stay close &hellip;", "Of course I don’t think that they only exist within high-tech.", "Of course I don’t think that they only exist within high-tech.", "Really loved your essay there … But don’t you think that hackers can be more than just techies? I mean Psycology, Biology , Neuroscience (even astrophysics) are considered hackable sciences too … Not to mention that there is plenty of curiousity for such fields !", "We Need Hackers Now More Than EverI“Yes, I am a criminal. My crime is that of curiosity.” In the years since The Hacker Manifesto was first typed out, much of the internet has changed. It has grown in both size and scope. New protocols have been invented. The web was born. It is altogether diffe&hellip;", "Freestyle February: A 0x00sec Article ContestHello 0x00ers! The 0x00sec Staff is happy to announce our first annual Freestyle February! Here’s how it works: Take up until the last day of February to research something technical, something from which the 0x00sec community might benefit. Then, po&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "LYNXI have been into web scraping for a long time, since the first time I realized people will pay for large neatly organized data. I came across something interesting and wanted to pass some knowledge onto others. Lynx is a command line based browser. I first discovered it when I had my first Linu&hellip;", "IntroductionLinux has been around for 25 years now. I started using it as my main OS around 2 years back (was quite young then and n00bish). I did not care to learn much about it, I just used it to do my homework and some personal stuff. Not long ago I decided to switch to ArchLinux from Ubuntu Mat&hellip;", "If you are reading this is because you want to be a hacker. Therefore, you are automatically a wannabe. It does not sound that cool, but it is actually pretty cool. It means that you still have a lot of exciting things to discover!!! First things first. This is going to be a joint course on C and a&hellip;", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "Hello, 0x00sec! Before discussing my project, I want to introduce myself a little; if you’re more interested in xcreds, feel free to skip to the bottom. Introduction I’ve been reading 0x00sec for a while, but have held off from creating an account until I had something interesting to share. I use&hellip;", "This isn’t going to be specifically about OpenBSD, because without taking Linux in comparison, you’ll miss details on how things have turned out to be. I have been spending some time lately following what the situation is on the BSD front and in the Linux community, and I apologise in advance if I h&hellip;"]}