{"user": "Ninja243", "history": ["Since I haven’t been so active in the past few months because of my lack of time, I’m coming back with some new knowledge to spread around. The 0x00sec drone is on the way to be accomplished right? So why not understand how drones generally work and even build your own. Disclaimer: All the informat&hellip;", "I feel like the same thing could be achieved using GitLabs Free Tier and setting the repositories to private. Means we don’t necessarily lose stuff and you reclaim a server. Unless of course there’s stuff on the Gitlab that we wouldn’t want on GitLabs servers… If you’re looking for ideas for the n&hellip;", "Honestly, the best way (in my opinion) to learn this kind of thing is via CTFs (Capture the Flag competitions). They’re a great way to network and learn how to break into systems, plus if you’re good enough, some prize money might be involved too. Feel free to join any of the ranked competitions he&hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Hey thanks, I’ve been meaning to practice SQLi. I’ll dig through my links for tutorials and post them here when I find them, if that’s acceptable. These links were of use to me, hopefully to you all too: https://www.w3schools.com/sql/sql_injection.asp https://www.incapsula.com/web-application-sec&hellip;", "https://github.com/colental/byob Built this to teach myself Python. Any thoughts?", "Hey man, Great work with the series. I have been in infosec for quite a while but still consider my self as a noob. I am sure you have a lot of work to do but i was wondering when will be your next article will be out? and if it’s possible, can i also help you out with this series by contributing&hellip;", "IntroductionThis paper is how to setup your own Honeypot (dionaea). I would say most of us like Reverse Engineering binaries. Many of us have a fascination with malware. Why not combine them and RE some Malware that’s actively being used for exploitation? My tutorial is how to setup a honeypot on &hellip;", "Hello, fellow 0x00’ers! First off, I lied. It’s not a botnet. But it enables you to achieve botnet-like abilities. Today I am going to show you something that has been kept a secret for a long time in the hacker community and has never really been made accessible to the average hobbyist. With this&hellip;", "OSINT - Passive Recon and Passive Discovery Of AssetsSup 0x00’ers, to kick this badass series off, I am going to begin with the most important aspect of pentesting. Passive Recon and OSINT. Now, do not let the word ‘passive’ fool you. This is no light recon, you can uncover vast amounts of infomati&hellip;", "It seems we have some interest into this project so I will be setting up a private project tracker to it, will repost login details as they become availible", "Good day all, I have a fun project I would like to invest some time into and am interested if anyone would like to join me on the voyage. Quite simply it is an extension of a honeypot, though one with an odd response. When an inbound attack is sent it is caught and run through an engine I will de&hellip;", "OSINT 0x02 - LinkedIn is not just for jobsSup 0x00’ers, that’s right, I am back with another banger of an article, ready? If you read my last article on OSINT, you’ll know a little bit on how to find dirt on companies, their assets, and how to do all of that passively. Well now I am going to show &hellip;", "[image]           So, that’s my A E S T H E T I C setup. The wallpaper changes it’s color and brightness based on time. This is the evening/morning wallpaper, the night one is darker and purplish, the day one is brighter and overall more day-ish. I gave Gnome3 a try just &hellip;", "I feel super lame here because I don’t actually pimp my setup all that much, but I am very particular about my workspace and workflow. I also don’t think of my setup in terms of one box. It’s all about a workflow and an infrastructure for me. I don’t operate a computer; I harness the power of cloud &hellip;", "Keen on trying out a distro that has awesome driver support and just works? Give Pop_OS! by System76 a chance. It’s not exactly lightweight, but so far it’s proven to be more stable than Windows 10 while looking a lot better. If you do though, try not to impulsively restart your PC or laptop if you &hellip;", "So people have been jamming it in virustotal? The audience was extremely small. I am surprised as to how it’s gotten out.", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Hey mates! After roughly 30 hours of work, I’m now finished with my own Android Remote Administration Tool . It was my holiday project, which I planned several weeks before. Argus - RAT is of course named after the giant in the Greek mythology. But… I think that’s not interesting for you . Let’s di&hellip;", "While you may refer to this program as “0x00sec’s RAT,” 0x00sec is not liable for damages caused by malicious use of this program or any of its components.", "IntroductionIt has been more than a year since I published the concept of infecting an executable with shellcode here and recently I have been motivated to develop another PoC which follows the same path but at a more advanced level combining knowledge and techniques that I have learned since then.&hellip;", "The following paper documents a possible PE file infection technique which covers a high level overview and the low level code of how both the infection and the resulting payload is executed. Please note that some of the following material may not be suited for beginners as it requires: Proficiency&hellip;", "I actually have Late 2011, regardless, this era of MBP’s run Arch amazing. I went one step further and installed an SSD as well, and boy is it nippy. You might find the battery is dying because it is old, mine is starting to go as well. You can get a brand new battery on ebay for these models for a&hellip;", "What about hosting a site on it? That’s what I’ve done to my Pentium 4 tower", "The paper you posted describes which scans will leak the IP, you would simply avoid those combinations, which I don’t use any of those anyway. Sometimes OS detection but that can be done through plenty of other techniques.  [31%20AM]", "What about hosting a site on it? That’s what I’ve done to my Pentium 4 tower", "Hey @Remz, here ya go: Yeah, no excuses... + Foxcatcher! [Part 1]. Also, I made a little addition to this, in the same Profile Folder, firefox stores a three interesting files: key3.db, key4.db and logins.json. This is where a user’s passwords and login credentials are stored! So I changed the code&hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Unfortunately not due to the fact that I’m extremely busy with school and after school tutors, so I simply don’t have the time. But if you (or anyone else) would like to add to this, make a second installment or use this elsewhere, then please do!", "I’m glad to see so many people having fun with this. I know i am. I created this thread before i read the rules regarding discussing the lab. Too late now.", "Firstly, due to my insane schedule, I do not get to interact with all of you as I would like. Let me take this opportunity to state that many of you are doing incredible work with the content of your posts; I do read just about everything released here on the Big 0; I am proud to be here among such&hellip;", "Hello. I need some help  I am supposed to crack the authentication algorithm used in SIM cards - called comp128 V2 . It is used in authenticating your sim with the network using SIM secret key ( and getting this key is my target  ). V1 of this algorithm was cracked long ago (before 2002) but it is &hellip;", "##– What is the “Penny”-Guide? – With this guide I want to help the newbies who wants to enter the world of IT-Security and give them a picture which is (in my opinion) essential to understand that it’s much harder than you think. There is a lot of theory and much more practice behind it. ##– My &hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Use Hackbar ( a mozilla add-on ), which i think you will like…https://addons.mozilla.org/en-US/firefox/addon/hackbar/ Or, just a programming language… ( Javascript used as an example… ) function send_post(){var url = &quot;https://www.hackthebox.gr/api/invite/generate&quot;;var postdata = {&#39;dataType&hellip;", "Hey all! Due to a bit of a dispute with my previous DNS provider, the first link (with regards to the lag code) has broken. A replacement can be found here and while I’m at it, those two long and unsightly Google links should have looked like this (LAMP setup) and this (Aircrack-ng on Android), res&hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Hello 0x00’ers! As you may understand, this site does cost us money at the present. It is the sacrifice we have to make while we don’t use ads. (Ads suck). However we have multiple donation platforms available at the present. To add to this list of possible methods, we are pleased to announce our n&hellip;", "Great cheatsheet  My go  to command for sqlmap is $ sqlmap --level 5 --depth 3 --dump-allTakes fair amount of time TBH, but does the job", "Hello NullSec, Joker here with another tutorial or cheatsheet depending on how much in detail I go. This time I am gonna go over one of my favorite tools that I at first overlooked the potential. SQLmap is officially a automatic database takeover tool. I’ve been able to successfully “hack” databases&hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Realmode Assembly - Writing bootable stuffPart 1: Theory and ConceptsWhat is this?This is going to be a walk-through in writing  Operation Systems in assembly which operate purely in Realmode. Goal will be writing different kernels from a simple “Hello World” over small terminal programs to gr&hellip;", "This is what it feels like to hack via SSH on phone…", "Hoodies are cool. 0x00sec is cool. You know what is even cooler? 0x00sec Hoodies.We get it, you’re a badass, and you love hacking + computers. But you would look even more badass with one of these bad boys. [image][image]Do you want something more understated? Okay. We gotcha.  [image] [i&hellip;", "Ah, this is the thread I’ve been craving  I’ve had multiple phones, most of which have expired due how poor they are at lithobraking. (Honestly, they fell and broke but I’m not accepting responsibility therefore ) Anyway, here are some screenshots of the phone’s I have abused so far: – LG G3 (D85&hellip;", "Ah, this is the thread I’ve been craving  I’ve had multiple phones, most of which have expired due how poor they are at lithobraking. (Honestly, they fell and broke but I’m not accepting responsibility therefore ) Anyway, here are some screenshots of the phone’s I have abused so far: – LG G3 (D85&hellip;", "Ah, this is the thread I’ve been craving  I’ve had multiple phones, most of which have expired due how poor they are at lithobraking. (Honestly, they fell and broke but I’m not accepting responsibility therefore ) Anyway, here are some screenshots of the phone’s I have abused so far: – LG G3 (D85&hellip;", "Did you ever finish the stager functionality? I’d be interested to see that. You’ve completely left this project stagnant for ages!!! Smh  Just kidding Joe.", "Don’t backdoor with the whole executable ya silly goose, use msfvenom to create download and execute shellcode (or make your own, wink wink)", "If you need some help with that, you know who to talk to.  Also, cool little framework.", "[image]? 100k1n9 4 r3fUd", "the super stelfy shell is a good idea is this a community project??? if so we have some suggestions. Keep the shell basic - cd/isadmin/bypassuac/download/upload/persist/help etc… Just keep the basicsPut dumpchrome ff and others in there own individual files makes your job easier.Encryption???K&hellip;", "I had read the ARM assembly basics but not this article. It is very useful. Actually I wanted to use something different than Raspbian and use other ARM machines (RAM is limited to 256 Mb with versatilepb) but hey, it is working  Some of you may wonder why I complain about the versatilepb memory li&hellip;", "Bit of a self promo but I somewhat recently finished an in-browser ARM assembler and simulator that might aid in some understanding of ARM. Features the full GAS syntax but it has its crashes here and there.  [image]", "The phantom 3 looks like it can lift a pi. Not sure about jumpers.", "Ah damn another wiki page i have to bookmark in case i win the lottery or this fine Nigerian prince is finally sending me these 50 million $ Edit: as of right now all of the amazon links are a dead end and are showing “the dogs of amazon” lel  [image]", "Imagine this: You’re a pentester. A long-lost relative has left you a fortune in his will. To keep the money, you have to fulfill just one wish: spend it all on tech (from Amazon, because then you’d be buying a beer or some server time for 0x00sec while still getting some cool stuff for yourself). I&hellip;", "Tor hidden services and a relay (like onion.to) if you don’t care about high bandwidth (meterpreter works this way). Front-gun servers for anything else. …and the wannacry binary is a piece of joke", "@Evalion maybe this in a combination with “we have to get this shit released as fast as possible before everyone knows/read the nsa leak” @dtm i heard their support hotline was awesome and people way faster in reacting and more friendly. They even gave discount on the ransom to pay in some cases. N&hellip;", "Good points indeed, but something tells me they never anticipated that their attack would be this massive. “Aight guys let’s use this exploit and let’s infect some home netw… HOLY SHIT WE INFECTED HALF OF EUROPE!”", "1.) Connect VPN + TOR in this arrangement: You -&gt; TOR + VPN -&gt; VPN -&gt; destination 2.) do some google dorks for stolen credit card dumps. 3.) Buy BTC with them 4.) Send the BTC to another address in your wallet. Do this atleast 3 times. 5.) Send your BTC through a mixer service. 6.) Again, send &hellip;", "[image]I mean, if these skrubs can do it, so can anyone else.", "Links?  Asking for a friend", "You can host C&amp;C through Tor hidden services. The trick however is bundling tor with your malware. Some server hosts will also let you pay with Bitcoin. Usually only you have paid with a card however.", "I read some malware analysis’s articales about some malwares like this one : https://kjaer.io/extension-malware/ and the malware writer in this case just got host from DigitalOcean and as i know he didint got caught. So there must be another way", "For education purposes: You hack a (web)server and use that as a C&amp;C", "Ah, this is the thread I’ve been craving  I’ve had multiple phones, most of which have expired due how poor they are at lithobraking. (Honestly, they fell and broke but I’m not accepting responsibility therefore ) Anyway, here are some screenshots of the phone’s I have abused so far: – LG G3 (D85&hellip;", "Ah, this is the thread I’ve been craving  I’ve had multiple phones, most of which have expired due how poor they are at lithobraking. (Honestly, they fell and broke but I’m not accepting responsibility therefore ) Anyway, here are some screenshots of the phone’s I have abused so far: – LG G3 (D85&hellip;", "Some people say that there are three things you have to do before you die: Write a book, have a child and plant a tree. Actually, the three things you have to do before you die are: write your own IRC bot, create a massive framework that only you will ever use and code an awesome  Linux kernel modul&hellip;", "I try to set permission in my LKM with this little piece of code and it works perfectly : // set permission for all users in read and write (stop cmd chmod 0666 in dev device) static int uevent(struct device *dev, struct kobj_uevent_env *env){ add_uevent_var(env, “DEVMODE=%#o”, 0666); return 0; &hellip;", "Ah, this is the thread I’ve been craving  I’ve had multiple phones, most of which have expired due how poor they are at lithobraking. (Honestly, they fell and broke but I’m not accepting responsibility therefore ) Anyway, here are some screenshots of the phone’s I have abused so far: – LG G3 (D85&hellip;", "Ah, this is the thread I’ve been craving  I’ve had multiple phones, most of which have expired due how poor they are at lithobraking. (Honestly, they fell and broke but I’m not accepting responsibility therefore ) Anyway, here are some screenshots of the phone’s I have abused so far: – LG G3 (D85&hellip;", "Tip: don’t get Samsung… (Don’t hit me)", "iPhone. Ringtone: defaultText tone: defaultBackground: not default", "Hello members, I just joined this forum and is a nice place to meet people and discuss, I’m really happy for this. Now I want to ask if you have got a smartphone, and what do you have, if is Rooted (Android) or Jail-broken (iPhone), ROM, recovery, kernel, security/privacy apps, and whatever you ha&hellip;", "Hey, thanks for a great article! To stay under the radar, I use some, umm, unorthodox methods. There are some old CTF servers I found like this one that have levels on the server. To solve the levels and get the flags, the user has to SSH into the server. To anonymise myself, I SSH into the CTF se&hellip;", "Scripts To Rice Your SetupSo in the progress of installing my Arch and ricing it, I also installed screenfetch. Screenfetch is a small program to get one of those nifty terminal theme information + ASCII distribution logos you see in everyone’s screenshots nowadays. It’s automatically detectin&hellip;", "In our walk in linux, there comes a point where we need to hack ( pentest ) in a safe environment. The first thing we usually do is install Virtualization Softwares and install all the distros our system can take. In stages of hacking, to compromise the victim machine, we need some sort of program t&hellip;", "Since 0x00sec’s conception, 0x00sec has relied entirely on the wallets of the admins, as well as the donations from kind people in the community for funding. Starting today, the new official sponsor of 0x00sec is Sequoia Cyber Solutions!  [Sequoia]These guys are doing some really great things wit&hellip;", "Awesome, that’s great that we have a sponsor!", "ZSH is hands down my favorite shell. @pry0cc  Fellow powerline user here. I too go with a blue color scheme. Actually, I think I used some of your dots to help out with my setup! [image]", "[image]That’s mine for the weekend. So you’re good", "IntroductionThis article serves to showcase a few ways a Virtual Private Server (VPS) can be utilized. This is a general level overview and is intended to spark interest. For help obtaining your own VPS I suggest you drop on by the #0x00sec IRC channel. In this post you will learn: What a Virtua&hellip;", "Nice little tutorial you’ve got here! I must say, I’ve never heard of Flask before this…", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "Getting Stealthy with StelfHello 0x00’ers! In this tutorial, I am going to be giving away some content that has been sought after for a long time. Everybody knows that most prebuilt tools such as Metasploit don’t work, payloads generated by them, or encoders used with them. They get picked up by a&hellip;", "Unfortunately there are no CTF’s without hard stuff because otherwise I would’ve participated. Good write up. +1 -Phoenix750", "Well, I finally finished ricing my system. Took awhile because of some delays I had.  [image]Operating System: Kali Linux Ricing: i3 Window Manageri3blocks for statusTermite terminal emulatorAtom text editordmenu for applicationsWeb Browser: Firefox-esr with some of twily’s configs Not&hellip;", "One problem with having two monitors: It’s hard to find two books with exactly the same widths for raising the monitors.", "Sometimes the needle IS the haystack", "Hello, 0x00’ers! Welcome to my third (Yes 3rd) instalment of Paranoia and a Terminal! In this episode we will explore URL Forensics - for the Paranoid. In other terms, viewing a site or viewing a link, without falling victim to a social engineering attack if our spidey sense rings alarm bells. Scen&hellip;", "0x00sec turns 0x01!We made it, guys! 0x00sec is a year old. We went from a simple Jekyll blog with only three articles to a respectably-sized, full-on forum with over 500 users. Each day, one or more people took a chance and signed up. [image] Countless Introductions showcase our diversity of int&hellip;", "When @dtm has too much time on his hands, he hacks games. When I have too much time on my hands…  [image]EDIT: No this isn’t my speaker burning, but I’ve done similar things, if not worse. EDIT 2: For those crazy enough to try this (or those who have lost their will to live): you can achieve thi&hellip;", "You are bringing back a lot of childhood memories with that pic. (No, I wasn’t reversing games. I’m talking about Pinball.)", "MIND-BLOWN This is, really cool. So cool infact, I may have to go change. The best shells and rats are the least known ones - Because you don’t have to AV to worry about.", "Learned that the hard way in me school’s English class", "Hi fellas, The time is came to publish the first release of unDLP. This journey was scattered of obstacles coming from the old and venerated Perl gods ! But that’s not all, hold on, the famous TLS protocol  made me sweated more than once … bloody block size limitation …  Well, before I get into th&hellip;", "Yeah, I guess. If you’re infecting an executable by adding extra data, of course the resulting binary’s signature will be compromised. If you want to sign an executable without the warning message, you’ll need to acquire a certificate from a trusted authority like Verisign, or perhaps you can check &hellip;", "Oh sweet. Is that just simple metadata modification? Also, would that affect the signature? I would like to find a way to sign executables so as to remove the “this publisher isn’t trusted” message.", "Honestly, the best way (in my opinion) to learn this kind of thing is via CTFs (Capture the Flag competitions). They’re a great way to network and learn how to break into systems, plus if you’re good enough, some prize money might be involved too. Feel free to join any of the ranked competitions he&hellip;", "Jan Wikholm wrote his experiences down and recorded them in a vlog from day 0 till his certificate of the OSCP. Tells you what he focussed on and what he used to attain his OSCP certificate. As said above, he learned loads from CTF’s. https://localhost.exposed/path-to-oscp/ If you are new to linu&hellip;", "Honestly, the best way (in my opinion) to learn this kind of thing is via CTFs (Capture the Flag competitions). They’re a great way to network and learn how to break into systems, plus if you’re good enough, some prize money might be involved too. Feel free to join any of the ranked competitions he&hellip;", "[image] It’s Arch Linux, i3 wm, xfce4-terminal. Everything is described in this blog post http://eax.me/archlinux-on-desktop/", "Prepare yourselves and don’t get too jealous. My coding area (AKA h4Xx0r 5p4c3):  [image]Browser/IRC area (for h4xx1ng):  [image]My 1337 af wallpaper:  [image]This is me h4xx1ng into the m41nfr4m3:  [image]h8ters gon h8te.", "This wallpaper should be more appropriate   [image]", "Here’s my sup3r s3cr3t h4ck3r machine where I do all my 1337est h4xx1n9. My ultra 1337 wallpaper gives me all my 1337 abilities and without it, I am nothing. @oaktree  [image]", "I just updated to Ubuntu 16.04 Minimal, meaning that I installed it with only the bare necessities. That’s right, folks: you can get Ubuntu without the GUI clutter and adware! Hardware: Some Dell Desktop, i3 dual-core @ 3.5GHz, 8GB RAM, etc. Two Monitors. A CODE Cherry White Keyboard. Logitech MX M&hellip;", "This is such a sweet setup.  I am a really really big fan!!!  Like the wallpapers a lot.  Looks like my car", "“Looks like my car” [image]", "Well, I saved for this bad boi instead: [image] Yes, this is a PLC like the ones hacked by Stuxnet (not exactly the same). And yes, it is a hacking-related project I’m working on  -Phoenix750", "I think it’s definitely worth a try.", "Haha, glad to see you enjoy it as much as I do. Have you seen the WeakNet Academy? Do you think it will be any good and is the price worth it? Personally I think it’s going to be decent but most of it will be pretty much a repetition of what most of us already know, even so, it could be interesting&hellip;", "Thanks! Yes it’s something JSchmoe is working on. I’m helping to test it and work out the kinks. It’s on the gitlab. It’s essentially a Metasploit clone, but uses the STELF shell and handler rather than meterpreter, which means antivirus doesn’t recognise it at all. It’s still early days but some r&hellip;", "Haha, glad to see you enjoy it as much as I do. Have you seen the WeakNet Academy? Do you think it will be any good and is the price worth it? Personally I think it’s going to be decent but most of it will be pretty much a repetition of what most of us already know, even so, it could be interesting&hellip;", "Hey, another WeakerThan user!  I personally, religiously crawl WeakNet Labs for latest builds and use that on my server. If for some reason I get locked out though, I’m forced to use a minimal shell only build of Debian.", "Of course, don’t forget the SSH tunnel either", "I might be wrong, but I think that there should be an only in there. If you do normal stuff over TOR too, it’s going to be marginally harder for Law Enforcement to link an online crime to you. It would no longer be a case of “he usually doesn’t use TOR, but he did on that day and that’s when x got h&hellip;", "Thanks! Yes it’s something JSchmoe is working on. I’m helping to test it and work out the kinks. It’s on the gitlab. It’s essentially a Metasploit clone, but uses the STELF shell and handler rather than meterpreter, which means antivirus doesn’t recognise it at all. It’s still early days but some r&hellip;", "totally not inspired by pry0cc  [image]", "Here’s my setup. Arch Linux, i3-wm, Intel HD 4000 and AMD RADEON 7670M, 8GB RAM, 3rd Gen i5 at 3.1Ghz.Root: 20GBs, Home: 130GBs. Fake busy desktop with my powerline bar, ranger in my builds directory, and Neovim.  [image]Firefox+Vimperator  [image]Weechat  [image] Sublime Text 3 with the gru&hellip;", "Hey, another WeakerThan user!  I personally, religiously crawl WeakNet Labs for latest builds and use that on my server. If for some reason I get locked out though, I’m forced to use a minimal shell only build of Debian.", "Nice set up. Personally I’ve been using weakerth4n Linux and found it to be rather simpler than Parrot when running recons and so forth; however, I’ve not tried ArchLinux with the configurations you’re using @pry0cc, Do you prefer Arch over Kali? Is it just the themes and the overall configurations &hellip;", "Looking great! I noticed you were running 0x00Suite, so if you don’t mind me asking, what is it?", "Ok here is my setup! I run ArchLinux with the i3 tiling window manager. This is configured by myself using a very heavily modified version of OxHak’s config. I am using conky for the top bar. My anonymity setup is fairly simple. I have a collection of VPN’s and I connect to a different one every da&hellip;", "Really liked this article! I am a big fan of ForwardAgent! Cannot literally wait until that next article comes out! Guys. SSH is really really cool. - pry0cc", "Part 1: Pimp my SSH~/.ssh/config is a blank canvas full of possibility. Over the next couple posts I’m going to talk about fun things you can do with SSH and the config file. Most of the time the use case for SSH is pretty simple: ssh foo@bar and done. Every once in a while we need to get slightly&hellip;", "Of course, don’t forget the SSH tunnel either", "Of course, don’t forget the SSH tunnel either", "And of course we could do something like Proxychains -&gt; TOR -&gt; VPN to make it even harder for them", "And of course we could do something like Proxychains -&gt; TOR -&gt; VPN to make it even harder for them", "I might be wrong, but I think that there should be an only in there. If you do normal stuff over TOR too, it’s going to be marginally harder for Law Enforcement to link an online crime to you. It would no longer be a case of “he usually doesn’t use TOR, but he did on that day and that’s when x got h&hellip;", "I might be wrong, but I think that there should be an only in there. If you do normal stuff over TOR too, it’s going to be marginally harder for Law Enforcement to link an online crime to you. It would no longer be a case of “he usually doesn’t use TOR, but he did on that day and that’s when x got h&hellip;", "Hmm I don’t know man, this looks like @pry0cc’s month to me…", "@Joe_Schmoe seems to be a pretty 1337 guy edit: extremely handsome and smart too", "@pry0cc, @Evalion, @worz, @Joe_Schmoe and @dtm P.S. (even @oaktree)", "LOL “even me.” What’s that supposed to mean?", "Same, I thought the CTF had already happened, been lurking throughout these months.", "I must also add. A Tor address will follow sometime soon. And this is self-hosted, and thus far more quiet and immune to any trouble by Freenode  (spam, netsplits, Freenode reading your messages etc) . You can also access this from Tor. However it will use an exit node so make sure to use SSL!", "Nice! Make sure to enable SSL!", "Hi everyone. We’re moving from freenode to irc.0x00sec.org. Connect with SSL on port 6697 and make sure you “accept invalid certificates.” EDIT:", "*The desktop-directory of the root, which you normally don’t have any privilige over. Your home Desktop is at: /home/-username-/Desktop This only works on Debian / Ubuntu (based) systems. Also, only the database is updated, not the actual system, to do that: apt-get upgrade", "Linux: Linux is a hacker’s choice when it comes to hacking  in general, but Linux isn’t exactly use friendly for beginners. The point of Section 1 in this series is the Linux Operating System in general. Once the basics are down then we can move on to more complicated subjects, but we all have to s&hellip;", "We often forget that we also started somewhere and it was hard. Publishing articles like this on 0x00sec makes it easier for new people. Good job @Valentine, I myself am going to do a series like this sooner or later. However, I disagree that live booting is the safest option for newcomers. The saf&hellip;", "https://securityonion.net/ About Security Onion Security Onion is a Linux distro for intrusion detection, network security monitoring, and log management. It’s based on Ubuntu and contains Snort, Suricata, Bro, OSSEC, Sguil, Squert, ELSA, Xplico, NetworkMiner, and many other security tools. The ea&hellip;", "This is short, and hopefully not completely uninteresting etc. I just wanted to be able to do this, and thought it would be pretty neat. The self-destruction of the file is achieved by it securely deleting itself. On Linux: #!/usr/bin/env pythonimport subprocess as spfrom os import path# Th&hellip;", "It could sound simple for those who already have some knowledge about hacking. But for beginners (like me) this task could be a mystery. To discover or resolve an IP address from a domain is quite simple, in Linux systems you can just open your terminal and type: host &quot;domain name&quot; dig “domain n&hellip;", "Thanks for the share! Is there a tutorial for installing/running this in a vm? Edit: I found a setup tutorial here.", "Barrelfish is a new research operating system being built from scratch and released by ETH Zurich in Switzerland, originally in collaboration with Microsoft Research and now partly supported by HP Enterprise Labs, Huawei, Cisco, Oracle, and VMware. We are exploring how to structure an OS for future &hellip;", "A Collection of Resources for Getting Started in ICS/SCADA Cybersecurity http://www.robertmlee.org/a-collection-of-resources-for-getting-started-in-icsscada-cybersecurity/ August 28, 2016 I commonly get asked by folks what approach they should take to get started in industrial control system (ICS&hellip;", "(Yawn) Morning once again. Valentine here with another Nmap tutorial. This time I’m gonna talk about Scripts in Nmap. Scripts in Nmap are probably one of my favorite features. Not only can they figure out the users on the system but also bruteforce the password. I discovered these scripts not to lo&hellip;", "Perhaps you could create something like this where you go after Jane Doe, John Doe’s sister except she’s smart and happens to use Tor with a VPN while having her MAC spoofed. Although it’s truly easier said than done.", "Hey guys. I found a very interesting Quora discussion on Twitter this morning: Link: https://www.quora.com/What-is-the-most-illegal-thing-you-have-ever-done-with-your-computer Note: Please do not share any “confessions” in this thread. Neither 0x00sec nor its affiliates are liable for any act, leg&hellip;", "Interesting article, however, a  few questions crossed my mind during my reading. Could you be more explicit ? For which reasons this system cannot be safely used as primary OS ? To continue with, do tails developer’s stated somewhere which kind of modification have been done to ensure anonymity &hellip;", "For future reference, if you’re going to post the same article in two places, you should do a bi-directional cross-link. Link to here from wherever else; and link to there from here. This way, people can come and join the discussion that may happen here.", "[image] Okay, so I’ve tried out Tails, and have come to a conclusion with it. (on the look, feel, and comprehensiveness of it) This Pro-Con article will be slightly different form my previous ones and geared more toward the software it contains, as I am not comparing Tails to anything. This is not&hellip;", "Ah the good &#39;ol domain typo! Hard to notice if you do it right, as you said!", "You know. Spelling Matters.", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "I disagree actually  Although I believe that every Linux n00b should start with a Debian based OS, I don’t think that Ubuntu is the best one to start with, firstly because of those cringeworthy themes the stock one ships with and secondly because it’s too stable. A Linux n00b should learn how to f&hellip;", "That’s pretty good! I stared at the link for longer than I’m proud of (trying to figure out what was wrong), so, I’m pretty confident your approach would work. Thanks for the share!", "That’s pretty good! I stared at the link for longer than I’m proud of (trying to figure out what was wrong), so, I’m pretty confident your approach would work. Thanks for the share!", "That’s pretty good! I stared at the link for longer than I’m proud of (trying to figure out what was wrong), so, I’m pretty confident your approach would work. Thanks for the share!", "Rather then urbandiktionary, a name like www.mircosoft.com is way harder to notice the error. Check the following sentence i wnet sohpping whit smoe freinds at the mall wihle tehre are spleling mistkaes its qutie easy to raed. This is because all the letters are in the words and the first and las&hellip;", "Maybe we can broaden the idea with not only memes but also some nice stories related to hacking, like @Ninja243’s John Doe article and @ivlb’s Cracking WPA article. Perhaps an Entertainment category with Lulz and Fiction as sub-categories as suggested by @dtm also?", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Unfortunately not due to the fact that I’m extremely busy with school and after school tutors, so I simply don’t have the time. But if you (or anyone else) would like to add to this, make a second installment or use this elsewhere, then please do!", "Unfortunately not due to the fact that I’m extremely busy with school and after school tutors, so I simply don’t have the time. But if you (or anyone else) would like to add to this, make a second installment or use this elsewhere, then please do!", "The Android SeriesHi everyone ! Some of you may know that I started an Android Hacking series. The serie focus on Android Malware and Reverse engineering. Since I started this guide, I search a lot on android malware and find some Good/Bad(Security improvement) news in this field. The news Andro&hellip;", "Whenever you get free time, add on to this. It is so goooood and well written!", "Whenever you get free time, add on to this. It is so goooood and well written!", "Unfortunately not due to the fact that I’m extremely busy with school and after school tutors, so I simply don’t have the time. But if you (or anyone else) would like to add to this, make a second installment or use this elsewhere, then please do!", "Unfortunately not due to the fact that I’m extremely busy with school and after school tutors, so I simply don’t have the time. But if you (or anyone else) would like to add to this, make a second installment or use this elsewhere, then please do!", "Dude. Seriously? This. Was. AWESOMEEE! This is a lot like the Hacking John Doe article by @Ninja243.  I am a really big fan of this style of explaining things in a story-like style. It really draws you in and  makes it easy to read. This article in itself made me rethink that bruteforcing WPA2 isn’&hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "As said @Cromical, be familiar with Linux system is crucial and, from my point of view, mandatory to ensure a good understanding of what happen behind the scene. Once done, it will be easier for you to figure it out which distro is the best for you. Kalinux, Parrot Security OS, BlackArch, BackBox, …&hellip;", "@0x00pf You are right however, those variables can be easily spoofed so, their relevance can be questionable. Best, Nitrax", "Perhaps you could create something like this where you go after Jane Doe, John Doe’s sister except she’s smart and happens to use Tor with a VPN while having her MAC spoofed. Although it’s truly easier said than done.", "Thanks, I’ll look into that", "REMOTE_ADDR is the main variable to check for a client IP, but when connecting through a proxy server it will contain the proxy IP. Depending on the proxy server, another variables may be set. As far as I know, you should check in order: HTTP_X_FORWARDED_FOR, HTTP_X_FORWARDED, HTTP_FORWARDED_FOR, H&hellip;", "REMOTE_ADDR is the main variable to check for a client IP, but when connecting through a proxy server it will contain the proxy IP. Depending on the proxy server, another variables may be set. As far as I know, you should check in order: HTTP_X_FORWARDED_FOR, HTTP_X_FORWARDED, HTTP_FORWARDED_FOR, H&hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Just what I’ve been looking for! Keep it up!", "Thanks! About the phone, it happens every once in a while. I tried tracking my own phone using GeoIP on Mobile data, and I can confidently say that you do get the location of it if the phone is in Namibia. As soon as you go to South Africa though, GeoIP returns the carrier’s location, so the short &hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Big thanks to @oaktree, @Abriaco  and James Reed for reading through this and correcting the many errors it had", "Man oh man! I’m really glad you’ve decided to take this project forward! Very well written, like @pry0cc said, when you start reading, you can’t put it down!", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Ohhh mannn! This is so good. I literally love this so much. I would pay to read something like this. Once I picked it up I couldn’t put it down. Nice work!", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Thanks! About the phone, it happens every once in a while. I tried tracking my own phone using GeoIP on Mobile data, and I can confidently say that you do get the location of it if the phone is in Namibia. As soon as you go to South Africa though, GeoIP returns the carrier’s location, so the short &hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Aah, I didn’t think about that, thanks", "Hope this won’t happen in europe!  Referring to the story, in this case you could still get his location through an browser exploit or social engineering (e.g. sending him a link to a website which has a valid reason to retrieve his location through the HTML5 geolocation API)", "Thanks! About the phone, it happens every once in a while. I tried tracking my own phone using GeoIP on Mobile data, and I can confidently say that you do get the location of it if the phone is in Namibia. As soon as you go to South Africa though, GeoIP returns the carrier’s location, so the short &hellip;", "Hope this won’t happen in europe!  Referring to the story, in this case you could still get his location through an browser exploit or social engineering (e.g. sending him a link to a website which has a valid reason to retrieve his location through the HTML5 geolocation API)", "Thanks! About the phone, it happens every once in a while. I tried tracking my own phone using GeoIP on Mobile data, and I can confidently say that you do get the location of it if the phone is in Namibia. As soon as you go to South Africa though, GeoIP returns the carrier’s location, so the short &hellip;", "One question: If you run a geolocation on a cell phone IP, would you ever be able to get the location of it? That would be a very serious privacy issue! And, though I know it’s only a story and you maybe wanted to keep your post short, only a skiddy would mess up the routers settings, when you could&hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Big thanks to @oaktree, @Abriaco  and James Reed for reading through this and correcting the many errors it had", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "Hey 0x00’ers! I am happy to announce we have decent syntax highlight support!  To format your code just embody your code with three backticks. You can also put the language after the first line of backticks if it doesn’t specifiy it. In future I will be adding x86 and other types of ASM. If you nee&hellip;", "What @oaktree said, and use the correct syntax highlighting module. There’s an article about how to use it. Also fix the indentation, the code is hard to read.", "I second @oaktree’s proposal.", "Maybe try to contextualize the code snippets a bit more, rather than relying solely on comments?", "Good article! Was a good overview of it, and I’m a fan of the naming convention for versions on this baby", "It is amazing how a so old code is still interesting to study. You have to be careful as some things have change since that time and you need to do a little bit research to understand why some code is there. I will also recommend to take a look to the main (worm.c) function. It makes use of some tr&hellip;", "Introduction to The Post Hey guys! Considering this is the first actual post besides the introduction, I thought it would be best to start big and start with a bang you could say. Besides that I think the Morris Worm would very much deserve a spot in the start of this series considering it was one &hellip;", "Exploit-Exercice : NebulaHello Hackers and welcome to the How to pwned Nebula Guide Before you read this “How to”, please try the challenge on your own and use this “guide” only if you’re stuck !  I hope you are ready to go ! Level00 - find the file and get the flagHere is the first level of &hellip;", "Hey, thanks for this! (Didn’t know about it). I’ve been looking around for something that could help me understand Linux attacks and so on! Props to you!", "The connect function you speak of, is that the function I find with command: objdump -T /usr/bin/lynx | grep connect ?", "Honestly from what I know a hacking distribution is just a glorified distribution with hacking tools already installed on it. So I think in a beginners case a good idea would be just familiarizing yourself with Linux, then learning how the tools work and using them accordingly. Once you’ve done that&hellip;", "Yeah ! Of course You can join !", "0x00sec is proud to announce the new and upcoming CTF sponsored and hosted by s^3! DetailsThe CTF will be beginning within the next few weeks, however the time and date is not yet final. This post will be updated when new infomation becomes final. The details to the CTF server will be PM’d to you &hellip;", "Yeah ! Of course You can join !", "I don’t know about others here, but I think it would be awesome to see some hardware hacking how-tos! I would certainly be interested in the basics! I have a friend that would probably also be interested in them. I’ve recently been wondering how exactly you would go about hacking a cell (not smart) &hellip;", "Sometimes, scripting languages aren’t fast enough to do actions to my liking, but I still need to use that language. Thankfully, Python has a way to make modules in the C language. These modules can not only speed up a program, but also lets one use C functions. This is more of an intermediate topic&hellip;", "Is there space for a n00b in R007SH3LL?", "Hey, thanks for a great article! To stay under the radar, I use some, umm, unorthodox methods. There are some old CTF servers I found like this one that have levels on the server. To solve the levels and get the flags, the user has to SSH into the server. To anonymise myself, I SSH into the CTF se&hellip;", "That sounds AWESOME", "That sounds AWESOME", "#Wargamming:# Goals: Develop Information Security procedures according to the type of threats and incidents. Characterize different types of operations in computer networks in the context of cybersecurity and cyber defense. Install and parameterize tools to ensure cyber security and cyber &hellip;", "#Wargamming:# Goals: Develop Information Security procedures according to the type of threats and incidents. Characterize different types of operations in computer networks in the context of cybersecurity and cyber defense. Install and parameterize tools to ensure cyber security and cyber &hellip;", "Great post! Wargamming?", "I use Solaris 10. I have a Windows 98 PC as well.", "Great post! Wargamming?", "Seems like most of that is covered in the CEH, minus mathematics (unless they mean public key). Yes, there are HUNDREDS of approaches to learning. The best thing to do is get familiar with ethics, laws, and linux.", "Hello everyone! Yesterday I came across a website that offers a lot of educational courses (This courses are only available in Portugal) and one of them caught my atention - “Curso de Técnico Especialista em Cibersegurança” or Techinal Specialist in Cybersecurity Course (the transaltion is a bit off&hellip;", "Thanks to all! I think I’ll start with MINT and when it’s not what I search for I’ll just use Ubuntu . When I have more time I’ll take a look at Debian!", "I disagree actually  Although I believe that every Linux n00b should start with a Debian based OS, I don’t think that Ubuntu is the best one to start with, firstly because of those cringeworthy themes the stock one ships with and secondly because it’s too stable. A Linux n00b should learn how to f&hellip;", "Yeah I’ll do some research", "Android Malware sounds epic  Is there any chance that tutorial could show us how to put a backdoor in the apps?", "You can do it with MSFVenom apparently however I never got it to work. There’s also a platform called SPF, Smartphone Pentesting framework, similar to MSF but for smartphones.", "Android Malware sounds epic  Is there any chance that tutorial could show us how to put a backdoor in the apps?", "Or the left bit, because, you know…", "Hello homies and homets! PySec/Airth here coming at you with some 1337 subnetting. This article was originally posted on Null Byte but since I joined the 0x00sec team and there are a ton of new comers, I decided to re-upload some of them so people won’t get confused with the rest of the posts I will&hellip;", "Epic tutorial! This post got me thinking if one could do this in Python, so one thing led to another, I dropped the idea and found PEInjector that seems to do the same thing while performing an MITM attack, so you wouldn’t need to use Social Engineering to get the application on the target’s comput&hellip;", "English should be primary. Again, English is the language of Computer Science; AND most people visiting this site are from the US/UK and speak English.", "I agree with @oaktree. Partly. At the current you can change the UI language, but you are talking about the posts. It’s a great idea. The problem with translation, is that things don’t always translate well. You’ve probably seen literal translation with Google Translate before, for example in Engl&hellip;", "The problem with this is that we don’t want a plethora of languages on the site. That would cause a lot of confusion and create a lot of barriers. Also, most of our traffic comes from English-speaking countries, and a lot of programming was designed with English in mind. Thus, while I see the utili&hellip;", "Hey Mates, I thought a time ago about the outrage on Null-Byte, when some spanish guy translated the articles and said they are his own. “How could a thing like this can be avoided?” was the question and some smart guys thought of copy protection, watermarks, etc. but I think a better way could be &hellip;", "Thanks @oaktree. I’m not sure about what did you mean. Maybe my wording was a bit loose. It is indeed preprocessor stuff. I use define, but formally it is a preprocessor macro. The fact is that you can either define your macro in the source code using #define _ANDROID or you can achieve exactly the&hellip;", "If you have been following this series, you may remember that I started Part I with an use case involving remote access to an Android Phone. This part will cover how to get a remote shell access to your phone and other devices. Actually, deploying our remote shells in a device is nothing special, b&hellip;", "Wouldn’t this be just standard preprocessor stuff, rather than “a define?” Anyway, this tutorial is crazy! I’d give you 2674 of the w33k, lol! (1337 * 2)", "Hey everyone! I just thought I would share this little technique, because it was unknown to me after a year of programming experience! int a = 5, b = 6;// swapping now:a = a + b; // a = 11b = a - b; // b = a + b - b// b = a// b = 5a = a - b; // a = a + b - (a + b - b)// a = b// a = 6&hellip;", "Android Malware sounds epic  Is there any chance that tutorial could show us how to put a backdoor in the apps?", "#Hello to all the Hackers of 0x00sec ! I don’t have time to post tutorial for the moment but I’ll be right back with new tutorial for beginners ( Like me haha ). For the moment, I’m too busy with my intership report. The only thing “Cool” about this report is the subject which is about security an&hellip;", "Indeed you can follow a bottom-up or a top-down approach. That is up to you. My understanding is that @TheDoctor is looking into GNU/Linux to keep working on his crackmes as consequence of the outcome of the poll he posted some days ago. In that context, my guess is that he wants something up and r&hellip;", "Indeed you can follow a bottom-up or a top-down approach. That is up to you. My understanding is that @TheDoctor is looking into GNU/Linux to keep working on his crackmes as consequence of the outcome of the poll he posted some days ago. In that context, my guess is that he wants something up and r&hellip;", "That’s a snazzy idea. I found you can use the  servers at koding.com for a similar use. Of course setting up your account behind a VPN.", "Meh. I’m using Ubuntu with KDE now.", "Meh. I’m using Ubuntu with KDE now.", "Is it any good? I thought of installing it around three years ago while I was getting started with Linux through puTTY, but I never got around to installing it.", "Okay, then start with Mint. It took me two weeks to break Mint by installing GNOME.", "Okay, then start with Mint. It took me two weeks to break Mint by installing GNOME.", "True. It definitely speeds up the climatization to Linux.", "True. It definitely speeds up the climatization to Linux.", "I disagree actually  Although I believe that every Linux n00b should start with a Debian based OS, I don’t think that Ubuntu is the best one to start with, firstly because of those cringeworthy themes the stock one ships with and secondly because it’s too stable. A Linux n00b should learn how to f&hellip;", "Nmap is literally one of my favorite tools ever.", "Yup slowing the scan down a lot is important to help prevent detection from an IDS, and other such things. I generally add -V to help me see how its doing though.", "This is nice. I generally just shove nmap -Pn -A But to control the speed to void detection is smart.", "Besides Social Engineering, recon is by far the most important aspect of hacking. Without recon, all the greatest hackers of our time probably wouldn’t be able to hack anything. Besides, just shoving one exploit after another, when there are thousands of exploits in Metasploit alone, is inefficient. &hellip;", "I disagree actually  Although I believe that every Linux n00b should start with a Debian based OS, I don’t think that Ubuntu is the best one to start with, firstly because of those cringeworthy themes the stock one ships with and secondly because it’s too stable. A Linux n00b should learn how to f&hellip;", "Great idea, I can confirm it works  Speed seems to be an issue on those servers though", "That’s a snazzy idea. I found you can use the  servers at koding.com for a similar use. Of course setting up your account behind a VPN.", "Hey, thanks for a great article! To stay under the radar, I use some, umm, unorthodox methods. There are some old CTF servers I found like this one that have levels on the server. To solve the levels and get the flags, the user has to SSH into the server. To anonymise myself, I SSH into the CTF se&hellip;", "Great idea, I can confirm it works  Speed seems to be an issue on those servers though", "I see, i was going to guess overthewires bandit challenges", "I see, i was going to guess overthewires bandit challenges", "The link leads to one of the servers", "DUDE! That’s slick. I was thinking about SSHing like that too.", "Slick!  If you ever feel lik sharing those servers", "That reminds me, I should reupload the VIM tutorial", "Wow, that shows how much effort you guys invest in this site! Thank you for your extremely fast response!", "Somebody requested we have a spoiler tag, so that we can hide infomation for challenges and such. Your wish has been granted! [spoiler] Hello world! [/spoiler] now makes   Hello world! , and you just click it to reveal whats underneath the blur. It also works with images. Enjoy!", "Hey, thanks for a great article! To stay under the radar, I use some, umm, unorthodox methods. There are some old CTF servers I found like this one that have levels on the server. To solve the levels and get the flags, the user has to SSH into the server. To anonymise myself, I SSH into the CTF se&hellip;", "Agreed with @unh0lys0da. None of our damn business. xD", "Who cares, not our responsibility", "Yeah, im free tomorrow, ill get one up. Hope to get another post up as well so ill add it to my to-do list.", "Alright: This w33k, this honor is awarded to @n3xUs, for his articles on Social Engineering. Keep it up, buddy. You can see who has gotten 1337 of the w33k by checking out its badge. We’ve been here for a month!Today, 5/21/16 marks one month of 0x00sec! Can you remember how it all was a month ago&hellip;", "Yeah, im free tomorrow, ill get one up. Hope to get another post up as well so ill add it to my to-do list.", "As another dev of this community, I second this. “Please excuse the dust, we are under construction.”", "Is there any chance your tutorial in Python could be posted?", "Well done! , and youve saved me the time of posting on writing a proxy in python! (which i may still do for those non c users.) Also, well noted on the nmap through proxychains as i failed to specify it requires a full connect scan  oops. Nice read, well written. I may play with your code a bit in&hellip;", "Welcome to this new series intended to explain the guts of all those hacker’s tools out there you use or want to use… Basically, we are going to explain you how does they work and how do you can build your own… Keep reading if you do not want to be a Skid ;). We will start the series with Proxychai&hellip;", "hello 0x00sec members!! This is my first post so i will do my best not to make it too complicated. First i want to clarify that I’m no expert in either AI or InfoSec so if i give any false information please let me know. In this post i will give a brief introduction to both Artificial Intelligence&hellip;", "DUDE! That’s slick. I was thinking about SSHing like that too.", "Slick!  If you ever feel lik sharing those servers", "Hey, thanks for a great article! To stay under the radar, I use some, umm, unorthodox methods. There are some old CTF servers I found like this one that have levels on the server. To solve the levels and get the flags, the user has to SSH into the server. To anonymise myself, I SSH into the CTF se&hellip;", "Ill see what i can find out. Im not sure of freenodes standards, but theres always a work around", "Finally an actual How To on staying anonymous, Thanks for sharing man very well writte and much appreciated", "Awesome share man! Loving this type of thing. This is the kind of stuff that movies quote “He’s routing through proxies in Estonia” - Mr Robot. I am so hyped to read your next article!", "Hello everyone of 0x00! I figured why not make my first contribution, so heres a quick one  Today, im going to brush the topic of proxies, followed by how to set up ProxyChains to make being tracked a bit harder. So first things first. What is a proxy? In computer networks, a proxy server is a s&hellip;", "Alternate Title: Picking Up Women: For Hackers.", "#SOCIAL ENGINEERING - PART 2 - ELICITATION# Elicitation is a conversation where you subtely try to extract information. However, this conversation needs to look casual and innocent. It’s all about asking the right questions. The goal here is to manipulate the behaviour of your target in order to ac&hellip;", "Woah, why did I never tried this. Basicly this is just Linux malware right? This is so awesome, thanks for opening my eyes &lt;3 Fuck Windows Internals, I’m gonna focus on this ^^. Amazing article! unh0lys0da", "Hello there all, today we will be discussing packet forging. There are some uses for packet forging including (D)DOS’ing, spoofing, MiTM attacks and way more that don’t come to mind at the moment. While this may sound like a very difficult subject it is actually quite simple. Basicly it’s just cop&hellip;", "Such a good post. If you weren’t a mod you’d be looking at 1337 of the W33K for sure!", "We did it! 100 users!Hello 0x00’ers! A couple of weeks ago, this community started off as a fun new place to teach, learn and discuss Infomation Security, following the swift decline in activity at Nullbyte. Between three humble hackers on the #nullbyte IRC channel; Me, @oaktree and @unh0lys0da wor&hellip;", "Firstly, well done on the site! It’s looking really good. I was wondering if you could sort the topics into “worlds” kinda how WonderHowTo did to make series of articles easier to find. So, like, having all the Crypto stuff under the Crypto world for example. I understand that you already have the t&hellip;", "Hey all, I was wondering how the CTF section should work. As in, is it just for sharing wargames and upcoming CTFs, or are actual write-ups going to be posted too?", "Targeted areas: Server-side Web SecurityAssumed knowledge: NoneOverTheWire: Natas Page", "I would prefer you link CTFs rather than games since they are more effective in delivering some extent of legitimate scenario and require the proper skill and knowledge.", "Yes you guys are. Say if you guys ever need help with anything on the community feel free to ask me, I’d be glad to help make it be better.", "I think you’ve done an outstanding job on the site, although mind you I will keep my eyes open for any possible improvements that could be made, as the site’s community is expanding very fast. Hopefully this will become just like NB, maybe even better", "That is a good idea. Mind you, we already have sub-categories. The main categories are at http://discourse.0x00sec.org/categories The cryptology category is a sub-category of Hacking. http://discourse.0x00sec.org/c/hacking/cryptology So I like the idea, we will look into it. But I feel this look&hellip;", "Firstly, well done on the site! It’s looking really good. I was wondering if you could sort the topics into “worlds” kinda how WonderHowTo did to make series of articles easier to find. So, like, having all the Crypto stuff under the Crypto world for example. I understand that you already have the t&hellip;"]}