{"user": "number28", "history": ["Wow… I expected a list, but nothing quite condensed as this! Great stuff, thank you for sharing!", "Hi all, I’m a new aspiring hacker and right now I’m going through a couple of books about penetration testing but I’m not sure if does books are enough for becoming a hacker. I have no intention of becoming good at things in a short amount of time, I know that I have to spend a lot of time in order &hellip;", "Recently I moved into a new suburban neighborhood littered with default router access points. One day, I decided I wanted to test my luck and see what I could get by using a simple but very effective Wordlist A few years ago I use to work as a cable installation technician. I’ve noticed most techni&hellip;", "@pry0cc, share your dot files… I want to see your i3wm config file specifically.", "Recently I moved into a new suburban neighborhood littered with default router access points. One day, I decided I wanted to test my luck and see what I could get by using a simple but very effective Wordlist A few years ago I use to work as a cable installation technician. I’ve noticed most techni&hellip;", "Here we go again! The classic ‘Better Distro’ argument! Beware, this has broken more friendship than Monopoly! On a serious note, I love Arch. Heil Team Arch!", "Hello, my loyal 0x00’ers! You are reading my 4th Installment of Paranoia and a Terminal! Today we are going to discuss how to set up a Tor Service; and how to access it. Tor services are a really good addition to your toolkit as a Paranoid hacker. Tor can be used as an Anonymity tool, but providing&hellip;", "If you really want to create something, that will traverse across NAT’s, and be very difficult to trace the origin unless you’re one of the 3 letter agencies, then use Tor Hidden Service’s. What you’ll need to do, is set up a tor hidden service as your listener (on the attacker side), and then modi&hellip;", "Hello 0x00 sec  I have developed a reverse shell in python that controls victims shell , upload files from his computer and stream his desktop to me. I have tested it on mu local network and it is to great extent satisfying. I  have some questions starting from this point in order to finish it. 1-&hellip;", "That is pretty damn interesting. Do you happen to know any other good resources that further explain RE’ing keys?", "So Im looking for some direction in learning about brute forcing cd keys.  I was installing an operating system and had the thought of trying such a thing.  I was thinking along the lines of something like virtual hardware.  Like a flash drive emulating a keyboard, then set the cd key size and let i&hellip;", "Brute forcing the keys might get you one, some day in the future. It might be easier to reverse engineer the algorithm used. For example, the Starcraft key algo was revealed here: http://takingsoftwareapart.blogspot.com/2008/01/starcraft-cd-key-algorithm-explained.html //Algorithm found by TAKINGSO&hellip;", "Wow… I expected a list, but nothing quite condensed as this! Great stuff, thank you for sharing!", "Wow… I expected a list, but nothing quite condensed as this! Great stuff, thank you for sharing!", "Knowledge is Power But like all power, there are those who want to keep it for themselves but em not one of them. I was feeling bored and I start checking my bookmarks and I found these linked in my bookmarks so I thought I should make a list and share with others because knowledge should be free .&hellip;", "Recently I moved into a new suburban neighborhood littered with default router access points. One day, I decided I wanted to test my luck and see what I could get by using a simple but very effective Wordlist A few years ago I use to work as a cable installation technician. I’ve noticed most techni&hellip;", "Recently I moved into a new suburban neighborhood littered with default router access points. One day, I decided I wanted to test my luck and see what I could get by using a simple but very effective Wordlist A few years ago I use to work as a cable installation technician. I’ve noticed most techni&hellip;", "Recently I moved into a new suburban neighborhood littered with default router access points. One day, I decided I wanted to test my luck and see what I could get by using a simple but very effective Wordlist A few years ago I use to work as a cable installation technician. I’ve noticed most techni&hellip;", "Recently I moved into a new suburban neighborhood littered with default router access points. One day, I decided I wanted to test my luck and see what I could get by using a simple but very effective Wordlist A few years ago I use to work as a cable installation technician. I’ve noticed most techni&hellip;", "Recently I moved into a new suburban neighborhood littered with default router access points. One day, I decided I wanted to test my luck and see what I could get by using a simple but very effective Wordlist A few years ago I use to work as a cable installation technician. I’ve noticed most techni&hellip;", "Recently I moved into a new suburban neighborhood littered with default router access points. One day, I decided I wanted to test my luck and see what I could get by using a simple but very effective Wordlist A few years ago I use to work as a cable installation technician. I’ve noticed most techni&hellip;", "Recently I moved into a new suburban neighborhood littered with default router access points. One day, I decided I wanted to test my luck and see what I could get by using a simple but very effective Wordlist A few years ago I use to work as a cable installation technician. I’ve noticed most techni&hellip;", "Hello there all, today we will be discussing packet forging. There are some uses for packet forging including (D)DOS’ing, spoofing, MiTM attacks and way more that don’t come to mind at the moment. While this may sound like a very difficult subject it is actually quite simple. Basicly it’s just cop&hellip;", "Greeting to the Community of 0x00sec , I am Nanobyte and this is my first post on this forum so please excuse me for any mistakes or any misinfo that I may write! This essay is about the rise of mobile technologies and the rise of the newest technology the 5G so without further a do … For someone&hellip;", "Hello fellow 0x00sec h4x0rz!! Today I’m coming to you with a discussion topic on EDC bags. An EDC bag is something that you carry with you every day, I.E, an &#39;E’very &#39;D’ay &#39;C’arry bag. The Bag.Alright, so, what’s an EDC bag without the bag part?! Personally, I don’t think you need an expensive, s&hellip;", "Yo, this is a ruby script that randomly/procedurally generates Virtual Box VMs for you to practice hacking on."]}