{"user": "RedRose", "history": ["[+] METHODOLOGY AND PROCESS MODEL Today’s digital world is perpetually evolving, becoming an intrinsic part of our lives, reaching almost every aspect of our society. Criminal Investigations are no exception. However, having technical knowledge and using tools alone is not enough to fully and prope&hellip;", "Programming Turing Machines: IntroductionBack again with another theory-heavy topic!  The project I’ve been working on is quite extensive so it will be split into three parts: IntroductionImplementationHigh-level ApproachAs these topics are created, they will be linked together for easy navig&hellip;", "man you know this job… thanks", "My Introduction First, I would like to thank 0x00sec for providing such a great community. I would also like to thank Arrogant Bastard, Sierra Nevada and Deathwish Coffee for providing the sustenance necessary for starting and completing the following series. Not only should you get drunk while com&hellip;", "Hey guys! Here’s a list of around 60+ sources I’ve gotten together for 10 programming languages. These sources will help you, so I recommend you check &#39;em out! If the link does not work please copy paste the address into your browser. SOURCES: HTML5 http://www.w3schools.com/html/html5_intro.asp &hellip;", "This is a PoC-style test run for an application that I am currently developing as a personal project. Should anything weird happen, please report it to me and I’ll try to fix it. This is just a simple crackme so it shouldn’t be too hard once you start to figure out what’s happening… maybe…?  Diffic&hellip;", "The textbox insert newlines automattically on my mashine so some user has to use base64 -id for it to work", "Was fun!  The flag is VM{M4TR1X}", "Finally managed to finish it too  $ ./crackme VM{M4TR1X} Congratulations! You did it!", "What exactly is the purpose here? Just curious.", "Sorry, I could serve you better. This link will help you: https://serverfault.com/questions/881753/convert-iis-web-config-redirection-rules-to-apache-htaccess", "I was going to help but then I got tired of scrolling the post content to read.", "I have software for .htaccess deny web config conversion, but I have not found anything to convert to web config den htaccess. Does anyone who knows can translate the following code?http://s3.dosya.tc/server15/u62f61/config.txt.html &lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;", "#!/usr/bin/pythonimport csvimport jsonwith open(&#39;json&#39;, &#39;r&#39;) as myfile:        jsonData = myfile.read()data = json.loads(jsonData)wfile = csv.writer(open(&quot;json.csv&quot;, &quot;wb+&quot;))for data in data:        ndata = json.dumps(data)        wfile.writerow([                ndata[&quot;entities&quot;],ndata[&quot;&hellip;", "thank you for your help", "I didn’t find any converter but I personally would recommend that you understand what this web.config is doing and translate manually to an Apache equivalent. Doing this way, you will get a better understanding of your server.", "I have software for .htaccess deny web config conversion, but I have not found anything to convert to web config den htaccess. Does anyone who knows can translate the following code?http://s3.dosya.tc/server15/u62f61/config.txt.html &lt;?xml version=&quot;1.0&quot; encoding=&quot;UTF-8&quot;?&gt;", "The title is self-explanatory. I use Python with requests and BeautifulSoup. (Writing this post I saw that there is a tutorial on how to use this tools )", "mechanize and nokogiri. Ruby is bae. Although. requests in Python is pretty nice and light. Never used beautifulsoup in python before.", "As you said, pretty nice, light and easy to use", "also py’s lxml.html together with cssselect is pretty neat if you rely more on css selectors; personally, I prefer it over bs4", "In addition to that there is still scrapy as well, depending on what you want to achieve BS4 might not be suitable anymore. Played around with BS4 and scrapy a bit and on first glance scrapy looked a tad more powerful to me", "Anybody tried the HtmlProvider in Fsharp.Data? I recently read a blogpost claiming f# to be the best language for scraping the interwebs. http://biarity.me/2016/11/23/Why-F-is-the-best-langauge-for-web-scraping/", "requests + BeautifulSoup is the bomb", "Python’s BeautifulSoup and requests for smaller projects and scrapy when I need a powerful library for a project", "Requests and beautifulsoup make it goes boom!!", "I have scraped most sites with bs4, request, sqlite/sqlalchemy (with mySQL backend). I did it multi-threaded some times too. I can’t say that writing the code was pleasant, but the results were really efficient!", "As users, you don’t often get a peek behind the curtain of what we do to maintain the site and the IRC server. Typically updates and upgrades are fairly seamless, and that’s a good thing. However, we do have a change planned this weekend that will be disruptive, so heads up: THE IRC SERVER WILL GO &hellip;", "Hi, you can try to take a look also to this project: https://github.com/taipan-scanner/Taipan", "Guys i want to create tools like that but i want my project is based on Django Framework.I have beeing coing on python for 1 years.This project will be my finish project so How can i do ? is it posible  ? Have you got any tutorial to suggest me ?", "You may try w3af_console it can be stealthy and can make a lot of noise. Search vulns, and also exploit them. And there’s a gui version, but i didn’t use it. By the way, look at the skipfish. It can be useful, but every scanner may provide false positive.", "what tools do you use. If you could help with this situation, I would greatly appreciate it. thanks", "what tools do you use. If you could help with this situation, I would greatly appreciate it. thanks", "That is true, I meant more for like Nikto, nmap and such. Enumeration tools. I now see that Nessus was in your list  Nessus, Nexpose, OpenVAS and all the big “vuln. management software” platforms are never really used for Pen. testing enumeration (Not with companies I have worked with at least). I&hellip;", "@knif3 oh, man, if you think Nessus is stealthy, I’d love to know what you call loud  The paid version, at least, will scale to a pretty large network if you don’t mind waiting for it to finish.", "Thank you for your interest.", "@MagisterQuis Listed some pretty solid enumeration tools that are the goto’s for pentesters. If you are just working with small amounts of boxes these tools are the stealthiest, most targeted tools for the job. If you are trying to do more vulnerability analysis and keeping track of how secure your&hellip;", "Maltego is a really cool script (?) that uses several different other existing tools (e.g. TheHarvester, Nikto, and Nmap). Might be worth looking into.", "The free Nessus and Nexpose aren’t bad either, depending what your goal is.  If you’re doing compliance checks, they may be all you need.  If you’re actually trying to find ways to break into something (presumably to patch them), they’ll give you a start, but won’t find much of the interesting stuff&hellip;", "what tools do you use. If you could help with this situation, I would greatly appreciate it. thanks", "Im a n00b when it comes to stuff like this but I ran across this article and it seems relevant to this conversation Ghost Hook Bypass", "Educational purposes, Of course  Codes are obfuscated and the program packed with packing tools. Also, the decryption password will not store in victim machine, the password will generate before encryption phase and will be sent to a server on the TOR network, I should add this that password will &hellip;", "Of course we assume this is just for educational purposes  Do you intend to make your Ransomware easily beeing “broken”? You can easily decompile C# back to IL code, so malware analysis should not be hard. If you store the decryption key on the client and only “check” the password on the client, the&hellip;", "I figured it out somehow It contains 5 part The Core: Just Encrypting Data | as Windows Service Additional service that checks core every specific time and it will not allow system to shutdown or restart Additional service that after the core did its job, it will kill core service and wip&hellip;", "Hello everybody It’s been a while since I started programming a RANSOMWARE. It’s based on &quot; EDA2 &quot; and &quot; HiddenTear &quot; with the ability to automatic windows exploitation and behave like a worm But programming this is a bit hard as a single-person job, So if anyone of you wants to help, I will happ&hellip;", "##– What is the “Penny”-Guide? – With this guide I want to help the newbies who wants to enter the world of IT-Security and give them a picture which is (in my opinion) essential to understand that it’s much harder than you think. There is a lot of theory and much more practice behind it. ##– My &hellip;", "If you have cash. And you’re a professional,  Qualys and Nessus are very good (although expensive). Burp is super, as well, especially for web application vulnerabilities. ZAP is also boss.", "I will not use illegal. i am preparing education thesis. I will be very happy if you make a little more comprehensive explanation", "Depends on what you want to scan. Nmap for portscanningNikto, wpscan, and dirb for websitesHydra if you have creds and want to find where they workNessus if you want to charge your client $40k for minimal workA tricorder if Dr McCoy is in the roomenum4linux for when there’s a Windows box I ca&hellip;", "Good work nice and clear article", "what tools do you use. If you could help with this situation, I would greatly appreciate it. thanks", "#What’s this about? Hello everyone, I’m Noswis. You might have already met me on IRC but this my first real post here! In this post I want to show you how I made a key-generator for a puzzle that @0x00pf created. I learned a lot from the puzzle that I’d like to share with you and I hope you will le&hellip;", "AFLogical is another methodology that extracts robot devices’ information besides adb. Content suppliers ar employed in this method, saving the extracted information into the device’s American state card. Such information contains contacts, call logs, SMS, transmission electronic communication Servi&hellip;"]}