{"user": "retrowin01", "history": ["I’m not a fan of that setup myself but if it works for him, what is the problem? A setup is someone’s personal choice, his/her way of using their own system, and we definitely should never judge anyone’s performance and productivity based on the way they made their system look. @pry0cc is very prod&hellip;", "I’m not a fan of that setup myself but if it works for him, what is the problem? A setup is someone’s personal choice, his/her way of using their own system, and we definitely should never judge anyone’s performance and productivity based on the way they made their system look. @pry0cc is very prod&hellip;", "Your system looks well. But please, I have NO idea how it can be possible to work with system @l0x6c was posted a bit above. Briefly, it’s uncomfortable, but I’m not surprised. I can see this style on 4ch (g), each anon there has almost the same customized system. Don’t know where the idea of no-bor&hellip;", "@pry0cc I think you worried because you thought my message was directed to you. It’s false. There is separated part of people with that mindset I described in the message. How can people learn if they have a shitty desktop? Ever thought of that? What I got from it: not having the urge to hang mys&hellip;", "I don’t know who you’re replying to, but since I created the thread, I’ll address this. A hackers setup is something that they show off. Is it serious? No. Is it fun? Yeah! It’s like putting stickers on your laptop. It gives you some sort of individuality with your setup, right down to the experien&hellip;", "The total amount of time it cost me to customize my system: a little under 20 minutes. What I got from it: not having the urge to hang myself everytime I open a text editor.", "The hard truth. Well said.", "Again people waste their time to customize their system instead of learning how systems work. When their system was customized as they wanted it to be, they open a bunch of C or Python code, look at that bunch of code and it makes them happy and makes feel like they’re really true-hackers. You spen&hellip;", "How can people learn if they have a shitty desktop? Ever thought of that?", "I’ve never bothered with customizing my desktop a lot but why the hate? Having nice desktop and knowing how system works is not mutually exclusive. It’s same kind of argument as “if someone is physically fit he is probably dumb cause you can’t be both smart and fit”", "Again people waste their time to customize their system instead of learning how systems work. When their system was customized as they wanted it to be, they open a bunch of C or Python code, look at that bunch of code and it makes them happy and makes feel like they’re really true-hackers. You spen&hellip;", "@oaktree, if you wanna be a pentester then C++ is useless for you. I meant that pry0cc said. You need C/C++ or assembly if you wanna be a reverse-engineer and you need to coding malware.", "No hate but if you consider pentesting just as something what @pry0cc said: Then you don’t necessarily need to know C/C++. Fair enough. But if you strive to understand what is going on under the hood, what a learning and evolving individual should do then imo knowing low level languages will help&hellip;", "@oaktree, if you wanna be a pentester then C++ is useless for you. I meant that pry0cc said. You need C/C++ or assembly if you wanna be a reverse-engineer and you need to coding malware.", "Pentesting (excluding porting exploits) generally is just metasploit and even cobalt strike. Which is what he was talking about. For malware development on the other hand… Have fun writing an APT in python, I know we wrote STELFv5 in python, but Jschmoe has since rewritten it in C++. You have a lot&hellip;", "Pentesting (excluding porting exploits) generally is just metasploit and even cobalt strike. Which is what he was talking about. For malware development on the other hand… Have fun writing an APT in python, I know we wrote STELFv5 in python, but Jschmoe has since rewritten it in C++. You have a lot&hellip;", "Useless? If you wanna be 1337 and understand how everything works, ya gotta know C; ya gotta know OS internals, including kernel stuff and how user-space works with kernel, across any relevant platform… Sure you can get somewhere metasploiting from 9 to 5, but idk man. Is that enough?", "C/C++ or C# is useless to pentesting. These languages are useful for large projects. Why did you decide you need to coding in C?"]}