{"user": "ricksanchez", "history": ["I knew @0x00pf was an absolute titan but I didn’t know he was actually a God.", "Hello again!It’s been a while since the last Knowing Null. For those of you knew to the series, my name is skidd0 and Knowing Null is an interview series where I pester and prod the top minds of 0x00sec about themselves and then post it all publicly–a dream come true for us paranoid hackers! Today&hellip;", "Awesome to see that project going down now! I hope everyone who participates will enjoy it a lot  ! Good luck and have fun in advance to everyone thinking about joining!", "Awesome to see that project going down now! I hope everyone who participates will enjoy it a lot  ! Good luck and have fun in advance to everyone thinking about joining!", "Awesome to see that project going down now! I hope everyone who participates will enjoy it a lot  ! Good luck and have fun in advance to everyone thinking about joining!", "Awesome to see that project going down now! I hope everyone who participates will enjoy it a lot  ! Good luck and have fun in advance to everyone thinking about joining!", "Awesome to see that project going down now! I hope everyone who participates will enjoy it a lot  ! Good luck and have fun in advance to everyone thinking about joining!", "Welcome to the inaugural Leap Security and 0x00sec CTF!! We have teamed up with the guys at Leap Security to bring you this challenging fun-filled event. The CTF has no limitations on participants as it is open to anyone (no registration required) – think of it as our gift back to the community!  [&hellip;", "PrefaceThis quick article will give a short introduction on what fuzzers are, how they work and how to properly setup the afl - american fuzzy lop fuzzer to find flaws in arbitrary projects. Well known alternatives to afl (for the same or other purposes): boofuzz: Network Protocol Fuzzing for Hu&hellip;", "To add on that: Practical Malware AnalysisMalware Analyst’s CookbookThese two are probably regarded as a common entry point /decent start to dive into this material", "To add on that: Practical Malware AnalysisMalware Analyst’s CookbookThese two are probably regarded as a common entry point /decent start to dive into this material", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "Hello, 0x00ers! As you may have heard me talk about before, I am a strong advocate of using labs and CTF platforms for learning to hack and learning the skills involved in performing pentests from day to day. I believe they’re a great way to learn new skills, practice and validate your enumeration&hellip;", "First of all welcome! Secondly I have to something right away. There won’t be ‘someone’ that teaches you how to use (Kali) Linux. Especially Kali Linux is meant as a penetration testing system, hence it includes a ton of different tools for different tasks… If you would have searched a bit you wou&hellip;", "Do you know a site that will teach me about penetration testing", "First of all welcome! Secondly I have to something right away. There won’t be ‘someone’ that teaches you how to use (Kali) Linux. Especially Kali Linux is meant as a penetration testing system, hence it includes a ton of different tools for different tasks… If you would have searched a bit you wou&hellip;", "PrefaceOkay guys we’re not talking apt-get here. It’s about advanced persistent threats. Didn’t find anything about it here after using the search. What is it in short?An advanced persistent threat (APT) is a network attack in which an unauthorized person gains access to a network and stays th&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "I just wanted to thank everyone for helping this essay get widely distributed. Especially @pry0cc. And for everyone who is a part of 0x00sec.org: I have been in this game for awhile now. I pretty much kept to myself for years…however, I believe our world is facing issues that we can only fix toget&hellip;", "It’s a pleasure man. You’ve given so much to this community in terms of information, exposure and knowledge. Thank you dude for choosing 0x00sec as your home!", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "No hate but if you consider pentesting just as something what @pry0cc said: Then you don’t necessarily need to know C/C++. Fair enough. But if you strive to understand what is going on under the hood, what a learning and evolving individual should do then imo knowing low level languages will help&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "Thanks @yogi4you!. I’m glad to hear you liked the series. I’ve been very busy lately, I’ll try my best to continue the series whenever things calm down. Also regarding your initial question, there are many different ways to generate the asm out of an hex sequence. rasm2 tool included in radare2 is &hellip;", "Part #2 - A lot about Paging, a little about VirtualizationDisclaimer This article is based on extensive research and I am not an expert in this field. The only intention I’ve got was “ to understand how virtualization is working and share it ”. Please tell me any mistake you discover. I will cor&hellip;", "PrefaceThis is a write-up for solving the devil-swapper RE challenge by @0x00pf . It was mostly intended for my personal archive but since it may be interesting to all of you I will try to format it in a clear and most importantly scrub friendly way for people like myself… Since I got stuck along&hellip;", "PrefaceOkay guys we’re not talking apt-get here. It’s about advanced persistent threats. Didn’t find anything about it here after using the search. What is it in short?An advanced persistent threat (APT) is a network attack in which an unauthorized person gains access to a network and stays th&hellip;", "Note: Multiple edits for typos (the ghost of a learning disability mostly overcome) and additional image upload occurred between 21:10 EST, 9/30/18 &amp; 22:23 EST 9/30/18 Last year I released the essay Shared thoughts after 6+ years in pentesting: (Shared thoughts after 6+ years in Pentesting). I dec&hellip;", "Introduction: Hardware Virtualization - Part #4294967295Hey ho fellow 0x00ers, Over the last weeks I have researched and wrote some articles about hardware virtualization. Nearly half of the planned articles are done. I will finish the other ones when I have some more time. Anyway, the important &hellip;", "This week’s guest: @REal0day!Professional career and adviceHello REal0day. Thanks for participating today! For starters, can you tell us a bit about yourself and your current role/job/work? I’m a Security Researcher at a startup that specializes in asset discovery and vulnerability assessment f&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "", "", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "As already said in IRC yesterday: great idea @skidd0 ! I think it’ll help to create somewhat of an identity behind the of pseudonym which is nice  I gladly take part in the interview if people want to know. Otherwise adding @0x00pf, @sprtn and @zSec to the vote is a must for sure. We probably are&hellip;", "Uhm well this is kinda awkward, I just had my laptop today and no Windows to try IDA or OllyDBG so I just ran this against the binary:  [image]Judging from they key-length last time I awk’ed for something similar. Took the first one that looked suspicious/encoded and took my chances. Since it’&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "Hi guys just got this @ricksanchez the file seems to be introduced on Aug 14 in webserver and is not in original src code. Here was what I found in server using ls -la,  [Capture] I will contact the sys admins to see find out any more info. About the actual contents of .ico file I guess smart fol&hellip;", "Hi there!  Thanks for a fun challenge! I’m sharing here the clear-text code in its final stage  As a malware researcher, I encounter tons of examples as this. My main method is to clean the noise and let the malicious code to decrypt itself. If there’ll be a request I’ll write you a write-up of how&hellip;", "changing the eval to an echo in the weird php code of the .ico and running it with php file reveals some new obfuscated php code. I renamed the variables to my best knowledge: https://bin.0x00sec.org/?636b78ef372b3298#0cYPTBYJlQnpcFVhdeaZxq7e692up51YBSTLxdhM7hc=", "So I’ve managed to get past the first level of obfuscation: This is what it evals: https://bin.0x00sec.org/?76470af471b05a47#rUUJouc5JzCU0HeRMzjbJVzXb+Y7RdsJ7Lk9HggR+BA=", "Check the 0x00bin ^^, I copied and pasted it there.", "woops I missed that ‘/’ in that URL there. my bad  edit: but yeah that .ico file looks suspicious. especially the mapping from numbers to characters halfway in", "http://eddywebs.com/password-generator/css/.d40df8b5.ico", "Reagrding the password generator: http://www.eddywebs.com/ if that’s the URL it points to his github which has:", "@net_phile, can you see what is inside of that file?", "Replacing all these ‘\\xYY’ with their respective ASCII representantion yields: @include &quot;/home/eddywebs/eddywebs.com/password-generator/css/.d40df8b5.ico&quot;;no idea what the ade56 is all about? maybe it’s supposed to be a clever algo cloaking the actual #include… wget eddywebs.com/password-genera&hellip;", "Replacing all these ‘\\xYY’ with their respective ASCII representantion yields: @include &quot;/home/eddywebs/eddywebs.com/password-generator/css/.d40df8b5.ico&quot;;no idea what the ade56 is all about? maybe it’s supposed to be a clever algo cloaking the actual #include… wget eddywebs.com/password-genera&hellip;", "Ooooh interesting. @ricksanchez check this out. Who wants some reverse engineering of real malware? @Cry0l1t3 @fraq @Evalion", "", "", "PrefaceThis quick article will give a short introduction on what fuzzers are, how they work and how to properly setup the afl - american fuzzy lop fuzzer to find flaws in arbitrary projects. Well known alternatives to afl (for the same or other purposes): boofuzz: Network Protocol Fuzzing for Hu&hellip;", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "It’s just an example, but you can customize the XFCE further. Take a look into this guide. It’s should give you some ideas about further customization.", "That the labels under the icons are not centered is triggering my OCD  . Also isn’t the top bar looking rather weird?", "Very inspirational. Thanks.", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "This topic was automatically closed after 30 days. New replies are no longer allowed.", "Welcome Back to Knowing Null!This week, you voted to bring in ricksanchez! Let’s just jump right into it.First, I’d like to thank you for joining this series of course, anytime  If people really feel the urge to get toknow more about me this is the perfect chance! Can you tell me and the read&hellip;", "Greetings my fellow hackers, As we continue with our series, the AMUNET app becomes complicated with new functionalities and structures to understand. We’ll sail right through. As stated earlier in previous tutorials, the app doesn’t fully exists because I build them before I share so forgive me if&hellip;", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "summoning the mighty @Sirius to copy &amp; paste his post from here nicely formatted to this wiki  Big Edit: ____ YOU CAN ADD YOUR OWN STUFF TO THAT LIST. IT’S FREE TO EDIT FOR EVERYONE. SO DON’T COMMENT, JUST ADD IT AS ALWAYS KEEP IT CLEAN AND CLASSY! THANK YOU FOR YOUR ATTENTION  ____", "Hey guys, back with just another casual article from me this time around since one of my projects failed miserably and I don’t really have the time for another serious one. Also I’ve getting into something new, as you may have already guessed, kernel-mode development! Yeah, pretty exciting stuff and&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "Welcome back to Knowing NullKnowing Null is a series of interviews randomly conducted on the 0x00sec IRC server and compiled here for your convenience. Today’s guest is the ever present pry0cc! But, first, a poll! Who do you want to see next time?fraqdtmricksanchezzSecsprtn0x00pfPhoenix&hellip;", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "Hi! Great idea you have there. We already had the same one and created the wiki section that is free to edit for anyone, so you can just add your recommendations to the initial post there ! Your Complete, Un-budgeted ToolkitCS-related Books [Wiki]", "Hi! Great idea you have there. We already had the same one and created the wiki section that is free to edit for anyone, so you can just add your recommendations to the initial post there ! Your Complete, Un-budgeted ToolkitCS-related Books [Wiki]", "", "Hi! Great idea you have there. We already had the same one and created the wiki section that is free to edit for anyone, so you can just add your recommendations to the initial post there ! Your Complete, Un-budgeted ToolkitCS-related Books [Wiki]", "Hi! Great idea you have there. We already had the same one and created the wiki section that is free to edit for anyone, so you can just add your recommendations to the initial post there ! Your Complete, Un-budgeted ToolkitCS-related Books [Wiki]", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "You lost @pry0cc !  [Screenshot_2018-05-27_13-36-08]I riced my rig to the absolute maximum.", "If we check the .dynsym sections again in readelf we can see that strcmp@GLIBC_2.0 is actually there but the .rel.plt section looks a bit cranky. We gotta fix that first  puts Info field with the correct value. In our case there should be an Info 00000107 instead of the 00000407  Relocation sectio&hellip;", "What fitting challenges  … This one is about patching the right index for the string table in the st_name field in the .dynsym section for the second puts call. When looking at the assembly code the second puts looks more like an intended strcmp with the loading of ‘kek’ in the register  right bef&hellip;", "Nice control over your ELF structures @ricksanchez, gj", "If we check the .dynsym sections again in readelf we can see that strcmp@GLIBC_2.0 is actually there but the .rel.plt section looks a bit cranky. We gotta fix that first  puts Info field with the correct value. In our case there should be an Info 00000107 instead of the 00000407  Relocation sectio&hellip;", "Nice control over your ELF structures @ricksanchez, gj", "What fitting challenges  … This one is about patching the right index for the string table in the st_name field in the .dynsym section for the second puts call. When looking at the assembly code the second puts looks more like an intended strcmp with the loading of ‘kek’ in the register  right bef&hellip;", "BabyELF                        _..--&quot;&quot;&quot;&quot;--...___                 .---,                      ,&#39; \\               `&#39;--.___        /   /                     /`\\  \\                      ``&#39;&#39;--:&#39;`--&#39;                    (  ,&#39;. &#39;.              _____..--&#39;&#39;`                    )__/`-&#39;._;__       .-&#39;`  &hellip;", "BabyELF RevengeDescriptionA BabyELF sequel since @0x00pf and @Leeky  nailed it in no time (I hope this one cannot be solved the same way ). RulesMake the binary display Congrats!Patch more than 4 bits and you’re disqualified. Don’t patch any instruction!Binarybase64 -d dump | gunzip &gt; &hellip;", "Hello fellow nerds, today I have decided to write a little article about my journey in resolving the Red Triangle ARG. So here we are ! Getting startedOnce you open the link you are prompted with a Red triangle on top, some hex encoded text below, a nice music played and 3 images: Two of them ha&hellip;", "If we check the .dynsym sections again in readelf we can see that strcmp@GLIBC_2.0 is actually there but the .rel.plt section looks a bit cranky. We gotta fix that first  puts Info field with the correct value. In our case there should be an Info 00000107 instead of the 00000407  Relocation sectio&hellip;", "What fitting challenges  … This one is about patching the right index for the string table in the st_name field in the .dynsym section for the second puts call. When looking at the assembly code the second puts looks more like an intended strcmp with the loading of ‘kek’ in the register  right bef&hellip;", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "I recently began reading up on the ELF format thanks to @ricksanchez’s article. This might be a fun exercise", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "oops… Directly added those to the sources section! How could I not have known that these exist!", "oops… Directly added those to the sources section! How could I not have known that these exist!", "Great post @ricksanchez! You can go a bit farther using C (Programming for Wannabes. Part II)… but we all know C is for wimps  Also this   The Price of Scripting: DietLibC vs ASM … we had the same idea! Congrats!", "Glad to see you have come back to this humble course. Hope you are eager to get a lot more stuff to digest. Grab some coffee and relax. I have been claiming that this course is going to be different to all those that you find over the Internet. Right now, I should introduce a whole bunch of boring &hellip;", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "Great post @ricksanchez! You can go a bit farther using C (Programming for Wannabes. Part II)… but we all know C is for wimps  Also this   The Price of Scripting: DietLibC vs ASM … we had the same idea! Congrats!", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "As already said in IRC yesterday: great idea @skidd0 ! I think it’ll help to create somewhat of an identity behind the of pseudonym which is nice  I gladly take part in the interview if people want to know. Otherwise adding @0x00pf, @sprtn and @zSec to the vote is a must for sure. We probably are&hellip;", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "As already said in IRC yesterday: great idea @skidd0 ! I think it’ll help to create somewhat of an identity behind the of pseudonym which is nice  I gladly take part in the interview if people want to know. Otherwise adding @0x00pf, @sprtn and @zSec to the vote is a must for sure. We probably are&hellip;", "Just to keep in mind, on this forum you can’t modify polls after you’ve started them, so we’d need a new poll.", "As already said in IRC yesterday: great idea @skidd0 ! I think it’ll help to create somewhat of an identity behind the of pseudonym which is nice  I gladly take part in the interview if people want to know. Otherwise adding @0x00pf, @sprtn and @zSec to the vote is a must for sure. We probably are&hellip;", "Agreed. I want to see @fraq and @ricksanchez, but I’m interested really to see @zSec and @sprtn, these guys are where I want to be in industry, and I don’t know their story, yet.", "Who are these scrublings? I want to see @0x00pf.", "Agreed. I want to see @fraq and @ricksanchez, but I’m interested really to see @zSec and @sprtn, these guys are where I want to be in industry, and I don’t know their story, yet.", "PrefaceThis quick article will give a short introduction on what fuzzers are, how they work and how to properly setup the afl - american fuzzy lop fuzzer to find flaws in arbitrary projects. Well known alternatives to afl (for the same or other purposes): boofuzz: Network Protocol Fuzzing for Hu&hellip;", "Welcome to the first Knowing Null interview, a serious randomly conducted on the 0x00sec IRC server and compiled here for your convenience. Today’s guest is non other than 0x00sec’s premier benefactor, l0k1! But! Before we jump in, who do you want to see next?suserfraqpry0ccricksanchez0&hellip;", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "Hello again! The results of the poll from my last post are very clear, so I’ve decided to go forward with the “Intro to Digital Forensics” topic Like I previously mentioned, this post will cover various topics regarding Digital Forensics, hopefully serving as a good introduction to the field. I’m n&hellip;", "Ay nice! That’s basically the windows counterpart  to my exploit mitigation series (DEP edition). Nice to see both sides covered now.", "Ay nice! That’s basically the windows counterpart  to my exploit mitigation series (DEP edition). Nice to see both sides covered now.", "PrefaceOkay guys we’re not talking apt-get here. It’s about advanced persistent threats. Didn’t find anything about it here after using the search. What is it in short?An advanced persistent threat (APT) is a network attack in which an unauthorized person gains access to a network and stays th&hellip;", "Ay nice! That’s basically the windows counterpart  to my exploit mitigation series (DEP edition). Nice to see both sides covered now.", "Ay nice! That’s basically the windows counterpart  to my exploit mitigation series (DEP edition). Nice to see both sides covered now.", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "suser was being suser.  No worries @Nestor10 it was just flagged/hidden because it was no helpful for this thread and the potential discussions about it", "This topic was automatically closed after 30 days. New replies are no longer allowed.", "Programming Turing Machines: IntroductionBack again with another theory-heavy topic!  The project I’ve been working on is quite extensive so it will be split into three parts: IntroductionImplementationHigh-level ApproachAs these topics are created, they will be linked together for easy navig&hellip;", "A portion of the title of this post refers to an idea put forth by Gregory S. Paul in the book “Tyrannosaurus: Tyrant King”; as both a (probable) scavenger and predator living during dangerous times, the T.Rex does not seemed to have had an exceptionally long life span. I find this a fitting metaph&hellip;", "SEP- We live in interesting times my friend. CHina has risen to a  big 5 superpower. In the 20th century, they utilize their the potential of their massive workforce to enact a relatively rapid shift that leads them toward becoming the world’s leading manufcaturer. In order to do this, they also&hellip;", "pry0cc- I have watched these operators pretty closely; the article itself is a living article and will be added to and edited, with new editions released. They seem to be playing a smart game: the server scans perpetually for vulnerabilities and seems to change up to attack newer vulns much quicke&hellip;", "You lost @pry0cc !  [Screenshot_2018-05-27_13-36-08]I riced my rig to the absolute maximum.", "Well dude, wow. This is a super clean setup, I never see XFCE these days anymore. You definitely won as far as minimalism goes.", "You lost @pry0cc !  [Screenshot_2018-05-27_13-36-08]I riced my rig to the absolute maximum.", "To kickstart this, I am going to share my setup: This is the imgur album if you wish to peruse, but I am going to post it below anyway:                                                                                  [Album] This is Croc0, and this is my i3wm setup.                          &hellip;", "Originally American fuzzy lop  is a fuzzer for usage on UNIX based systems. Due to the sheer popularity and greatness of afl  some forks appeared like winafl. I never tried it but it still seems to be maintained since the last commit was 3 days ago. No guarantee on that this fork is as good/fast &hellip;", "Finally managed to finish it too  $ ./crackme VM{M4TR1X} Congratulations! You did it!", "", "@Faelon we have  no affilaition  with HTB whatsoever. I’m happy that you’re enjoying their service but posting here won’t get you any invite code. Nevertheless feel free share your research in an article here", "Originally American fuzzy lop  is a fuzzer for usage on UNIX based systems. Due to the sheer popularity and greatness of afl  some forks appeared like winafl. I never tried it but it still seems to be maintained since the last commit was 3 days ago. No guarantee on that this fork is as good/fast &hellip;", "Yeah, this is a great idea with caveats. Let’s call this what it is: A mentorship program. I’d love to see labels by names that call people out as mentors who can help people with the things you mentioned such as suggesting topics, providing editorial assistance, etc.", "@pry0cc and @fraq  recently announced that 0x00sec will be reformed. They did this in an internal thread in the VIP loungue. I am not the right person to explain it to the big public (the staff will do in the near future probably), but basically we want 0x00sec to be more varied instead of being sol&hellip;", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "Finally managed to finish it too  $ ./crackme VM{M4TR1X} Congratulations! You did it!", "Finally managed to finish it too  $ ./crackme VM{M4TR1X} Congratulations! You did it!", "Finally managed to finish it too  $ ./crackme VM{M4TR1X} Congratulations! You did it!", "This is a PoC-style test run for an application that I am currently developing as a personal project. Should anything weird happen, please report it to me and I’ll try to fix it. This is just a simple crackme so it shouldn’t be too hard once you start to figure out what’s happening… maybe…?  Diffic&hellip;", "Finally managed to finish it too  $ ./crackme VM{M4TR1X} Congratulations! You did it!", "PrefaceThis quick article will give a short introduction on what fuzzers are, how they work and how to properly setup the afl - american fuzzy lop fuzzer to find flaws in arbitrary projects. Well known alternatives to afl (for the same or other purposes): boofuzz: Network Protocol Fuzzing for Hu&hellip;", "Note: We&#39;re not on freenodeThe network is  irc.0x00sec.org:6697 . It’s up and running and inhabitated", "Note: We&#39;re not on freenodeThe network is  irc.0x00sec.org:6697 . It’s up and running and inhabitated", "I was already there, but somehow my client is not able to connect…therefore - after my vacation - I thought it is freenode. FML!", "Note: We&#39;re not on freenodeThe network is  irc.0x00sec.org:6697 . It’s up and running and inhabitated", "OSINT - Passive Recon and Passive Discovery Of AssetsSup 0x00’ers, to kick this badass series off, I am going to begin with the most important aspect of pentesting. Passive Recon and OSINT. Now, do not let the word ‘passive’ fool you. This is no light recon, you can uncover vast amounts of infomati&hellip;", "In addition to that there is still scrapy as well, depending on what you want to achieve BS4 might not be suitable anymore. Played around with BS4 and scrapy a bit and on first glance scrapy looked a tad more powerful to me", "PrefaceThis quick article will give a short introduction on what fuzzers are, how they work and how to properly setup the afl - american fuzzy lop fuzzer to find flaws in arbitrary projects. Well known alternatives to afl (for the same or other purposes): boofuzz: Network Protocol Fuzzing for Hu&hellip;", "PrefaceThis quick article will give a short introduction on what fuzzers are, how they work and how to properly setup the afl - american fuzzy lop fuzzer to find flaws in arbitrary projects. Well known alternatives to afl (for the same or other purposes): boofuzz: Network Protocol Fuzzing for Hu&hellip;", "PrefaceThis quick article will give a short introduction on what fuzzers are, how they work and how to properly setup the afl - american fuzzy lop fuzzer to find flaws in arbitrary projects. Well known alternatives to afl (for the same or other purposes): boofuzz: Network Protocol Fuzzing for Hu&hellip;", "PrefaceThis quick article will give a short introduction on what fuzzers are, how they work and how to properly setup the afl - american fuzzy lop fuzzer to find flaws in arbitrary projects. Well known alternatives to afl (for the same or other purposes): boofuzz: Network Protocol Fuzzing for Hu&hellip;", "PrefaceThis quick article will give a short introduction on what fuzzers are, how they work and how to properly setup the afl - american fuzzy lop fuzzer to find flaws in arbitrary projects. Well known alternatives to afl (for the same or other purposes): boofuzz: Network Protocol Fuzzing for Hu&hellip;", "PrefaceThis quick article will give a short introduction on what fuzzers are, how they work and how to properly setup the afl - american fuzzy lop fuzzer to find flaws in arbitrary projects. Well known alternatives to afl (for the same or other purposes): boofuzz: Network Protocol Fuzzing for Hu&hellip;", "PrefaceThis quick article will give a short introduction on what fuzzers are, how they work and how to properly setup the afl - american fuzzy lop fuzzer to find flaws in arbitrary projects. Well known alternatives to afl (for the same or other purposes): boofuzz: Network Protocol Fuzzing for Hu&hellip;", "PrefaceThis quick article will give a short introduction on what fuzzers are, how they work and how to properly setup the afl - american fuzzy lop fuzzer to find flaws in arbitrary projects. Well known alternatives to afl (for the same or other purposes): boofuzz: Network Protocol Fuzzing for Hu&hellip;", "PrefaceThis quick article will give a short introduction on what fuzzers are, how they work and how to properly setup the afl - american fuzzy lop fuzzer to find flaws in arbitrary projects. Well known alternatives to afl (for the same or other purposes): boofuzz: Network Protocol Fuzzing for Hu&hellip;", "Yes. Many CD or serial inputs expect only a-z0-9 and even not necessarily distinguish  between upper and lower case (e.g.: lower case input is casted to upper case automatically). That obviously reduces the possible key space by quite a bit, but as @Wunkolo already pointed out the possible combinati&hellip;", "https://www.phishtank.com/phish_search.php?verified=u&amp;active=y (Active Phishing  Urls)http://www.virussign.com/ (Malware Packs) 3.http://vxvault.net/ViriList.php?s=40&amp;m=40 (Malware Sources) 4.http://siri-urz.blogspot.com/  (Malware Blog) 5.http://malc0de.com/database/  (Malware Sources) 6.6.h&hellip;", "remove the thread and my account and all my threads.", "Please keep it civil here. Otherwise this thread is locked/removed. Thanks", "", "suser was being suser.  No worries @Nestor10 it was just flagged/hidden because it was no helpful for this thread and the potential discussions about it", "suser was being suser.  No worries @Nestor10 it was just flagged/hidden because it was no helpful for this thread and the potential discussions about it", "Thumb code is just one of the facets of the ARM arch so it might be hard to find a book or discipline around just Thumb code in particular. Thumb is just a subset of sorts for an ARM processor so once you learn the ARM side of things, you’ll find that Thumb code is just one particular feature of mos&hellip;", "DISCLAIMER: Article originally published on immunIT. Hi fellas, Today, I will introduce you a new tool, developed for the sake of my penetration testing activities, named Drupwn which claims to provide a reliable and efficient way to perform enumerations on Drupal web applications. You may thin&hellip;", "I managed to open the 1.33 firmware file just fine in IDA Pro after reading the data-sheet and knowing where certain addresses should be mapped to. Here’s the datasheet for the STM32F103 Check out the memory map of Section 4 to give you some insight on the address space so you’ll know where to map&hellip;", "Hi! As for your big reverse engineering frameworks You can always check out the new IDA 7 free version which is quite limited in terms of functionality tho. Otherwise if you can spare a few bucks check out binaryninja. It’s not yet on par with the paid IDA version but for your general CTF style E&hellip;", "It’s like you didn’t read OP at all.", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "Sure. As far as I’m informed wine tries to emulate  certain windows specific paths and files and downloads a bunch of stuff for that in the background. Never heard someone trying to run malware via wine  . If anything I’d vote for the same what @dtm suggested with a dedicated  malware windows VM.", "Thanks all Thank @ricksanchez I will try to find out more about this if possible.", "Hi! As for your big reverse engineering frameworks You can always check out the new IDA 7 free version which is quite limited in terms of functionality tho. Otherwise if you can spare a few bucks check out binaryninja. It’s not yet on par with the paid IDA version but for your general CTF style E&hellip;", "Hi! As for your big reverse engineering frameworks You can always check out the new IDA 7 free version which is quite limited in terms of functionality tho. Otherwise if you can spare a few bucks check out binaryninja. It’s not yet on par with the paid IDA version but for your general CTF style E&hellip;", "Hi! As for your big reverse engineering frameworks You can always check out the new IDA 7 free version which is quite limited in terms of functionality tho. Otherwise if you can spare a few bucks check out binaryninja. It’s not yet on par with the paid IDA version but for your general CTF style E&hellip;", "Hello 0x00sec! As some of you may have seen in IRC, I have promised to deliver an article. But I couldn’t unfortunately, because my work has been intense lately. Then I thought that I could translate a few of my blog posts which I’m writing on my website (http://www.robindimyanoglu.com) as a less t&hellip;", "Nice tutorial! I remember spending my all night on this. Can’t explain the feeling I had when I eventually cracked it (or defuse to be correct :D)", "PrefaceAfter a break because life kept me busy the next part of this beginner series is here. I will try to finish these articles rather quick now if they are staying on the this level, since I wanna dive deeper into different waters but in the end I dislike unfinished projects. As always: I st&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "I solved it as it was intended. Feeling no glory now anymore with that hint being given by @_py tho  … Anyways…  First things first impressive solution  @ATGC . As in the extended solution above I first used tools like gdb readelf objdump xxd/hexdump on that file. I came to the s&hellip;", "PrefaceThis is a write-up for solving the devil-swapper RE challenge by @0x00pf . It was mostly intended for my personal archive but since it may be interesting to all of you I will try to format it in a clear and most importantly scrub friendly way for people like myself… Since I got stuck along&hellip;", "PrefaceOkay guys we’re not talking apt-get here. It’s about advanced persistent threats. Didn’t find anything about it here after using the search. What is it in short?An advanced persistent threat (APT) is a network attack in which an unauthorized person gains access to a network and stays th&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "@spawnpt sweet! added it to the top post for better visibility", "Was wanting to look into APTs but never really had the time. Thanks for spoonfeeding me some resources, really enjoying the information I’m finding.", "@spawnpt sweet! added it to the top post for better visibility", "Here is another repo that has a bunch more than just APTnotes https://github.com/CyberMonitor/APT_CyberCriminal_Campagin_Collections", "PrefaceOkay guys we’re not talking apt-get here. It’s about advanced persistent threats. Didn’t find anything about it here after using the search. What is it in short?An advanced persistent threat (APT) is a network attack in which an unauthorized person gains access to a network and stays th&hellip;", "It is very interesting for me to hear all this from you.", "PrefaceOkay guys we’re not talking apt-get here. It’s about advanced persistent threats. Didn’t find anything about it here after using the search. What is it in short?An advanced persistent threat (APT) is a network attack in which an unauthorized person gains access to a network and stays th&hellip;", "@bluretrece I replaced the link. You can download the binary from there", "This topic was automatically closed after 30 days. New replies are no longer allowed.", "@bluretrece I replaced the link. You can download the binary from there", "Hi @ricksanchez, thank you very much for this post! Any chance you still have a link for the binary for this tutorial? The link seems to be dead  Thanks in advance!", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "PrefaceThis is a write-up for solving the devil-swapper RE challenge by @0x00pf . It was mostly intended for my personal archive but since it may be interesting to all of you I will try to format it in a clear and most importantly scrub friendly way for people like myself… Since I got stuck along&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "No hate but if you consider pentesting just as something what @pry0cc said: Then you don’t necessarily need to know C/C++. Fair enough. But if you strive to understand what is going on under the hood, what a learning and evolving individual should do then imo knowing low level languages will help&hellip;", "No hate but if you consider pentesting just as something what @pry0cc said: Then you don’t necessarily need to know C/C++. Fair enough. But if you strive to understand what is going on under the hood, what a learning and evolving individual should do then imo knowing low level languages will help&hellip;", "This is essentially the difference between an X and a good X. The good one’s will want to understand why, and in this case some lower-level programming and OS stuff will be necessary.", "No hate but if you consider pentesting just as something what @pry0cc said: Then you don’t necessarily need to know C/C++. Fair enough. But if you strive to understand what is going on under the hood, what a learning and evolving individual should do then imo knowing low level languages will help&hellip;", "No hate but if you consider pentesting just as something what @pry0cc said: Then you don’t necessarily need to know C/C++. Fair enough. But if you strive to understand what is going on under the hood, what a learning and evolving individual should do then imo knowing low level languages will help&hellip;", "No hate but if you consider pentesting just as something what @pry0cc said: Then you don’t necessarily need to know C/C++. Fair enough. But if you strive to understand what is going on under the hood, what a learning and evolving individual should do then imo knowing low level languages will help&hellip;", "Userland API Monitoring and Code Injection DetectionAbout This PaperThe following document is a result of self-research of malicious software (malware) and its interaction with the Windows Application Programming Interface (WinAPI). It details the fundamental concepts behind how malware is able to&hellip;", "Let us take an “official” definition of an engineer from the oxford dictionary: A person who designs, builds, or maintains engines, machines, or structures. Judging from that a hacker may fall into that category, but I think a hacker does/can do more than just that. He usually has more in depth&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "The engineer you know does that. That does not mean every single engineer on the planet does that. There is a crucial difference between these two terms that both @Evalion @ricksanchez and @fraq are missing. “Engineer” is a job title, anybody can attain this with schooling. “Hacker” is a mindset. &hellip;", "Let us take an “official” definition of an engineer from the oxford dictionary: A person who designs, builds, or maintains engines, machines, or structures. Judging from that a hacker may fall into that category, but I think a hacker does/can do more than just that. He usually has more in depth&hellip;", "I wouldnt call myself an engineer just because I can replace obvious parts or do some “garden cleanup” honestly… Never doubted that. You’re not sergant space chief instructor of mars just because you have a piece of paper hanging on your wall saying that. Exactly. That was my whole point. I n&hellip;", "If you think that is what an engineer lacks, then you could not be farther from the truth. I am personally close to a certified and experienced engineer and you would not believe the shit he is capable of. Need your brake pads replaced? No problem. Have issues with an electrical system? No problem.&hellip;", "If you think that is what an engineer lacks, then you could not be farther from the truth. I am personally close to a certified and experienced engineer and you would not believe the shit he is capable of. Need your brake pads replaced? No problem. Have issues with an electrical system? No problem.&hellip;", "Let us take an “official” definition of an engineer from the oxford dictionary: A person who designs, builds, or maintains engines, machines, or structures. Judging from that a hacker may fall into that category, but I think a hacker does/can do more than just that. He usually has more in depth&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "Firstly, due to my insane schedule, I do not get to interact with all of you as I would like. Let me take this opportunity to state that many of you are doing incredible work with the content of your posts; I do read just about everything released here on the Big 0; I am proud to be here among such&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "This totally reads like a counter part to the not too long ago published phrack article The Fall of Hacker Groups. While it was an interesting read with a lot of truth in it I think the author neglected the part that hackers in general somewhat evolved over time too, even when trying to stay close &hellip;", "This totally reads like a counter part to the not too long ago published phrack article The Fall of Hacker Groups. While it was an interesting read with a lot of truth in it I think the author neglected the part that hackers in general somewhat evolved over time too, even when trying to stay close &hellip;", "Meant the Phrack article! Your essays are focused on the positive side of things  which I was missing in his. 100% agree on this.", "They made the internet at large the central hub of all modern civilization. Of course, they need true hackers now more than ever. I couldn’t agree more with your essay. Totally captures the right vibe. @ricksanchez - I too loved that Phrack article, although I agree they didn’t touch on how we’ve &hellip;", "Meant the Phrack article! Your essays are focused on the positive side of things  which I was missing in his. 100% agree on this.", "Meant the Phrack article! Your essays are focused on the positive side of things  which I was missing in his. 100% agree on this.", "This totally reads like a counter part to the not too long ago published phrack article The Fall of Hacker Groups. While it was an interesting read with a lot of truth in it I think the author neglected the part that hackers in general somewhat evolved over time too, even when trying to stay close &hellip;", "Do you mean this article or the Phrack one? Also, I do agree that it’s critically important to integrate the hacker mindset in everyday life. Complex systems interacting produce emergent systems with undefined behaviors, which is exactly the sort of thing that the creative hacker can navigate.", "This totally reads like a counter part to the not too long ago published phrack article The Fall of Hacker Groups. While it was an interesting read with a lot of truth in it I think the author neglected the part that hackers in general somewhat evolved over time too, even when trying to stay close &hellip;", "We Need Hackers Now More Than EverI“Yes, I am a criminal. My crime is that of curiosity.” In the years since The Hacker Manifesto was first typed out, much of the internet has changed. It has grown in both size and scope. New protocols have been invented. The web was born. It is altogether diffe&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "@Sirius, this is the @ricksanchez we’re talking about here. Exactly. Stop doubting me y’all  Do you come from the future?! O.o You should have clicked the link below that. Redirects to the Black Hat Asia 2018 site, where you can find a short briefing about that upcoming talk  Awesome write-&hellip;", "Actually I’m not much of a help for that. Never took any certification exam nor do I know what topics CEH V9 covers. as a general advice: do research on your own on top of working through the curriculum.  If you’re truly interested in the topics covered by CEH this ‘extra work’ will not feel like &hellip;", "@Sirius, this is the @ricksanchez we’re talking about here. Exactly. Stop doubting me y’all  Do you come from the future?! O.o You should have clicked the link below that. Redirects to the Black Hat Asia 2018 site, where you can find a short briefing about that upcoming talk  Awesome write-&hellip;", "Small addition to that: If you don’t have the metasploit framework installed but are using either pwntools or a gdb enhancement like pwndbg you can use either to create cyclic patterns as well: Using pwntools: &gt;&gt;&gt; from pwn import *&gt;&gt;&gt; print cyclic(256)aaaabaaacaaadaaaeaaafaaagaaahaaaiaaajaaaka&hellip;", "it’s absolutely a lot of fun, im reading CEH books and Advanced pentesting related books, and hell yeah im getting excited with each page i read LOL! Regarding the research, i’ve seen many blogs, forums and hacking chats IRCs or Discord hacking related chats, my conclusion is programming language li&hellip;", "it’s absolutely a lot of fun, im reading CEH books and Advanced pentesting related books, and hell yeah im getting excited with each page i read LOL! Regarding the research, i’ve seen many blogs, forums and hacking chats IRCs or Discord hacking related chats, my conclusion is programming language li&hellip;", "Actually I’m not much of a help for that. Never took any certification exam nor do I know what topics CEH V9 covers. as a general advice: do research on your own on top of working through the curriculum.  If you’re truly interested in the topics covered by CEH this ‘extra work’ will not feel like &hellip;", "@Sirius, this is the @ricksanchez we’re talking about here. Exactly. Stop doubting me y’all  Do you come from the future?! O.o You should have clicked the link below that. Redirects to the Black Hat Asia 2018 site, where you can find a short briefing about that upcoming talk  Awesome write-&hellip;", "Awesome write-up as usual!", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "@Sirius, this is the @ricksanchez we’re talking about here.", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "we already had a similar topic on C vs C++ Maybe you’ll find your answer there. Otherwise  if you have a particular question hit up either @oaktree or @dtm for more information", "Yep this question has an answer… For anything more, IRC please.", "we already had a similar topic on C vs C++ Maybe you’ll find your answer there. Otherwise  if you have a particular question hit up either @oaktree or @dtm for more information", "I don’t know why for example in Carberp they use C-style char over std::string, no classes just C struct … does it give a differenet binary ?", "we already had a similar topic on C vs C++ Maybe you’ll find your answer there. Otherwise  if you have a particular question hit up either @oaktree or @dtm for more information", "Small addition to that: If you don’t have the metasploit framework installed but are using either pwntools or a gdb enhancement like pwndbg you can use either to create cyclic patterns as well: Using pwntools: &gt;&gt;&gt; from pwn import *&gt;&gt;&gt; print cyclic(256)aaaabaaacaaadaaaeaaafaaagaaahaaaiaaajaaaka&hellip;", "Thanks, the channel was news to me. Definitely will check it out after exams, since I wanna get started with C as well", "True! Also if you are using windbg and immunity in the future with mona.py you can use pc 256To generate and po 0xd34db33fto find the offset.", "Small addition to that: If you don’t have the metasploit framework installed but are using either pwntools or a gdb enhancement like pwndbg you can use either to create cyclic patterns as well: Using pwntools: &gt;&gt;&gt; from pwn import *&gt;&gt;&gt; print cyclic(256)aaaabaaacaaadaaaeaaafaaagaaahaaaiaaajaaaka&hellip;", "Community Assigned Level:NewbieWannabeHackerWizardGuru0voters Show resultsThere won’t be anything groundbreaking in here, and a lot of the content will be sourced from others (properly attributed, mind you). However, I am going to try to bring a different perspective to the t&hellip;", "Small addition to that: If you don’t have the metasploit framework installed but are using either pwntools or a gdb enhancement like pwndbg you can use either to create cyclic patterns as well: Using pwntools: &gt;&gt;&gt; from pwn import *&gt;&gt;&gt; print cyclic(256)aaaabaaacaaadaaaeaaafaaagaaahaaaiaaajaaaka&hellip;", "Got &#39;em.  [image]", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "This is a good chance to go as far as you can, document your work, share it, and just ask, “Hey, what’s my next step?” We love those kinds of journeys and helping people out!", "php5.3以下已经不多见了，不过还是谢谢分享，学到了 EDIT: English translation (from Chinese) by @ricksanchez: PHP version 5.3 is kinda rare nowadays but thank you for sharing it. I learned something", "Absolutely! Those with a higher trust level can edit posts. If you’re up for it, talk to me in IRC later today.", "As we start to see an influx of articles, can we get a couple of native english English-speaking volunteers to go through and edit each post (While while working closely with the author, of course) to ensure proper grammar and flow for easy reading, especially for those who’s whose first language is&hellip;", "It’s been a while since the last edition (I do say this every time). Behold, a seventh article! Allow me to restate the prerequisites: Proficiency in CUnderstanding of the Stack vs HeapFamiliarity with this article’s predecessors (all of them).Disclaimer: what follows are my findings, and my &hellip;", "It’s been a while since the last edition (I feel like I say this every time). What you’re looking at is the sixth installment of my [C] Dynamic Memory Series. I’ll start this paper by enumerating some prerequisites: Proficiency in CUnderstanding of the Stack vs HeapUnderstanding of sbrk and br&hellip;", "Hello 0x00sec! This is the fifth installment of my Dynamic Memory series. In my last article, I went through using brk and sbrk to alter a process’s program break. After a decent amount of studying, I have some code to show all of you. I set out to roughly implement malloc and free and I have done&hellip;", "Hi everyone! It’s been a while since Part 3, but rest assured that the wait has been worth it! (I hope) This paper will cover the Linux versions of two system calls that are paramount in memory management. The same system calls, possibly different in implementation, exist on *BSD and its derivative&hellip;", "The last two (1 and 2) articles covered the main differences between stack/heap as well as using arrays on the heap. Now, I’m going to walk you guys through resizing these heap-allocated arrays. See, you might not always know – at compile time – how much memory you will need. Thus, we can write cod&hellip;", "Alright. Because I like doing these and find this topic to be “okay”, difficulty-wise, I’m doing two articles in two days. This is Part 2.0, the followup to Part 1.0, which was about using malloc and free on pointers. In this article, we’ll be using the same functions (malloc and free), but with ar&hellip;", "Alright! After receiving positive responses to my proposal, I’m ready to start this [C] Dynamic Memory series. Here are some suggested prerequisites: Basic Understanding of Imperative ProgrammingBasic C Programming KnowledgeConfidence with PointersAnd what pointers representWhether or no&hellip;", "Freestyle February: A 0x00sec Article ContestHello 0x00ers! The 0x00sec Staff is happy to announce our first annual Freestyle February! Here’s how it works: Take up until the last day of February to research something technical, something from which the 0x00sec community might benefit. Then, po&hellip;", "This is amazing. This is what an awesome hacking community like this does. Good job everybody involved!", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "Don’t Download From Untrusted Links!If it’s not from the people who wrote it, it’s untrusted. I know this sounds like super basic stuff but we’ve had to delete/unlist a few posts recently where people (I’m talking about you, @the_heat_man) are posting sketchy links to download tools instead of poi&hellip;", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "There will be a time when I finally pick up heap shenanigans and I will do all those challenges @_py! Promised", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "There will be a time when I finally pick up heap shenanigans and I will do all those challenges @_py! Promised", "There will be a time when I finally pick up heap shenanigans and I will do all those challenges @_py! Promised", "Time to step up the game. Keep in mind there is more than one way to solve it. Good luck. RulesFeel free to pwn the binary on Ubuntu 16.04 or 17.04. Extra credits if you pwn it on 17.04. Don’t ask me for hints. Hints will only be given 1 month after the challenge’s release as long as there a&hellip;", "There will be a time when I finally pick up heap shenanigans and I will do all those challenges @_py! Promised", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "When I first heard about polyglot files I was totally blown away honestly. After skimming through PoC||GTFO this feeling came somewhat back, since they managed to pack everything in a ‘benign looking pdf’. Cool stuff @fraq!", "When I first heard about polyglot files I was totally blown away honestly. After skimming through PoC||GTFO this feeling came somewhat back, since they managed to pack everything in a ‘benign looking pdf’. Cool stuff @fraq!", "When I first heard about polyglot files I was totally blown away honestly. After skimming through PoC||GTFO this feeling came somewhat back, since they managed to pack everything in a ‘benign looking pdf’. Cool stuff @fraq!", "When I first heard about polyglot files I was totally blown away honestly. After skimming through PoC||GTFO this feeling came somewhat back, since they managed to pack everything in a ‘benign looking pdf’. Cool stuff @fraq!", "It’s a neat attack and I’m looking forward to playing with to find the best way to use it.", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "When I first heard about polyglot files I was totally blown away honestly. After skimming through PoC||GTFO this feeling came somewhat back, since they managed to pack everything in a ‘benign looking pdf’. Cool stuff @fraq!", "Note: This is a repost from my personal blog GIF/Javascript Polyglots: Abusing GIFs, tags, and MIME types for evil6 minute read The backstoryRecently I saw a feature on a product I work on where we allowed hotlinking to arbitrary gifs without pulling them in, mangling, and then saving for our ow&hellip;", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "IntroductionHello folks, I hope you’re doing great! Today’s topic will be once again heap exploitation related. In fact, we’ll be going over the recent updates of glibc’s heap allocator, (pt)malloc, which I’ve researched/reversed lately and decided to present them to you since there is barely any i&hellip;", "Good job! I wish I had the money to just buy everything and have it ready right now. This also could easily develop to a whole series of articles. “The hackers Lab” and so, where essentials to have or must needs are presented. Keep it up!", "PrefaceThis write up are my thoughts and steps to analyze a given unknown binary. I want to understand the binary to a point where I can freely write about it. So here it is. I’m always open for you pointing out mistakes or giving feedback to me Disclaimer:I won’t look at the assembly code to p&hellip;", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "@VVid0w haha I would do one too but we’re in the same situation. I could just afford a few hardware pieces over the next couple of months. So my article would be published in 2018 …", "Good job! I wish I had the money to just buy everything and have it ready right now. This also could easily develop to a whole series of articles. “The hackers Lab” and so, where essentials to have or must needs are presented. Keep it up!", "The hardest GNU/Linux reverse engineering in the 0x00sec CTF 2017 event was OBFTEANATION. Only 2 person solved this challenge during the competition, so I guess some of you have been waiting for this write up. I just wrote it to be hard but I didn’t try to solve it myself until now. Of course it is&hellip;", "Very neat and detailed writeup @0x00pf . Good job on this. I love it for a beginner/entry challenge, since it’s not just plain reversing on easy mode, but essentially teaches you to understand and especially read the code carefully. If you can do this you can easily spot the ninja way  . If not y&hellip;", "Very neat and detailed writeup @0x00pf . Good job on this. I love it for a beginner/entry challenge, since it’s not just plain reversing on easy mode, but essentially teaches you to understand and especially read the code carefully. If you can do this you can easily spot the ninja way  . If not y&hellip;", "Very neat and detailed writeup @0x00pf . Good job on this. I love it for a beginner/entry challenge, since it’s not just plain reversing on easy mode, but essentially teaches you to understand and especially read the code carefully. If you can do this you can easily spot the ninja way  . If not y&hellip;", "Very neat and detailed writeup @0x00pf . Good job on this. I love it for a beginner/entry challenge, since it’s not just plain reversing on easy mode, but essentially teaches you to understand and especially read the code carefully. If you can do this you can easily spot the ninja way  . If not y&hellip;", "Very neat and detailed writeup @0x00pf . Good job on this. I love it for a beginner/entry challenge, since it’s not just plain reversing on easy mode, but essentially teaches you to understand and especially read the code carefully. If you can do this you can easily spot the ninja way  . If not y&hellip;", "Shuffled Love (you need to register) was one of the Linux 64bits reverse challenges available to be solved during the recent 0x00Sec CTF Winter 2017 edition. This challenge was intended to be easy and at the end 42 persons were able to solve it. Before continuing, I’d like to say that there are man&hellip;", "Hi 0x00’ers, and all those that took part in 0x00ctf 2017! First off, we want to thank all of our challenge creators, admins, and participants. CTFs are a great opportunity for us as a community to sharpen our skills, challenge ourselves and each other with new problems, and meet new people who sha&hellip;", "PrefaceThis write up are my thoughts and steps to analyze a given unknown binary. I want to understand the binary to a point where I can freely write about it. So here it is. I’m always open for you pointing out mistakes or giving feedback to me Disclaimer:I won’t look at the assembly code to p&hellip;", "@ricksanchez, you are right, I shared the link because it is a nice example of how things are done, I mean how to decrypt the DB using the master key, so without the master key, you can’t do much with this script I guess.", "In the case of Firefox, if a strong Master Password is chosen, account details are very unlikely to be harvested. Doesn’t this still hold even in the case of the script? If I, as an adversary, would run this script on a computer with just ./firefox_decrypt.py it doesn’t do much without a master &hellip;", "This simple python script decrypts all accounts and passwords stored in FF:  Enjoy", "12/10 2017 1 - Internet ChemotherapyInternet Chemotherapy was a 13 month project between Nov 2016 - Dec 2017. It has been known under names such as ‘BrickerBot’, ‘bad firmware  upgrade’, ‘ransomware’, ‘large-scale network failure’ and even ‘unprecedented terrorist actions.’ That last one was a lit&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "Yesssss!!! Stack Canaries pleaseeee!!!", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "Either something is up with your system, or what’s more likely is that there is more than one occurrence of /bin/sh and strings outputs the latter offset for some weird reason (?). PoC (x86_64 but doesn’t matter): &gt;&gt; strings -a -t x /lib/x86_64-linux-gnu/libc.so.6 | grep &quot;/bin/sh&quot;18cd17 /bin/sh&hellip;", "Hi @_py, Just for anyone that is following the thread. There is one single &quot;/bin/sh&quot; on my libc, otherwise, strings should had shown all of them. What you said is perfectly fine and my system is OK ;). It was may bad that I assume you were using the output of ldd as libc_base (that is what didn’t &hellip;", "Slightly off-topic. But couldn’t resist  Remember kids: If something doesn’t work with the tools provided, built your own. keeps your scripting/programming  knowledge up2dateimplants used knowledge even deepercoolness factor+1Just fits perfectly after reading through PoC||GTFO right now and &hellip;", "Slightly off-topic. But couldn’t resist  Remember kids: If something doesn’t work with the tools provided, built your own. keeps your scripting/programming  knowledge up2dateimplants used knowledge even deepercoolness factor+1Just fits perfectly after reading through PoC||GTFO right now and &hellip;", "Slightly off-topic. But couldn’t resist  Remember kids: If something doesn’t work with the tools provided, built your own. keeps your scripting/programming  knowledge up2dateimplants used knowledge even deepercoolness factor+1Just fits perfectly after reading through PoC||GTFO right now and &hellip;", "a pointer to where /bin/sh actually is. not the string itself.", "Slightly off-topic. But couldn’t resist  Remember kids: If something doesn’t work with the tools provided, built your own. keeps your scripting/programming  knowledge up2dateimplants used knowledge even deepercoolness factor+1Just fits perfectly after reading through PoC||GTFO right now and &hellip;", "Hi @WhiteCollar The system function actually executes /bin/sh -c command (see the man page). An sh: 1 something means that you have successfully called system but with the wrong parameter. Whatever follows the sh: 1 is what you have tried to execute… that may be non-printable garbage. Said that, a&hellip;", "Slightly off-topic. But couldn’t resist  Remember kids: If something doesn’t work with the tools provided, built your own. keeps your scripting/programming  knowledge up2dateimplants used knowledge even deepercoolness factor+1Just fits perfectly after reading through PoC||GTFO right now and &hellip;", "You should pass the pointer to /bin/sh. How are you calculating sh’s address on the stack? If you’re using gdb to find that out, then that’s your mistake. The stack alignment/padding inside and outside of gdb is different (environment variables etc). That being said, you can either use pwntools as I&hellip;", "In regards to _py’s answer, shouldn’t system(0xffffd144) work then since 0xffffd144 is a pointer to “/bin/sh”?", "First of all, it’s 2017, let me introduce you to pwntools! There is no need to hardcode your exploit in an one-liner. I’m away currently, but from a really quick look it looks like once you overflow the buffer up until the return address, you’ve entered system’s address, which is correct and then y&hellip;", "a pointer to where /bin/sh actually is. not the string itself.", "Only 5 days guys! Get ready!", "Hello there! We’re all noobs at hacking here all looking to learn so I’ll try to answer your questions to the best of my ability. The reason I chose to rebuild the import table there is because it is much simpler compared to constantly having to use ReadProcessMemory to query the import table and &hellip;", "#Preface In this paper we will create a very basic Linux Keylogger. Keylogging is the action of recording every key pressed by the user on a keyboard. Typically this action happens without the user being aware of it, which gives the hacker the opportunity to catch usernames and/or passwords. Our ke&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "I have always wanted to dive a bit deeper into how to linux kernel internals work. To do this I figured a good starting point would be to create a small proof of concept rootkit! You can find the code for the rootkit on github https://github.com/jordan9001/superhide. This is a very simple rootkit. &hellip;", "Thank you! Glad you enjoyed reading it", "Awsum #writeup.  It’s so useful! i enjoyed reading this.", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "I don’t get that either but according to this analysis from 2013 of browser password managers: When a Firefox profile is first created, a random key called an SDR key and a salt are created and stored in a file called “key3.db”. This key and salt are used in the 3DES (DES-EDE-CBC) algorithm to enc&hellip;", "True, since nobody cares about them too much (yet). It’s a printer. It prints. That’s it. right ?  You’re welcome and thanks a lot!", "I don’t get that either but according to this analysis from 2013 of browser password managers: When a Firefox profile is first created, a random key called an SDR key and a salt are created and stored in a file called “key3.db”. This key and salt are used in the 3DES (DES-EDE-CBC) algorithm to enc&hellip;", "I don’t get that either but according to this analysis from 2013 of browser password managers: When a Firefox profile is first created, a random key called an SDR key and a salt are created and stored in a file called “key3.db”. This key and salt are used in the 3DES (DES-EDE-CBC) algorithm to enc&hellip;", "Why on Earth would it still use 3DES!?!?!", "Exactly my words. I think @pry0cc can also contribute to this line of thought  … I’d like LastPass but offline on my PC. Never did my research on that until yet though…", "Exactly my words. I think @pry0cc can also contribute to this line of thought  … I’d like LastPass but offline on my PC. Never did my research on that until yet though…", "Im using lastpass, but I’m not sure I want to stay there. I’d rather be in total control of all my passwords on a private server but this will undoubtedly introduce problems on its own e.g ease of use and a single point of failure.", "Ah true! I’ll come back to the VIP section in due time then", "I may be able to share a detailed exploit in the near future. Depends on what I can “publicly disclose” and what not  On top of my private investigations of course", "True, since nobody cares about them too much (yet). It’s a printer. It prints. That’s it. right ?  You’re welcome and thanks a lot!", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "Awesome talk! One could easily follow him during the 45 minutes since it was super interesting and well presented. Was worth every minute of my time", "Stacks go up, not down. The lower addresses are towards the top, not the bottom, so subtracting means going up.  Also, I would not put the rip label on the stack view because it might be confusing to people as it is constantly changing values whereas rsp and rbp may stay the same.", "[1] rbp/ebp is vital for main()’s and any other function’s well being. It works as a boundary between the local variables and the arguments of a function (mostly on 32-bit but function arguments are also pushed on the stack after a certain number of arguments on 64-bit). Actually its usage is so im&hellip;", "#0x00ctf 2017Hello fellow nullers and lurkers alike, today we are very pleased to announce the biggest 0x00sec CTF of 2017! 0x00ctf will have challenges focussed mainly on Pwning and Reverse Engineering. timedatectl&gt;&gt; 12:30pm December 15th 2017 UTC-50x00ctf will begin at 12:30 pm US Eastern tim&hellip;", "Ah damn another wiki page i have to bookmark in case i win the lottery or this fine Nigerian prince is finally sending me these 50 million $ Edit: as of right now all of the amazon links are a dead end and are showing “the dogs of amazon” lel  [image]", "Hmmm yes. Tags would be very good.", "removing the sub categories should be fine imho. If a topic is related to Exploit development in any way it should be put in that (main) category. If it’s a tutorial on top of that one could tag it like that (if the author is a nice and responsible person  ).", "removing the sub categories should be fine imho. If a topic is related to Exploit development in any way it should be put in that (main) category. If it’s a tutorial on top of that one could tag it like that (if the author is a nice and responsible person  ).", "#Writeup - Look InsideSo yeah, a writeup for @0x00pf’s challenge Look Inside (and also for the sub-challenge Look Deeper Inside). Considering you are interested in this article I guess you spent some time with the challenges (if not I recommend doing so before reading this as it becomes way more &hellip;", "Ah damn another wiki page i have to bookmark in case i win the lottery or this fine Nigerian prince is finally sending me these 50 million $ Edit: as of right now all of the amazon links are a dead end and are showing “the dogs of amazon” lel  [image]", "I would probably be breaking protocol for writing this way and I ask that the admins and users of the platform turn a blind eye to the unstructured tutorial ( not actually one, this is actually a story ) they are about to read. As most of you realized that I had halted the tutorial of the reverse t&hellip;", "IntroductionIt has been more than a year since I published the concept of infecting an executable with shellcode here and recently I have been motivated to develop another PoC which follows the same path but at a more advanced level combining knowledge and techniques that I have learned since then.&hellip;", "Also, he needs to use this picture to illustrate a very bad rabbit…  [image]", "Will try and adapt the points you mentioned in the next topic.", "Already an improvement by 100% imho. Still a few things to note from my PoV: use bullet points instead of * or -work on your formatting, to appeal to the readertry to make your post interesting even if it is just news (give details, give your own thoughts, provide some questions for further dis&hellip;", "@brijesh, you should edit this post.", "I’m looking at this like @_py does as well. These nifty little tricks and knowledge bombs  for certain tools, or other methods to automate things are good to know. So getting a digest of what you can do every now and would really be appreciated !", "Believe it or not my lack of knowledge on the topics you’re good at actually slows down my pwning process a ton. Your posts would be much appreciated by the community. Proper workflow is key to productivity and you definitely know about that.", "I do a lot of things in Linux that would make baby Jesus cry, so I figure I’ll just document them here when I notice I’m doing them. There are a lot of other secops things I do that I’d love to share here, but they’re not useful for most folks in the forum and only a few people would find them inte&hellip;", "#What’s this about? Hello everyone, I’m Noswis. You might have already met me on IRC but this my first real post here! In this post I want to show you how I made a key-generator for a puzzle that @0x00pf created. I learned a lot from the puzzle that I’d like to share with you and I hope you will le&hellip;", "Ugh I read about tac somewhere before, used it once and forgot about it again… So I’m appreciating this post/ start of a new series, since it’s a nice change of the otherwise ‘somewhat serious’ real talk topics", "Hello folks! I hope you’re all doing great! Today’s topic is by far my most favorite heap exploitation technique I’ve ever dealt with until now (as far as Linux is concerned). I can’t stress enough how much I love this technique. It’s super smart, technical, and even though malloc has been hardened &hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "Ah true! I’ll come back to the VIP section in due time then", "NULL Pointer dereferenceIn the name of Allah, the most beneficent, the most merciful. Hello everyone to a boring article once again. I’ve found a bit of freetime, so i decided to write this article, it isn’t really well done, but i hope you guys like it and learn much !Kernel Exploitation ?&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "What is Hacktoberfest?Every year, Digital Ocean and Github partner up to encourage contributions to open-source projects. If you sign up for Hacktoberfest (just sign up, that’s all!) they help you find projects you can contribute to as well as sending you stickers and what-not. If you open 5 pull r&hellip;", "@whatskrakan_01 : click me gently to get access to a world of 0x00sec accessories @Suser aka fake rick. Cool idea. Definitely would go search you if I were there", "Curious how this trial thing works out. Being transparent about this kind of background mining is necessary. Otherwise you can easily get on the bad site with users… My setup probably won’t contribute as much but as long as I’m here anyway I’ll use it, that’s one way to give back to the community&hellip;", "Curious how this trial thing works out. Being transparent about this kind of background mining is necessary. Otherwise you can easily get on the bad site with users… My setup probably won’t contribute as much but as long as I’m here anyway I’ll use it, that’s one way to give back to the community&hellip;", "I was very insistent that we be transparent and opt-in for this thing. It’s potentially a pretty cool and ad-free way to raise funds for us if done right. Glad @pry0cc thought of it.", "@whatskrakan_01 : click me gently to get access to a world of 0x00sec accessories @Suser aka fake rick. Cool idea. Definitely would go search you if I were there", "Hahaha… I established a brand here. Don’t just hop on my multi billion dollar business here by suddenly being active  Oh the hat is not on the store ? Was sure we hat those too. Then sorry for the fake news !", "lol ive been rick since before 0x00sec was a thing go find standard user on nullbyte &lt;3", "@whatskrakan_01 : click me gently to get access to a world of 0x00sec accessories @Suser aka fake rick. Cool idea. Definitely would go search you if I were there", "I’d be happy to contribute to exploit development and anything involving malware analysis or development.", "Realmode Assembly - Writing bootable stuffPart 5: Graphic ModeWhat is this?This is going to be a walk-through in writing  Operation Systems in assembly which operate purely in Realmode. Goal will be writing different kernels from a simple “Hello World” over small terminal programs to graphical&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "Ah true! I’ll come back to the VIP section in due time then", "@Nitrax Great introduction to that huge chapter of reversing. On a side note you mentioned PEDA. Maybe you wanna check out GEF. As a reference from ther wiki: ###But why not PEDA? Yes! Why not?! PEDA is a fantastic tool to do the same, but only works for x86-32 or x86-64x whereas GEF supports&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "Sup folks! I hope you are all doing great. It’s been a long time since my last CTF write-up. The main reason is because I was trying to master the beast called heap exploitation and I’ve yet to learn a ton about it. To showcase one of the modern ways to pwn a heap-based vulnerable binary, I’ll use a&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "Oh, is that all we need to avoid the banhammer? xD", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "Ah true! I’ll come back to the VIP section in due time then", "I may be able to share a detailed exploit in the near future. Depends on what I can “publicly disclose” and what not  On top of my private investigations of course", "Publicly disclose it all brother  Remember we have a VIP section…", "I may be able to share a detailed exploit in the near future. Depends on what I can “publicly disclose” and what not  On top of my private investigations of course", "Mate this is a sweet and very very complete write-up. Awesome job on this  I would also love to know if this has worked for anybody else? Printer exploitation is a super difficult one to learn, and this is why I am so glad you’ve made it a LOT easier for people with this article. Looking forward to&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "True, since nobody cares about them too much (yet). It’s a printer. It prints. That’s it. right ?  You’re welcome and thanks a lot!", "The amount of network enabled printers I find during engagements is astounding. Excellent write-up, will definitely be coming back to this one for some lulz.", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "I’ll do the cryptocurrency article", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "damn why does this always happen when I’m asleep! I feel left out for this planning stuff  … I can deliver some content on printer exploitation tho. Just gimme a bit! @SmartOne @pry0cc the requested article will probably be up around Tuesday. Unfortunately I had to leave home over the weekend and&hellip;", "@pry0cc, you really have to check this… code injection using ROP without ptrace from BASH! Do not underestimate the power of the shell!!", "Greetings, 0x00sec! After much discussion, the 0x00sec mods and admins have put together a new program, a Bounty Program. How it WorksThis very post will be a Wiki. Members will be able to add any topic they’d like to see written about on this site. Other members will see the wiki, scroll through,&hellip;", "I think you might have forgotten something here.", "damn why does this always happen when I’m asleep! I feel left out for this planning stuff  … I can deliver some content on printer exploitation tho. Just gimme a bit! @SmartOne @pry0cc the requested article will probably be up around Tuesday. Unfortunately I had to leave home over the weekend and&hellip;", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "damn why does this always happen when I’m asleep! I feel left out for this planning stuff  … I can deliver some content on printer exploitation tho. Just gimme a bit! @SmartOne @pry0cc the requested article will probably be up around Tuesday. Unfortunately I had to leave home over the weekend and&hellip;", "Greetings, 0x00sec! After much discussion, the 0x00sec mods and admins have put together a new program, a Bounty Program. How it WorksThis very post will be a Wiki. Members will be able to add any topic they’d like to see written about on this site. Other members will see the wiki, scroll through,&hellip;", "damn why does this always happen when I’m asleep! I feel left out for this planning stuff  … I can deliver some content on printer exploitation tho. Just gimme a bit! @SmartOne @pry0cc the requested article will probably be up around Tuesday. Unfortunately I had to leave home over the weekend and&hellip;", "@fraq has dropped a bunch of concepts here that may be confusing for people not familiar with communications systems. So I will try, with @fraq’s permission, to expand a bit further. Sure. I like these topics  As @fraq said, that elephant thingy is related to mechanical waves, like sound, not elect&hellip;", "Hi 0x00’ers! Depending on your level of skill, you may be under the impression that using a VPN for all your traffic is a good thing for your privacy, you’ll have been told that using Tor 24/7, or tunneling all your traffic through it may save you from the infamous 3 letter agencies. Whatever crud &hellip;", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "Awesome talk! One could easily follow him during the 45 minutes since it was super interesting and well presented. Was worth every minute of my time", "@Noswis I had this binary on my system for quite a while already. Not sure anymore where I had this from. I can try to reach back to you once I know more again. Nevertheless thanks  ! @VVid0w Thanks man. Appreciate it  !", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "just hit me up with a message. sure no problem!", "@BO41 Same as me. I’m just starting here, and since I thought I can share my “journey” with everyone here I will do so  . Hoping to learn a lot ^^", "PrefaceAs always: I stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for t&hellip;", "Great tutorial! I’m trying this one myself while using your writeup as a guidline. Would you mind sharing where you got this binarybomb, I would love to reverse more programs like this.", "Wooahhhh, what a thing to have on my network.  I’ve been wanting to get into reversing for a while now, and this is a great foothold for it! You taught me quite a bit. Thanks for the awesome write up!", "@Noswis I had this binary on my system for quite a while already. Not sure anymore where I had this from. I can try to reach back to you once I know more again. Nevertheless thanks  ! @VVid0w Thanks man. Appreciate it  !", "Awesome talk! One could easily follow him during the 45 minutes since it was super interesting and well presented. Was worth every minute of my time", "The legend himself gave another mind-blowing talk at BH this year. Even if you are not into very technical low level exploitation, it’s a must-watch talk in my opinion.", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "I see a post by @0x00pf i press like. I already could see from the formatting, this is gonna be nice, but I still wanna do it out of my own effort. Sorry pico. Won’t read it for now", "I see a post by @0x00pf i press like. I already could see from the formatting, this is gonna be nice, but I still wanna do it out of my own effort. Sorry pico. Won’t read it for now", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "Trust me, that’s absolutely the least I want. Also, this wasn’t my point here. I’m sorry if I didn’t put it in the right words. My point was that if you don’t provide some background information here, or give newbies some stuff to read further, I’m afraid they won’t benefit much. I don’t wanna ba&hellip;", "First of all I kinda “disagree” with all of you making a debate of principles out of this under @Red_Joker’s post. This is an important thing to note. If you feel superior and don’t learn anything by briefly reading over an article then skip it.If you learn something or the topic was extra ordi&hellip;", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "First of all I kinda “disagree” with all of you making a debate of principles out of this under @Red_Joker’s post. This is an important thing to note. If you feel superior and don’t learn anything by briefly reading over an article then skip it.If you learn something or the topic was extra ordi&hellip;", "First of all I kinda “disagree” with all of you making a debate of principles out of this under @Red_Joker’s post. This is an important thing to note. If you feel superior and don’t learn anything by briefly reading over an article then skip it.If you learn something or the topic was extra ordi&hellip;", "First of all I kinda “disagree” with all of you making a debate of principles out of this under @Red_Joker’s post. This is an important thing to note. If you feel superior and don’t learn anything by briefly reading over an article then skip it.If you learn something or the topic was extra ordi&hellip;", "First of all I kinda “disagree” with all of you making a debate of principles out of this under @Red_Joker’s post. This is an important thing to note. If you feel superior and don’t learn anything by briefly reading over an article then skip it.If you learn something or the topic was extra ordi&hellip;", "On how to check SSH? Password cracking is a dead simple process granted, however there are some people here just entering the industry. Be humble, you didn’t come out the womb writing 0days.", "To the people against @Red_Joker’s post: I know for a fact that @Red_Joker thought of your “discouraging” feedback (which you have all the rights to give ofc) and yet still posted it. That’s pretty brave considering the fact that this forum has really elite people around. Some people start off on t&hellip;", "First of all I kinda “disagree” with all of you making a debate of principles out of this under @Red_Joker’s post. This is an important thing to note. If you feel superior and don’t learn anything by briefly reading over an article then skip it.If you learn something or the topic was extra ordi&hellip;", "Can’t you see? I managed to defuse a real nuclear bomb from the famous Dr. von Noizeman.", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "I see a post by @0x00pf i press like. I already could see from the formatting, this is gonna be nice, but I still wanna do it out of my own effort. Sorry pico. Won’t read it for now", "I see a post by @0x00pf i press like. I already could see from the formatting, this is gonna be nice, but I still wanna do it out of my own effort. Sorry pico. Won’t read it for now", "If you are reading this is because you have miserably failed to solve the Case GBC-17/124. LoL, just kidding. The GBC-17_124 challenge was intended to show you something that you can easily find in the real world, but still easy to solve. Yes, real world stuff is not as fun as the challenge you usua&hellip;", "Hello all again!It’s been a while since the  Python Package for creating backdoors thingie and all that time I have been researching a way to properly create a stager for a Python backdoor script that has dependencies. *You know stagers! The lil’ things that set the stage for the real thing to run&hellip;", "I’m going to chime in on this. For those of you who don’t know me,  I’m L0k1, I run our IRC,  and our Gitlab,  as well as a few other things. I may not be around all the time,  but I’m constantly maintaining stuff.  Before the talks about switching to Discord,  before we had our own IRC,  we were &hellip;", "I just got little notice about this project during my absence the last few days. Awesome stuff! Good job @ all the involved ! I’m in with what @pry0cc says. If we just take the Intrusion kill chain as an example:  Recon comes first. Always. Weaponize is second  I’d love to help but I ain’t much&hellip;", "Will that be different on discord in a few weeks though if the invite is publicly shared here (which is reasonable for a public chat room) ? I’m not fully convinced of discord yet either, but if the logging is happening on IRC what are the alternatives… Life’s rough", "Definitely a possibility! According to their GitHub page they are trying to implement more CTF style vulnerabilities. The vulnerabilities seem to be generated from fixed modules, so this whole thing is hackable and you can write your own extension. We can try to utilise it for 0x01sec_ctf", "@ricksanchez I’m not a coder as well, but this is the reason why I started learning python. And already with 1 hour of python experience I was able to write a module. Of course I couldn’t do it without the help of our extremely talented people like @fraq and @Nitrax (thanks again guys!), but I bet &hellip;", "I am particularly excited for the special guests. I think this show has the full potential to be very popular. It could grow even quicker than the forum itself!", "I still need to catch up on the latest podcasts but what I heard so far it’s been a fun ride and great to listen too! This collaboration is good stuff, and getting such nice guests on there definitely helps it! Good job @ everyone!", "For a few weeks now we have been watching the production of https://wacksec.com get better and better. We have seen multiple community members work hard into making this show great as well as informing the community and ordinary people of news and topics in infosec. Over the past few weeks, we have&hellip;", "I just got little notice about this project during my absence the last few days. Awesome stuff! Good job @ all the involved ! I’m in with what @pry0cc says. If we just take the Intrusion kill chain as an example:  Recon comes first. Always. Weaponize is second  I’d love to help but I ain’t much&hellip;", "Definitely a possibility! According to their GitHub page they are trying to implement more CTF style vulnerabilities. The vulnerabilities seem to be generated from fixed modules, so this whole thing is hackable and you can write your own extension. We can try to utilise it for 0x01sec_ctf", "Me, and a few others have been speaking a lot, and we’ve decided that Discord is a better platform for discussion, as it has more features than IRC, and there are a lot of people who feel much more comfortable using Discord over IRC. EDIT: However, that is not to say that we must all switch to Disc&hellip;", "We should use this for our CTF’s  I can’t imagine how many possibilities there may be? Can’t be a lot surely?", "nice find! I’ll bookmark it for later use", "Yo, this is a ruby script that randomly/procedurally generates Virtual Box VMs for you to practice hacking on.", "I got 60% or more of my flags from strings and grep.", "TLDR; I’m not saying you shouldn’t learn C, I am saying you shouldn’t have to learn C as your first language.", "When looking back how I got “taught” how to program it was something like this: High school: weird Lego bot -&gt; Pascal -&gt; Java Uni, Starting right from first semester: C,Java,Python Back in high school I like the minimalism of Pascal even when you couldn’t or at least we weren’t doing much with it&hellip;", "@Suser thinks I have a good perspective on transitioning from scripting (in my case, Ruby) to programming (in C++). This post deals particularly with Ruby and C++, but some facets are broadly applicable. WhyBefore I list some differences between scripting and programming, I will specify a few rea&hellip;", "First of all, thanks @oaktree for bringing such debate ! @_py Well, I share the exact same opinion except that I don’t consider a scripter as a programmer. From my point of view, scripting and programming are truly different and you succesfuly pointed out the details which characterize the differen&hellip;", "He has left the dark side and migrated to the light side. He has seen the light; forever enlightened to build his houses with grains of sand, because he’s a power hungry, mad CS scientist. Just kidding @_py, however, scripting languages do have their place.  I wrote a twitter bot for the 0x00secOff&hellip;", "Hi fellas, Let me introduce you my last tool, ORFinder ORFinder claims to be able to find any smtp services, exposed over the internet, vulnerable to open relay attack. Such attack relies on the fact that the sender / receiver addresses are not checked by the underlying mail server, allowing to p&hellip;", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "Hello! Welcome to my first tutorial about the ELF format, the ARM processor, and how to code a debugger for it. Ever wondered how a debugger works? Ever wondered how a debugger works on an ARM processor? In this series of articles, I am going to go from start to finish on how to code a simple debu&hellip;", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "It’s definitely a very solid option when trying to get into the whole hardware hacking/debugging/maintenance thing! I was peeking at the same model when trying to fill my shopping basket with tools for my home lab ( still incomplete sadly ). The “patch” to upgrade it to a better model makes it so&hellip;", "Currently my favorite is Rigol DS1054Z oscilloscope. The best thing about this particular oscilloscope is that there is a keygen that turns it into much more expensive 100 MHz oscilloscope. So you get a 4 channel 100 MHz oscilloscope for a price of something more like 2 channel and 70 MHz. There ar&hellip;", "yay a ton more new pdfs I have to put on top of the pile of the already existing “to read”-pdfs.", "Ah damn another wiki page i have to bookmark in case i win the lottery or this fine Nigerian prince is finally sending me these 50 million $ Edit: as of right now all of the amazon links are a dead end and are showing “the dogs of amazon” lel  [image]", "nice write-up @Leeky  ! Logical way to solve it after your made observations, which made it easy to follow. Also nice additions from you @mkhdznfq I didn’t know about that and will definitely try that on my own!", "nice write-up @Leeky  ! Logical way to solve it after your made observations, which made it easy to follow. Also nice additions from you @mkhdznfq I didn’t know about that and will definitely try that on my own!", "nice write-up @Leeky  ! Logical way to solve it after your made observations, which made it easy to follow. Also nice additions from you @mkhdznfq I didn’t know about that and will definitely try that on my own!", "as an alternative to the method above, we also can bruteforce the password by counting the instructions executed which can be done using intel’s pin tool or Linux’s performance analysis tool (perf). this method exploit the fact that the program exits when incorrect character is guessed and executes &hellip;", "PrefaceAs always: I stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for t&hellip;", "Morning folks. I know its been a while since ive posted here, life has been crazy,  and my company just agreed on a takeover of another blue team company,  so I’ve been dealing with all that fun legal stuff. Id like the communities input on something.  I’ve been speaking to my Microsoft rep for th&hellip;", "Nice series @Leeky . Looking forward to the next parts to extend my knowledge on more low level stuff other than asm for reversing", "Nice series @Leeky . Looking forward to the next parts to extend my knowledge on more low level stuff other than asm for reversing", "Here’s my approach featuring a persistently fully unlocked program; probably there are many better ways but damn it runs… At first I wanted to crack the registering process, so that I would have complete access for further reversing approaches. It’s as easy as in the last part: Just NOP the jmp in&hellip;", "Patching the program was easy, same solution as the last one, but whoever wrote that serial checking code needs to get a holy water IV and seek the nearest pope because an exorcist will only make things worse.", "[image] Top-notch anti-debugging measures EDIT: Holy crap, Windows troubleshooter fixed it o_O Double edit: Nope, crashes again. And my color scheme has switched to about 2.5 colors, what have you done Oh baby, a triple edit: ay, it works again", "Uhm well this is kinda awkward, I just had my laptop today and no Windows to try IDA or OllyDBG so I just ran this against the binary:  [image]Judging from they key-length last time I awk’ed for something similar. Took the first one that looked suspicious/encoded and took my chances. Since it’&hellip;", "aww man couldn’t you have waited another month to drop this so I could have finished my exams peacefully?! Still need to solve the keygen one. Looking forward to it and it’s on my list! Keep waiting for my solution", "aww man couldn’t you have waited another month to drop this so I could have finished my exams peacefully?! Still need to solve the keygen one. Looking forward to it and it’s on my list! Keep waiting for my solution", "The Greedy Brothers Corp. has approached you, young wannabe, to solve a pretty nasty issue. Many machines have been infected by a mysterious ransomware. The IT department from the Greedy Brothers Corp. have found a dropper in some of the machines but no track of the actual malware… except, of course&hellip;", "Uhm well this is kinda awkward, I just had my laptop today and no Windows to try IDA or OllyDBG so I just ran this against the binary:  [image]Judging from they key-length last time I awk’ed for something similar. Took the first one that looked suspicious/encoded and took my chances. Since it’&hellip;", "Uhm well this is kinda awkward, I just had my laptop today and no Windows to try IDA or OllyDBG so I just ran this against the binary:  [image]Judging from they key-length last time I awk’ed for something similar. Took the first one that looked suspicious/encoded and took my chances. Since it’&hellip;", "[spoiler] [image]When loading the Binary into IDA or OllyDBG the potential serial is obvious right away  [/spoiler] Thanks for the challenge  A fun little thing to boost confidence again and get me started to reverse stuff today", "[spoiler] [image]When loading the Binary into IDA or OllyDBG the potential serial is obvious right away  [/spoiler] Thanks for the challenge  A fun little thing to boost confidence again and get me started to reverse stuff today", "Podcasts start at 2100 Eastern", "Suhdudes. I’m back with another challenge but it will be different because this will be designed for Windows! Another thing I will be doing is a kind of “series” with these crackmes where each successive one will get incrementally more difficult. I will also supply research material (to replace hint&hellip;", "[spoiler] [image]When loading the Binary into IDA or OllyDBG the potential serial is obvious right away  [/spoiler] Thanks for the challenge  A fun little thing to boost confidence again and get me started to reverse stuff today", "[spoiler] [image]When loading the Binary into IDA or OllyDBG the potential serial is obvious right away  [/spoiler] Thanks for the challenge  A fun little thing to boost confidence again and get me started to reverse stuff today", "Podcasts start at 2100 Eastern", "I’m not exactly sure about the podcast times. need to ask @Deshi", "So a few hours before the podcast on Friday?", "17:00:00 FRI 07/21/2017 as shown on the page if you click play", "17:00:00 FRI 07/21/2017 as shown on the page if you click play", "I’d be interested on such a tool whenever is ready", "Hey, pwntools developer here! Here’s some additional pro tips you may want to integrate into your blog payload = str(foo)payload += pack(bar)payload += bazCan be collapsed down into a single statement with the flat() function. payload = flat(foo, bar, baz)Integers are passed to pack, string&hellip;", "Working at home on a powerful work-station to handle different VM’s easily, where all my tools, binaries etc for playing around with are stored: Windows VMsBasic Debian based OSsome “pentesting” OSs like parrotAll are set up differently to fit the purpose… Never attempted that one. The chanc&hellip;", "awesome article @exploit. I’m on this one with @fraq tho. Need to reread it a few times to fully grasp to potential here!", "awesome article @exploit. I’m on this one with @fraq tho. Need to reread it a few times to fully grasp to potential here!", "Sigreturn Oriented ProgrammingIn the name of Allah, the most beneficent, the most merciful. Hello everyone to a new boring article, after we took a small look on normal ROP stuff, I decided to write something more fun !@_py is the one that started that idea! for learning purposes …I hope yo&hellip;", "@pry0cc The thread-editor also showed this topic. I’ll have a look. Seems pretty nice  I would never try it . But apparently I’ve seen many people test exploiting on their main machine without any thougt about what could happen, if they fuck up.", "Working at home on a powerful work-station to handle different VM’s easily, where all my tools, binaries etc for playing around with are stored: Windows VMsBasic Debian based OSsome “pentesting” OSs like parrotAll are set up differently to fit the purpose… Never attempted that one. The chanc&hellip;", "Another solution [spoiler]Setting the length of a write to 0 works in this case, but let’s extrapolate this challenge to a real world case. Imagine that instead of printing a message in the console, the program is actually invoking some protection code that prevents us to reverse the program. In th&hellip;", "So, I got a question: There are already challenges displayed on the site. Are those the actual CTF challenges? Wouldn’t that mean a headstart for some? I think I don’t quite get it, could somebody please explain?", "O.O Oo-ooo jeez rick, I dont know, I’ve collected a lot more bookmarks since then.", "@Sirius Do it! Its almost weekend anyway you wouldn’t have anything better to do anyway right…?", "O.O Oo-ooo jeez rick, I dont know, I’ve collected a lot more bookmarks since then.", "You need to find the balance between very busy networks (like airports), but lack of CCTV, (bathrooms)", "Hence educational networks, a small cafe or similar is the better choice obv, but if you’re desperate you have to find a way around those CCTVs", "You need to find the balance between very busy networks (like airports), but lack of CCTV, (bathrooms)", "Or for many of us educational networks from uni are an alternative to (net-)cafés as well  Edit: even just going to your nearest fast food chain will give you access to Wi-Fi for free for at least an hour  Edit2: depending on where you live there might be an airport… Also if you’re already knowle&hellip;", "Actually I often read and heard people talk about it as well that they might prefer people with a good CS degree over someone who pursued a degree like “IT-Sec” or “Net-Sec” for the sole reason that CS lays a broader foundation and makes people gather different experiences and approaches to things. &hellip;", "Or for many of us educational networks from uni are an alternative to (net-)cafés as well  Edit: even just going to your nearest fast food chain will give you access to Wi-Fi for free for at least an hour  Edit2: depending on where you live there might be an airport… Also if you’re already knowle&hellip;", "Or for many of us educational networks from uni are an alternative to (net-)cafés as well  Edit: even just going to your nearest fast food chain will give you access to Wi-Fi for free for at least an hour  Edit2: depending on where you live there might be an airport… Also if you’re already knowle&hellip;", "Next time add it to the list to the top. Everyone here can edit the article, since it is a wiki. I just did it for you now  Keep it clean and classy lads", "summoning the mighty @Sirius to copy &amp; paste his post from here nicely formatted to this wiki  Big Edit: ____ YOU CAN ADD YOUR OWN STUFF TO THAT LIST. IT’S FREE TO EDIT FOR EVERYONE. SO DON’T COMMENT, JUST ADD IT AS ALWAYS KEEP IT CLEAN AND CLASSY! THANK YOU FOR YOUR ATTENTION  ____", "Oh if that’s the case things obviously change… and I thought you’re a genius man, but just 978 LoC that’s not even 1k. mpfff weak stuff man  . Ah common @0x00pf it doesnt matter if it’s 1k or 1.2k LoC… It’s an alpha release and it’s already a tool which makes the life of every beginner RE or someo&hellip;", "Setting count and bs to 1 we are effectively discarding the \\n (one single byte will be written to the output, despite of how many we provide as input), so it works fine, but your is, let’s say, more formal", "I’m not home atm but are you sure it shouldn’t be: [spoiler]echo -ne “\\x40” | dd of=exit seek=32 bs=1 count=1 cont=notrunc IIRC, -e will add a newline at the end too. Might be wrong though. [/spoiler]", "summoning the mighty @Sirius to copy &amp; paste his post from here nicely formatted to this wiki  Big Edit: ____ YOU CAN ADD YOUR OWN STUFF TO THAT LIST. IT’S FREE TO EDIT FOR EVERYONE. SO DON’T COMMENT, JUST ADD IT AS ALWAYS KEEP IT CLEAN AND CLASSY! THANK YOU FOR YOUR ATTENTION  ____", "Hello 0x00ers! Recently, we have added new badges to the site that are awarded to people who solve the challenges posted here. Currently, these badges are: Tier 0 Challenge SolverTier 1 Challenge SolverMore will be added when enough people earn these badges… – @oaktree", "I did see that happening, and I understood what’s happening there after using GDB. Then finding the rest of the input “manually by hand” wasn’t an issue anymore", "I tried static analysis first… It went well until the part where the magic happened with the neg something add something and something and something cmp something jmp something I had to write stuff down and/or look in GDB what actually happens. So in the end I couldn’t fully solve it just with w&hellip;", "The static analysis was showcasing a bit arithmetic trick. The dynamic analysis approach was the lazy way. Congrats either way @ricksanchez!", "Hello folks! I hope you’re doing great! This is my first time I ever create a reversing engineering challenge so I’m hoping there won’t be any issue such as unintended solutions/bugs. ###Difficulty A big part of Reverse Engineering has to do with observation. That being said, depending on how sha&hellip;", "Solved it now as well. Wasn’t the smartest approach that I took but dynamic analysis solved it easily in the end.  Below the summary of the made observations after looking at the binary: key has to be provided on callinput has to have a length of 4input bytes are getting stored in an arrayinp&hellip;", "As an ELF-noob, this was incredibly helpful for me to understand how this works. Thanks!", "@_py Yes I understand now, and I definitely learned a ton since I never really looked at the ELF internals the last few weeks when trying to advance in RE. This was a nice change for me. @ATGC Thanks man  !", "Congrats @ricksanchez!  Now you understand why it was easy  If you know the internals, everything is easy. I hope you learnt something new out of it.", "@ricksanchez Great analysis and a clean, simple solution! You rock!", "I solved it as it was intended. Feeling no glory now anymore with that hint being given by @_py tho  … Anyways…  First things first impressive solution  @ATGC . As in the extended solution above I first used tools like gdb readelf objdump xxd/hexdump on that file. I came to the s&hellip;", "Congrats @ricksanchez!  Now you understand why it was easy  If you know the internals, everything is easy. I hope you learnt something new out of it.", "I solved it as it was intended. Feeling no glory now anymore with that hint being given by @_py tho  … Anyways…  First things first impressive solution  @ATGC . As in the extended solution above I first used tools like gdb readelf objdump xxd/hexdump on that file. I came to the s&hellip;", "As an ELF-noob, this was incredibly helpful for me to understand how this works. Thanks!", "I solved it as it was intended. Feeling no glory now anymore with that hint being given by @_py tho  … Anyways…  First things first impressive solution  @ATGC . As in the extended solution above I first used tools like gdb readelf objdump xxd/hexdump on that file. I came to the s&hellip;", "No problem. We can leave this running for a while", "I would have looked at this challenge no matter what, this extra motivation is nice tho. I will keep that in mind and freshly sort my priorities  every time I see some new challenges. new challenges &gt; latest still unsolved challenges &gt; already solved challenges I want to be the very best Like &hellip;", "I would have looked at this challenge no matter what, this extra motivation is nice tho. I will keep that in mind and freshly sort my priorities  every time I see some new challenges. new challenges &gt; latest still unsolved challenges &gt; already solved challenges I want to be the very best Like &hellip;", "Hey, everybody! @Leeky has already got a Tier-0 Challenge Solver badge. What are you waiting for to get yours?  Solve this challenge, earn your own and get one step closer for a Tier-1 Challenge Solver badge! Note: You have to provide unique username/keys pairs to get your badge. Hurry up while &hellip;", "I solved it as it was intended. Feeling no glory now anymore with that hint being given by @_py tho  … Anyways…  First things first impressive solution  @ATGC . As in the extended solution above I first used tools like gdb readelf objdump xxd/hexdump on that file. I came to the s&hellip;", "As @SmartOne suggested. It would be really cool to have a wiki with useful links. Simply edit this topic and away you go! Blogs Security blog(s) overviewPenetration Testing Blog by @hkh4cksNews The Hacker News Security Affairs WIRED (Security Category) SANS Newsletter(s) (For&hellip;", "summoning the mighty @Sirius to copy &amp; paste his post from here nicely formatted to this wiki  Big Edit: ____ YOU CAN ADD YOUR OWN STUFF TO THAT LIST. IT’S FREE TO EDIT FOR EVERYONE. SO DON’T COMMENT, JUST ADD IT AS ALWAYS KEEP IT CLEAN AND CLASSY! THANK YOU FOR YOUR ATTENTION  ____", "PrefaceThis write up are my thoughts and steps to analyze a given unknown binary. I want to understand the binary to a point where I can freely write about it. So here it is. I’m always open for you pointing out mistakes or giving feedback to me Disclaimer:I won’t look at the assembly code to p&hellip;", "Well, the title says it all. #Hints No hints… Hints are for wimps… there are no hints in real life… RulesPost at least 3 valid username/keys combination in the comments. Do not forget to use the spoiler tag Write-ups are welcomed… ChallengeGet your binary the usual way: cat text_below | base&hellip;", "Next time add it to the list to the top. Everyone here can edit the article, since it is a wiki. I just did it for you now  Keep it clean and classy lads", "Next time add it to the list to the top. Everyone here can edit the article, since it is a wiki. I just did it for you now  Keep it clean and classy lads", "Next time add it to the list to the top. Everyone here can edit the article, since it is a wiki. I just did it for you now  Keep it clean and classy lads", "Next time add it to the list to the top. Everyone here can edit the article, since it is a wiki. I just did it for you now  Keep it clean and classy lads", "Next time add it to the list to the top. Everyone here can edit the article, since it is a wiki. I just did it for you now  Keep it clean and classy lads", "In addition to that there is still scrapy as well, depending on what you want to achieve BS4 might not be suitable anymore. Played around with BS4 and scrapy a bit and on first glance scrapy looked a tad more powerful to me", "@all: Can you please send him PMs? This topic keeps showing up on latest without any new information", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "PrefaceThis write up are my thoughts and steps to analyze a given unknown binary. I want to understand the binary to a point where I can freely write about it. So here it is. I’m always open for you pointing out mistakes or giving feedback to me Disclaimer:I won’t look at the assembly code to p&hellip;", "@0x00pf thanks! I had the line from where I took the binary from in my draft, but somehow I messed up and didn’t include it here. Added it to the top", "PrefaceThis write up are my thoughts and steps to analyze a given unknown binary. I want to understand the binary to a point where I can freely write about it. So here it is. I’m always open for you pointing out mistakes or giving feedback to me Disclaimer:I won’t look at the assembly code to p&hellip;", "PrefaceThis write up are my thoughts and steps to analyze a given unknown binary. I want to understand the binary to a point where I can freely write about it. So here it is. I’m always open for you pointing out mistakes or giving feedback to me Disclaimer:I won’t look at the assembly code to p&hellip;", "@0x00pf thanks! I had the line from where I took the binary from in my draft, but somehow I messed up and didn’t include it here. Added it to the top", "Nice post @ricksanchez… would you mind to post a link to the binary, so people can try what you have just described?", "PrefaceThis write up are my thoughts and steps to analyze a given unknown binary. I want to understand the binary to a point where I can freely write about it. So here it is. I’m always open for you pointing out mistakes or giving feedback to me Disclaimer:I won’t look at the assembly code to p&hellip;", "PrefaceThis write up are my thoughts and steps to analyze a given unknown binary. I want to understand the binary to a point where I can freely write about it. So here it is. I’m always open for you pointing out mistakes or giving feedback to me Disclaimer:I won’t look at the assembly code to p&hellip;", "PrefaceThis write up are my thoughts and steps to analyze a given unknown binary. I want to understand the binary to a point where I can freely write about it. So here it is. I’m always open for you pointing out mistakes or giving feedback to me Disclaimer:I won’t look at the assembly code to p&hellip;", "PrefaceThis write up are my thoughts and steps to analyze a given unknown binary. I want to understand the binary to a point where I can freely write about it. So here it is. I’m always open for you pointing out mistakes or giving feedback to me Disclaimer:I won’t look at the assembly code to p&hellip;", "PrefaceThis write up are my thoughts and steps to analyze a given unknown binary. I want to understand the binary to a point where I can freely write about it. So here it is. I’m always open for you pointing out mistakes or giving feedback to me Disclaimer:I won’t look at the assembly code to p&hellip;", "@_py Thanks mate… no worries I know you are busy and as @ricksanchez it is all about promotion … I have been looking at Unicorn Engine…  @ricksanchez thanks mate. Glad to hear you liked it", "@_py Thanks mate… no worries I know you are busy and as @ricksanchez it is all about promotion … I have been looking at Unicorn Engine…  @ricksanchez thanks mate. Glad to hear you liked it", "Great write up for your own challenge, promoting your own tool again. Smart move  . Seriously though, really solid article which is easy to follow. Helped me and most likely will help all the new people who want to dive into RE as well", "Great write up for your own challenge, promoting your own tool again. Smart move  . Seriously though, really solid article which is easy to follow. Helped me and most likely will help all the new people who want to dive into RE as well", "It has been a while since I wrote the Late Easter  challenge and now that STAN is around, this is a good excuse to present some of the latest functions I have add to my little tool  So, in this write-up I’m going to solve the stripped version of the challenge. Grab the binary, grab STAN (https://gi&hellip;", "Hi fellas, Following my last article, RE for beginners: Methodology and tools, I decided to do this write up in order to present you another common issue that people, exercising in this area, should be quickly confronted to, anti-debugger technologies. For the sake of this article, I picked a chal&hellip;", "PrefaceAs always: I stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for t&hellip;", "Yes I read that one a while ago as well and this here reminded me of the article by @dtm too", "PrefaceThis is a write-up for solving the devil-swapper RE challenge by @0x00pf . It was mostly intended for my personal archive but since it may be interesting to all of you I will try to format it in a clear and most importantly scrub friendly way for people like myself… Since I got stuck along&hellip;", "Ah damn another wiki page i have to bookmark in case i win the lottery or this fine Nigerian prince is finally sending me these 50 million $ Edit: as of right now all of the amazon links are a dead end and are showing “the dogs of amazon” lel  [image]", "I’ve just bought hacking the art of exploitation. It’s so good so far.", "Oh if that’s the case things obviously change… and I thought you’re a genius man, but just 978 LoC that’s not even 1k. mpfff weak stuff man  . Ah common @0x00pf it doesnt matter if it’s 1k or 1.2k LoC… It’s an alpha release and it’s already a tool which makes the life of every beginner RE or someo&hellip;", "Oh if that’s the case things obviously change… and I thought you’re a genius man, but just 978 LoC that’s not even 1k. mpfff weak stuff man  . Ah common @0x00pf it doesnt matter if it’s 1k or 1.2k LoC… It’s an alpha release and it’s already a tool which makes the life of every beginner RE or someo&hellip;", "Oh if that’s the case things obviously change… and I thought you’re a genius man, but just 978 LoC that’s not even 1k. mpfff weak stuff man  . Ah common @0x00pf it doesnt matter if it’s 1k or 1.2k LoC… It’s an alpha release and it’s already a tool which makes the life of every beginner RE or someo&hellip;", "just joking man  . Also you’re telling your story of “just 1.2kLoC in a couple of days” like it is nothing. I’d need way longer ofr that. So I’m massively impressed  Also looking forward to the next challenge", "just joking man  . Also you’re telling your story of “just 1.2kLoC in a couple of days” like it is nothing. I’d need way longer ofr that. So I’m massively impressed  Also looking forward to the next challenge", "OK… my bad I just checked the lines in the source file not the actual LoCs. Just run sloccount on my first PoC and it  reported 978 LoC, so roughly just 1KLoc. Sorry about the confusion.", "just joking man  . Also you’re telling your story of “just 1.2kLoC in a couple of days” like it is nothing. I’d need way longer ofr that. So I’m massively impressed  Also looking forward to the next challenge", "You mad man @0x00pf . Nice post as always. Soon you will post challenges and then we can just run STAN and it will spit out the solutions", "just joking man  . Also you’re telling your story of “just 1.2kLoC in a couple of days” like it is nothing. I’d need way longer ofr that. So I’m massively impressed  Also looking forward to the next challenge", "Thanks @SmartOne That capstone framework is amazing. I’ve got a working PoC (around 1.2KLoC) in a couple of days. Then it took me 2/3 days to just refactor that code in something with a bit of structure. So, roughly it took two complete weekends plus some hours every day during the week. Regarding&hellip;", "PrefaceThis is a write-up for solving the devil-swapper RE challenge by @0x00pf . It was mostly intended for my personal archive but since it may be interesting to all of you I will try to format it in a clear and most importantly scrub friendly way for people like myself… Since I got stuck along&hellip;", "@ricksanchez… it will not be that easy. Actually the challenge I’m working on completely defeats STAN… but I’ll do some improvements to the tool before releasing the challenge (still waiting for some feedback on the challenge tho) @pry0cc I look forward  to any feedback. What’s next?.. well I have &hellip;", "You mad man @0x00pf . Nice post as always. Soon you will post challenges and then we can just run STAN and it will spit out the solutions", "You mad man @0x00pf . Nice post as always. Soon you will post challenges and then we can just run STAN and it will spit out the solutions", "Those of you that are following me on twitter may have heard about STAN. This is my pet project to learn about reverse engineering. It was born as an experiment with the capstone disassembly framework (http://www.capstone-engine.org/), and it evolved in something usable for simple projects. If you &hellip;", "n3xUs and ricksanchez- The formatting issue was a weird one that I had to correct a few times (it still does not look great). I also realize there are some typos… I will work to get those issues fixed out of respect to the community and the readers. It may be a while though; as I stated, I am extr&hellip;", "Holy Guacamole! Great post, definitely worth the long read. Also, love the whole transparency and honesty present in the whole post. However, like @ricksanchez said, the post might need some formatting and the correction of some typos, other than that, awesome article.", "holy ballsack man. I love this insight. I didn’t dive deep into real world work stuff since I’m still in uni, but this article has so much information in it. I need to read it again to soak in everything. Working as a pentester sounds tough but fun. I’m curious where I will end up in a year from &hellip;", "holy ballsack man. I love this insight. I didn’t dive deep into real world work stuff since I’m still in uni, but this article has so much information in it. I need to read it again to soak in everything. Working as a pentester sounds tough but fun. I’m curious where I will end up in a year from &hellip;", "holy ballsack man. I love this insight. I didn’t dive deep into real world work stuff since I’m still in uni, but this article has so much information in it. I need to read it again to soak in everything. Working as a pentester sounds tough but fun. I’m curious where I will end up in a year from &hellip;", "Hello everyone. I have made some minor edits since first posting this as to further clarify a couple of points. I joined this community a while ago; I have/had been a lurker for even longer.  A huge part of what made the hacker community what it was (and what it is here) involves a willingness to &hellip;", "Yes I read that one a while ago as well and this here reminded me of the article by @dtm too", "Yes I read that one a while ago as well and this here reminded me of the article by @dtm too", "Did you read this? Also a great post with CheatEngine", "This totally feels like back in the days when I used CheatEngine in Windows for this kinda stuff… Fun times", "This totally feels like back in the days when I used CheatEngine in Windows for this kinda stuff… Fun times", "This totally feels like back in the days when I used CheatEngine in Windows for this kinda stuff… Fun times", "Awesome article. Thanks for sharing. In the end it’s basic advice but basics are the most important to understand", "@Nitrax Great introduction to that huge chapter of reversing. On a side note you mentioned PEDA. Maybe you wanna check out GEF. As a reference from ther wiki: ###But why not PEDA? Yes! Why not?! PEDA is a fantastic tool to do the same, but only works for x86-32 or x86-64x whereas GEF supports&hellip;", "Please, lock this thread xD", "I’m glad you gave 0 fucks about the 2 comments above.", "PrefaceThis is a write-up for solving the devil-swapper RE challenge by @0x00pf . It was mostly intended for my personal archive but since it may be interesting to all of you I will try to format it in a clear and most importantly scrub friendly way for people like myself… Since I got stuck along&hellip;", "PrefaceThis is a write-up for solving the devil-swapper RE challenge by @0x00pf . It was mostly intended for my personal archive but since it may be interesting to all of you I will try to format it in a clear and most importantly scrub friendly way for people like myself… Since I got stuck along&hellip;", "@neolex yeah when reading a write-up it always looks like a piece of cake. I know that feeling  . And you’re welcome", "@twyK Thanks  @0x00pf Thank you as well. I intended to do that, but I’m not feeling confident enough with asm and tools like bninja yet, so I had to take the easy way out. Oh please lord… Have mercy with us poor souls…  I will try to read a lot into that stuff and will participate again when i&hellip;", "This is what it feels like to hack via SSH on phone…", "PrefaceAs always: I stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for t&hellip;", "@psifertex thank you for taking your time and answering in depth to my questions! I guess i missed the pricing section when snooping around on the website. Hope to see some awesome ongoing development from you!", "Nice write-up!", "The second part was quite difficult for me so I gave up, but I’m happy that you completed this! Good Job ^-^", "@ricksanchez very nice write-up! And congrats for the solution. I would expect people to reverse the final password (it was a reverse engineering challenge after all) but brute forcing it is also fine.  I will have to go hard core for the next one !!", "Oh I was pretty close … It looks ovbious when you read the write up ahah Thanks @ricksanchez  for yourwrite up ! And thanks @0x00pf for the challenge !", "@neolex yeah when reading a write-up it always looks like a piece of cake. I know that feeling  . And you’re welcome", "Oh I was pretty close … It looks ovbious when you read the write up ahah Thanks @ricksanchez  for yourwrite up ! And thanks @0x00pf for the challenge !", "@twyK Thanks  @0x00pf Thank you as well. I intended to do that, but I’m not feeling confident enough with asm and tools like bninja yet, so I had to take the easy way out. Oh please lord… Have mercy with us poor souls…  I will try to read a lot into that stuff and will participate again when i&hellip;", "@twyK Thanks  @0x00pf Thank you as well. I intended to do that, but I’m not feeling confident enough with asm and tools like bninja yet, so I had to take the easy way out. Oh please lord… Have mercy with us poor souls…  I will try to read a lot into that stuff and will participate again when i&hellip;", "@ricksanchez very nice write-up! And congrats for the solution. I would expect people to reverse the final password (it was a reverse engineering challenge after all) but brute forcing it is also fine.  I will have to go hard core for the next one !!", "PrefaceThis is a write-up for solving the devil-swapper RE challenge by @0x00pf . It was mostly intended for my personal archive but since it may be interesting to all of you I will try to format it in a clear and most importantly scrub friendly way for people like myself… Since I got stuck along&hellip;", "PrefaceThis is a write-up for solving the devil-swapper RE challenge by @0x00pf . It was mostly intended for my personal archive but since it may be interesting to all of you I will try to format it in a clear and most importantly scrub friendly way for people like myself… Since I got stuck along&hellip;", "PrefaceThis is a write-up for solving the devil-swapper RE challenge by @0x00pf . It was mostly intended for my personal archive but since it may be interesting to all of you I will try to format it in a clear and most importantly scrub friendly way for people like myself… Since I got stuck along&hellip;", "Thank you @DAGONCHU . If it helped you you I’m happy", "PrefaceAs always: I stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for t&hellip;", "Thank you @DAGONCHU . If it helped you you I’m happy", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "PrefaceAs always: I stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for t&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceAs always: I stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for t&hellip;", "PrefaceAs always: I stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for t&hellip;", "PrefaceThis is a write-up for solving the devil-swapper RE challenge by @0x00pf . It was mostly intended for my personal archive but since it may be interesting to all of you I will try to format it in a clear and most importantly scrub friendly way for people like myself… Since I got stuck along&hellip;", "PrefaceThis is a write-up for solving the devil-swapper RE challenge by @0x00pf . It was mostly intended for my personal archive but since it may be interesting to all of you I will try to format it in a clear and most importantly scrub friendly way for people like myself… Since I got stuck along&hellip;", "PrefaceThis is a write-up for solving the devil-swapper RE challenge by @0x00pf . It was mostly intended for my personal archive but since it may be interesting to all of you I will try to format it in a clear and most importantly scrub friendly way for people like myself… Since I got stuck along&hellip;", "PrefaceThis is a write-up for solving the devil-swapper RE challenge by @0x00pf . It was mostly intended for my personal archive but since it may be interesting to all of you I will try to format it in a clear and most importantly scrub friendly way for people like myself… Since I got stuck along&hellip;", "PrefaceThis is a write-up for solving the devil-swapper RE challenge by @0x00pf . It was mostly intended for my personal archive but since it may be interesting to all of you I will try to format it in a clear and most importantly scrub friendly way for people like myself… Since I got stuck along&hellip;", "PrefaceThis is a write-up for solving the devil-swapper RE challenge by @0x00pf . It was mostly intended for my personal archive but since it may be interesting to all of you I will try to format it in a clear and most importantly scrub friendly way for people like myself… Since I got stuck along&hellip;", "Ah damn another wiki page i have to bookmark in case i win the lottery or this fine Nigerian prince is finally sending me these 50 million $ Edit: as of right now all of the amazon links are a dead end and are showing “the dogs of amazon” lel  [image]", "@Evalion maybe this in a combination with “we have to get this shit released as fast as possible before everyone knows/read the nsa leak” @dtm i heard their support hotline was awesome and people way faster in reacting and more friendly. They even gave discount on the ransom to pay in some cases. N&hellip;", "@0x00pf can you give ma a hint for the last step? I just seem to not get it. [spoiler] Found the cipher, identified the encryption, decrypted it, read the man page and now I’m confused Edit: vote for smileys within spoiler tags [/spoiler]", "PrefaceAs always: I stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for t&hellip;", "PrefaceAs always: I stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for t&hellip;", "Your weekend challenge is here! This is a simple challenge. Do not look for very sophisticated stuff. You know… the devil’s in the details. Boring to deathEasyInterestingWTF0voters Show results#Objective You have to find the secret key and the secret message. That’s it Extra&hellip;", "@0x00pf can you give ma a hint for the last step? I just seem to not get it. [spoiler] Found the cipher, identified the encryption, decrypted it, read the man page and now I’m confused Edit: vote for smileys within spoiler tags [/spoiler]", "PrefaceAs always: I stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for t&hellip;", "PrefaceAs always: I stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for t&hellip;", "PrefaceAs always: I stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for t&hellip;", "Preface####As always: I stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me f&hellip;", "Preface####As always: I stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me f&hellip;", "@psifertex thank you for taking your time and answering in depth to my questions! I guess i missed the pricing section when snooping around on the website. Hope to see some awesome ongoing development from you!", "The plan for pricing is described at the bottom of: TL;DR – personal will be $149 after the introductory period ends, but it will be announced well in advance. As for Static versus Dynamic, we’ll get there. As mentioned already, there are plugins that implement it already but it’s not as smooth &hellip;", "The plan for pricing is described at the bottom of: TL;DR – personal will be $149 after the introductory period ends, but it will be announced well in advance. As for Static versus Dynamic, we’ll get there. As mentioned already, there are plugins that implement it already but it’s not as smooth &hellip;", "PrefaceAfter a break because life kept me busy the next part of this beginner series is here. I will try to finish these articles rather quick now if they are staying on the this level, since I wanna dive deeper into different waters but in the end I dislike unfinished projects. As always: I st&hellip;", "PrefaceAfter a break because life kept me busy the next part of this beginner series is here. I will try to finish these articles rather quick now if they are staying on the this level, since I wanna dive deeper into different waters but in the end I dislike unfinished projects. As always: I st&hellip;", "Ah, hackthissite. Good times, good times indeed. Thanks for the write-up. I’m sure it will help people who get stuck.", "PrefaceAfter a break because life kept me busy the next part of this beginner series is here. I will try to finish these articles rather quick now if they are staying on the this level, since I wanna dive deeper into different waters but in the end I dislike unfinished projects. As always: I st&hellip;", "PrefaceAfter a break because life kept me busy the next part of this beginner series is here. I will try to finish these articles rather quick now if they are staying on the this level, since I wanna dive deeper into different waters but in the end I dislike unfinished projects. As always: I st&hellip;", "PrefaceAfter a break because life kept me busy the next part of this beginner series is here. I will try to finish these articles rather quick now if they are staying on the this level, since I wanna dive deeper into different waters but in the end I dislike unfinished projects. As always: I st&hellip;", "Feel free to do so, I’m planning to make some bninja-related write-ups as well.", "okay thanks mate. I’ll hit you up once it’s up and running! @Nitrax after @_py gives me the basic rundown I’d post an introductionary post about it, if he’s not posting first", "@ricksanchez: I’ll express my opinion from a Linux user’s perspective. Binary Ninja is totally worth it for Static Analysis. It helped me step up my RE game way too much/fast. Imo it’s one of the best tools you can start with if you are serious about RE since it’s not even that pricey (atm). 90 buc&hellip;", "in the current state they may be and that was my question but I’m sure BNinja aims to be an entry level reversing platform for &lt;500$ to be a competitor to IDA, since  named licenses there start at 500€. And that’s the point. When will that be? And what functions will they offer then  ? @_py okay &hellip;", "@ricksanchez: I’ll express my opinion from a Linux user’s perspective. Binary Ninja is totally worth it for Static Analysis. It helped me step up my RE game way too much/fast. Imo it’s one of the best tools you can start with if you are serious about RE since it’s not even that pricey (atm). 90 buc&hellip;", "IDA Pro and bninja are totally different. Indeed, bninja is dedicated to static analysis, wherease IDA provides both. According to their website, bninja will provide such feature when their static engine will be entirely done and, apparently, the development process is far for being finished. No, &hellip;", "@Nitrax Great introduction to that huge chapter of reversing. On a side note you mentioned PEDA. Maybe you wanna check out GEF. As a reference from ther wiki: ###But why not PEDA? Yes! Why not?! PEDA is a fantastic tool to do the same, but only works for x86-32 or x86-64x whereas GEF supports&hellip;", "Sure thing. I currently have it installed too and wanna play around with it in the next days when I finished my current ongoing series here", "Never heard of it ! I will give it a try  ! Cheers mate.", "Never heard of it ! I will give it a try  ! Cheers mate.", "@Nitrax Great introduction to that huge chapter of reversing. On a side note you mentioned PEDA. Maybe you wanna check out GEF. As a reference from ther wiki: ###But why not PEDA? Yes! Why not?! PEDA is a fantastic tool to do the same, but only works for x86-32 or x86-64x whereas GEF supports&hellip;", "@Nitrax Great introduction to that huge chapter of reversing. On a side note you mentioned PEDA. Maybe you wanna check out GEF. As a reference from ther wiki: ###But why not PEDA? Yes! Why not?! PEDA is a fantastic tool to do the same, but only works for x86-32 or x86-64x whereas GEF supports&hellip;", "Hi fellas, A few days ago, I decided to start my adventure in the reverse engineering domain. I was quickly overwhelmed by a bunch of information and op codes that confused me a lot, even with solid knowledge in assembly and programming. Reverse engineering can seem complex at the first glance, ho&hellip;", "I will do so and am curious what you have to offer", "Never tried neither NetHunter or Linux Deploy, but my opinion is that i would need a laptop or something else for pentesting, from phone is quite impossible right now. Sure  If you need help, you can hit a PM too ahaha", "Much appreciated Mr Rick !", "I will do so and am curious what you have to offer", "Well the nexus 5X is powerful even now, it supports too kali linux right? If you need help with your Galaxy, make sure to hit me a PM", "Using a Galaxy S6 Edge as a main and still have a rooted IPhone 5S at home for playing around with. Still need to modify my Galaxy though. It’s more work than I thought for this particular model it seems", "Send me your GitLab username.", "@dtm can’t access that atm a link or dump forward to me would be wonderful", "Just reorganised my e-book and other PDF resources and uploaded them onto my GitLab. Entry-level stuff here, mostly RE or malware or AV detection evasion content since I don’t dabble much in the other areas so if any of you are interested in that stuff, go nuts. I might update the READMEs in a futur&hellip;", "Never heard about it before. Seems quite new though and there is no about page at least none I could find at first sight. Might check it out when I have some spare time. So most likely not before mid August…", "Using a Galaxy S6 Edge as a main and still have a rooted IPhone 5S at home for playing around with. Still need to modify my Galaxy though. It’s more work than I thought for this particular model it seems", "They’re back up now. Amazon was broken for half an hour or so", "Bro Aldi is everywhere  [image]", "Bro Aldi is everywhere  [image]", "Bro Aldi is everywhere  [image]", "Ah damn another wiki page i have to bookmark in case i win the lottery or this fine Nigerian prince is finally sending me these 50 million $ Edit: as of right now all of the amazon links are a dead end and are showing “the dogs of amazon” lel  [image]", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "They’re back up now. Amazon was broken for half an hour or so", "I’m not sure what is going wrong. They’re all working for me?", "I like the doggos because I have one myself. Too bad there aren’t any border collies (well except that mixed one). I added a link to the LOGO! PLC from siemens. They are excellent, and are the best PLC for people that are new to PLC’s. Their possibilities are endless. Also, the newest version (the &hellip;", "I like the doggos because I have one myself. Too bad there aren’t any border collies (well except that mixed one). I added a link to the LOGO! PLC from siemens. They are excellent, and are the best PLC for people that are new to PLC’s. Their possibilities are endless. Also, the newest version (the &hellip;", "Ah damn another wiki page i have to bookmark in case i win the lottery or this fine Nigerian prince is finally sending me these 50 million $ Edit: as of right now all of the amazon links are a dead end and are showing “the dogs of amazon” lel  [image]", "Ah damn another wiki page i have to bookmark in case i win the lottery or this fine Nigerian prince is finally sending me these 50 million $ Edit: as of right now all of the amazon links are a dead end and are showing “the dogs of amazon” lel  [image]", "Ah damn another wiki page i have to bookmark in case i win the lottery or this fine Nigerian prince is finally sending me these 50 million $ Edit: as of right now all of the amazon links are a dead end and are showing “the dogs of amazon” lel  [image]", "Hello fellow 0x00sec-ers! I just had a good talk with @pry0cc about doing some posts within my specialty, operations. I firmly believe that a strong foundation in operations is essential for any aspiring hacker, as you need to understand the systems you’re breaking. To that end, I will be cross-pos&hellip;", "@Evalion maybe this in a combination with “we have to get this shit released as fast as possible before everyone knows/read the nsa leak” @dtm i heard their support hotline was awesome and people way faster in reacting and more friendly. They even gave discount on the ransom to pay in some cases. N&hellip;", "Good points indeed, but something tells me they never anticipated that their attack would be this massive. “Aight guys let’s use this exploit and let’s infect some home netw… HOLY SHIT WE INFECTED HALF OF EUROPE!”", "Suh doods, got another challenge which will probably be my last one for a while due to my lack of knowledge of the Linux system. I may make some Windows challenges if anyone wishes. If anyone would like the source code to this, please tell me! DifficultyDepends on your current knowledge. Persona&hellip;", "Imagine this: You’re a pentester. A long-lost relative has left you a fortune in his will. To keep the money, you have to fulfill just one wish: spend it all on tech (from Amazon, because then you’d be buying a beer or some server time for 0x00sec while still getting some cool stuff for yourself). I&hellip;", "Ah damn another wiki page i have to bookmark in case i win the lottery or this fine Nigerian prince is finally sending me these 50 million $ Edit: as of right now all of the amazon links are a dead end and are showing “the dogs of amazon” lel  [image]", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "By the way, this article is really handy.", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "We have already seen how to infect a file injecting code into the binary so it gets executed next time the infected program is started. But, how to infect a process that is already running?. Well, this paper will introduce the basic techniques you need to learn in order to fiddle with other processe&hellip;", "Necrobumping can be bad. But in this case I think it’s fully acceptable. This article is super relevant, and interesting, and I can’t believe I missed it.", "Right, some distros choose to go against what upstream suggests, usually (then they run scripts to purge it when shutting down, or they don’t). Somtimes, the admin may configure it to be on the disk, or have it mounted with noexec by putting an entry in fstab or something of that kind. This should &hellip;", "Haven’t thought about that. It is a very good point. There are a couple of things to check before dumping stuff in a tmpfs!. Thanks for the great comments", "I don’t blame those two at all. I’m happy one of my articles led to such an interesting discussion. That’s what these articles are for in the first place right? Reading - Understanding - Discussing", "I don’t blame those two at all. I’m happy one of my articles led to such an interesting discussion. That’s what these articles are for in the first place right? Reading - Understanding - Discussing", "You article was great as it was the starting point for some interesting discussions… blame @pry0cc and @IoTh1nkN0t for pushing this farther", "Since this topic of “stealthy reverse shell” got a lot of attention @0x00pf created a new article to clarify the possibilites what is possible and must be considered to prevent disk writings when attempting a reverse shell. Much kudos to him. Show his article some love, but not more than mine. Pls  &hellip;", "You article was great as it was the starting point for some interesting discussions… blame @pry0cc and @IoTh1nkN0t for pushing this farther", "@0x00pf yes mention and “praise” me more for my awesome topic. go on. don’t stop yet. nah mate awesome “reply” to the question which evolved on my thread the last days. I’ll cross link this article there too, so finding it will be easy. Back to topic now. This brings the topic of spawning a rever&hellip;", "Since this topic of “stealthy reverse shell” got a lot of attention @0x00pf created a new article to clarify the possibilites what is possible and must be considered to prevent disk writings when attempting a reverse shell. Much kudos to him. Show his article some love, but not more than mine. Pls  &hellip;", "Since this topic of “stealthy reverse shell” got a lot of attention @0x00pf created a new article to clarify the possibilites what is possible and must be considered to prevent disk writings when attempting a reverse shell. Much kudos to him. Show his article some love, but not more than mine. Pls  &hellip;", "@0x00pf yes mention and “praise” me more for my awesome topic. go on. don’t stop yet. nah mate awesome “reply” to the question which evolved on my thread the last days. I’ll cross link this article there too, so finding it will be easy. Back to topic now. This brings the topic of spawning a rever&hellip;", "Great article! However, be sure to leave a space before the commands in order to make sure that they aren’t saved to the (bash) history", "You can also use set +o history to turn it off and set -o history to turn it back on.", "@0x00pf yes mention and “praise” me more for my awesome topic. go on. don’t stop yet. nah mate awesome “reply” to the question which evolved on my thread the last days. I’ll cross link this article there too, so finding it will be easy. Back to topic now. This brings the topic of spawning a rever&hellip;", "Continuing the discussion from Spawning reverse shells: I was about to reply on (Spawning reverse shells), but my reply has got so long that I decided to made it into a post. Please first read the original thread from @RickSanchez and the comments there, before you continue. The discussion here, i&hellip;", "Continuing the discussion from Spawning reverse shells: I was about to reply on (Spawning reverse shells), but my reply has got so long that I decided to made it into a post. Please first read the original thread from @RickSanchez and the comments there, before you continue. The discussion here, i&hellip;", "PrefaceOkay guys we’re not talking apt-get here. It’s about advanced persistent threats. Didn’t find anything about it here after using the search. What is it in short?An advanced persistent threat (APT) is a network attack in which an unauthorized person gains access to a network and stays th&hellip;", "@pry0cc  As far as I know ,at least UNIX kernels expect binary executable files to be stored on the disk. This seems to be a requirement so the system can perform seek operations to arbitrary offsets, and also map the file contents into memory. Executing a binary or binary stream from standard inp&hellip;", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "@Evalion covfefe mate", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "Awesome idea to make a centralized place for all those nifty tools we might need or come in handy in different scenarios. This will make our lifes a lot easier", "PrefaceOkay guys we’re not talking apt-get here. It’s about advanced persistent threats. Didn’t find anything about it here after using the search. What is it in short?An advanced persistent threat (APT) is a network attack in which an unauthorized person gains access to a network and stays th&hellip;", "Especially these will be present during the whole learning phase and even afterwards. It’s just a big part of reversing/analysis. But all in all i totally agree with you @_py . The most important thing is and always will be mastering the basics!", "PrefaceOkay guys we’re not talking apt-get here. It’s about advanced persistent threats. Didn’t find anything about it here after using the search. What is it in short?An advanced persistent threat (APT) is a network attack in which an unauthorized person gains access to a network and stays th&hellip;", "Don’t ever apologize for wanting to learn.  It’s a good thing which will make you advance and make you step on a whole other level compared to others who don’t bother.", "Especially these will be present during the whole learning phase and even afterwards. It’s just a big part of reversing/analysis. But all in all i totally agree with you @_py . The most important thing is and always will be mastering the basics!", "PrefaceOkay guys we’re not talking apt-get here. It’s about advanced persistent threats. Didn’t find anything about it here after using the search. What is it in short?An advanced persistent threat (APT) is a network attack in which an unauthorized person gains access to a network and stays th&hellip;", "@Evalion covfefe mate", "@Evalion covfefe mate", "Chuck Norris is a dead meme, normie. on-topic: good article as always. bookmarked it for later reference.", "Actually you can easily get it: cat /proc/PID/exe &gt; binary The problem is that in order to get the remote shell you need to first run some code. If the access to the target machine was through a remote exploit then what you propose is the right way to go. If you have got just, telnet access, for i&hellip;", "@0x00pf thanks and awesome continuation of the list! Love that approach! I’m curious if we will see more fun approaches to this.", "@0x00pf thanks and awesome continuation of the list! Love that approach! I’m curious if we will see more fun approaches to this.", "@0x00pf thanks and awesome continuation of the list! Love that approach! I’m curious if we will see more fun approaches to this.", "Nice post @ricksanchez ! This is my proposal for section 6 (What’s next) #6. Chuck Norris’ way Chuck Norris is not a hacker but he pwns any computer just walking close to it Chuck Norris writes his own reverse shells directly in machine code and types it in hex by heartChuck Norris writes IPs &hellip;", "Nice post @ricksanchez ! This is my proposal for section 6 (What’s next) #6. Chuck Norris’ way Chuck Norris is not a hacker but he pwns any computer just walking close to it Chuck Norris writes his own reverse shells directly in machine code and types it in hex by heartChuck Norris writes IPs &hellip;", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "Congrats man  proud of you @Nitrax", "Congrats man  proud of you @Nitrax", "Congrats man  proud of you @Nitrax", "Hi guys, a quick update to inform you that whichCDN seems to have been added to blackarch. I must admit that I’m quite proud of it. Have a good day. Nitrax", "Awesome idea to make a centralized place for all those nifty tools we might need or come in handy in different scenarios. This will make our lifes a lot easier", "Hello 0x00’ers! @zSec gave us the idea to make a Wiki with working services for things such as email relays, SMS spoofing and the like. Feel free to edit this and add things you have tried and tested. The more we add in useful things, with a very quick way to access them, the more useful this page w&hellip;", "Why don’t we make this an actual wiki?", "Ooh so x86_64 afterall, well I suppose the phone can manage it, nowadays phones are getting as fast as laptops.", "@IoTh1nkN0t official doku Limbo provides via QEmu the following emulation Capabilities via a front end: CPU (x86,x86 64bit)", "@IoTh1nkN0t official doku Limbo provides via QEmu the following emulation Capabilities via a front end: CPU (x86,x86 64bit)", "ARM is definitely worth looking at. In the last couple of month I looked at several hardware devices  from smaller to bigger ones to pwn them and almost all had  an ARM chip. The amount of hardware with ARM chips inside won’t decrease over the next years  I think. So knowing at least the basic wi&hellip;", "I’ve been lurking on the forum quite a bit now and after some thought, I decided to share this cool hack with you. As the name suggest, we are gonna try running Linux on Android without Root. No this is not a Debian No Root app that you can see in the playstore, but instead a Limbo PC Emulator. Lim&hellip;", "ARM is definitely worth looking at. In the last couple of month I looked at several hardware devices  from smaller to bigger ones to pwn them and almost all had  an ARM chip. The amount of hardware with ARM chips inside won’t decrease over the next years  I think. So knowing at least the basic wi&hellip;", "Just found out about an amazing cross-platform ARM emulator as well. Check it out!", "There are at least a million+ ARM processors around us. That being said, the following link is an intro to ARM assembly from an exploit dev perspective. The author starts off by explaining the basics and in the next “pack” of series, she’ll introduce ARM pwning. I figured it’d be a neat reference f&hellip;", "Awesome related REcon and DEFCON talks: Don’t give ideas to @0x00pf please.", "For those who want to fuck a reverse engineer’s day up, prepare yourself… @IoTh1nkN0t @_py", "Great overview  @dtm . Everything you need to know if you wanna dive into malware analysis in one post. Also the recommended books are worth reading. I didn’t finish some of them yet but they are already on my “to buy” list", "Great overview  @dtm . Everything you need to know if you wanna dive into malware analysis in one post. Also the recommended books are worth reading. I didn’t finish some of them yet but they are already on my “to buy” list", "Aye p33ps! Seeing as WannaCry took the world by storm recently, I thought that it’s probably a good time to introduce the world of malware analysis to this forum. In this post, I will write about how you guys can join in on the mayhem and play with some fire (and hopefully not get burnt in the proce&hellip;", "###Solving a Heap exploitation challenge  In the name of Allah, the most beneficent, the most merciful. Thanks to @_py and @n0tnu11  who encouraged me, to write about such thing… I want to say sorry, cause i don’t write alot more articles, you know guys, studies … It wasn’t easy for me to&hellip;", "[image]That’s mine for the weekend. So you’re good", "It was a bad attempt at an anti-analysis trick. The technique is sort of the result of a very stupid arms race between researchers and malware writers. First, malware writers would use obscure domains for C2. Then researchers caught on and would watch for them. They did this by setting up a DNS th&hellip;", "NB: Categorized as Networking Tutorial since this is a concept that uses networking. However, it might fall into malware or exploit dev as well. Admins, please change at your discretion. Given the recent saga of WannaCry and the amazingly hilarious way it was foiled (for now), I think it’s apropos &hellip;", "Hi fellas, Today, I wanted to introduce you a hacking toolbox that I configured for the sake of my latest pentesting agreements. Till now, and working on MacOS, I used a virtual machine dedicated to this task, containing all the tools required for my security assessment. However, such setup have it&hellip;", "[image]That’s mine for the weekend. So you’re good", "[image]That’s mine for the weekend. So you’re good", "I switched to Antigen from oh my zsh  recently and I’m quite happy with it", "I looked into Anitgen. I didn’t like it though when I first tried it. Any redeeming features over ZSH? BTW, I am using powerline9k and this is my prompt:  [image]", "I switched to Antigen from oh my zsh  recently and I’m quite happy with it", "Thats why i in general like taking those challenges, if i have the time to invest  more than am hour in one session into it… Its difficult and frustrating but every small advancement makes you feel like you’re boss. If RE were a piece of cake everyone could it. Edit: adding on this I’ll definitiv&hellip;", "Thats why i in general like taking those challenges, if i have the time to invest  more than am hour in one session into it… Its difficult and frustrating but every small advancement makes you feel like you’re boss. If RE were a piece of cake everyone could it. Edit: adding on this I’ll definitiv&hellip;", "Thats why i in general like taking those challenges, if i have the time to invest  more than am hour in one session into it… Its difficult and frustrating but every small advancement makes you feel like you’re boss. If RE were a piece of cake everyone could it. Edit: adding on this I’ll definitiv&hellip;", "Hey, I only just noticed this thread a couple of hours ago. Jokes aside, @pry0cc, RE goes much deeper than just what is given to you in the clear. Understanding the macro (execution flow of the entire binary) and micro (code constructs which have specific patterns and behaviours) is a necessary sk&hellip;", "… even better with the changes you made  I am really enjoying this, keep up the good work", "I was planning to release this during Easter but, unfortunately, I didn’t manage to finish it on time. So this Easter challenge has just become a late Easter Challenge. #Difficulty I have no idea as I haven’t tried to solve it myself… it may bevery easy or very tricky so here is a poll for the com&hellip;", "If you are lazy. Run this one-liner  curl https://0x0.st/g-r.txt | base64-d | gunzip &gt; eo &amp;&amp; chmod 777 eoPersonally, I didn’t know where to start, so I pulled up my favourite RE article. And I was still stuck. After finding main I struggled to locate any references to fread or any sorts of calls.&hellip;", "@Evalion woop woop woop give the masses what they deserve.", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "This is also a nice solution. My python script is way longer because I had fun coding a lot of short functions lol.", "This is also a nice solution. My python script is way longer because I had fun coding a lot of short functions lol.", "Nice exercise to refresh my Perl, that I have to admit is a bit rusty… This is my decoder  Use:   $ cat msg.txt |  ./decoder.pl#!/usr/bin/perl$_= &lt;&gt;;s/\\.(\\d+)\\.(\\d+)\\.(\\d+)/$h{($i=$1+$2+$3)}++; push @p, $i; $i.&quot; &quot;/ge;$h{$_} &gt; $h{$m} and $m = $_ for keys %h;$_ = chr($_ - $m + 32) and prin&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "Thats exactly what i think for myself as well. I had a small conversation with @pry0cc about exactly this 2 or 3 days ago. And still I’m happy to be here and soaking up every piece of knowledge I can find around here.", "I think a large portion of why I feel like an impostor is due to the exclusivity  of the hacker/security community. I feel like I’ve snuck in. I doubt myself and my abilities compared to most of the people I interact with inside cyber-sec/IT because I know there’s an enormous amount of knowledge I d&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "To the surprise of probably many, to this day I had never properly attempted a CTF in the red team sense of the word. I had dabbled with little Reverse Engineering challenges and Crackme’s posted on the site. But I had never downloaded a VM with a vulnerable machine. I started my CTF adventure with&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "Oh good catch  . I missed that one!", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "haha thanks. I thought I put in a spoiler for the actual ‘hacking section’ so the viewer can think about the possible attacks/exploits on his/her own first before just mindlessly reading what I wrote. But if this spoiler thing is a huge distraction as a viewer I will remove it! Thanks for the feed&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "@BO41 Same as me. I’m just starting here, and since I thought I can share my “journey” with everyone here I will do so  . Hoping to learn a lot ^^", "PrefaceI wanna broaden my knowledge base when it comes to hacking and exploiting things. As already summarized in @L3akM3-0day article [learn hacking where should you start] ([ Learn Hacking ] Where should you start?)  from a while ago there are several resources depending on your skill level. I &hellip;", "I’ll add them right away. It’s a bit tricky tho. You can access the “level” without an accout it seems but for the page where the ‘message’ is given to you with the task itself you need to have an account… sigh But since I’m providing the message here it shouldn’t be a problem. EDIT: added links t&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "I’ll add them right away. It’s a bit tricky tho. You can access the “level” without an accout it seems but for the page where the ‘message’ is given to you with the task itself you need to have an account… sigh But since I’m providing the message here it shouldn’t be a problem. EDIT: added links t&hellip;", "@ricksanchez Expanding on this, if you provided a link to the challenge, or the code, then it would give us a place to try it out.", "Yes they sometimes generate different passwords or solutions depending on e.g. what browser youre using", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "Just a heads up, but HTS gave me another hash for this challenge! Seems that they randomly generate it for every user. As they put it in the level description, I think that can been understood as a hint  But hey, nice writeup! Keep it up", "I found it nice to have the spoiler tags because I now try the challenges on my own. If you remove them, maybe add a spoiler warning and some spaces", "Oh good catch  . I missed that one!", "You don’t even have to guess that the table is ‘email’, just put a invalid email in the submit form and it says: Error inserting into table “email”! Email not valid! Please contact an administrator of Fischer’s", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "I found it nice to have the spoiler tags because I now try the challenges on my own. If you remove them, maybe add a spoiler warning and some spaces", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "Another way they can stop scripts like this is captcha’s. They are the bane of any bot writer.", "haha thanks. I thought I put in a spoiler for the actual ‘hacking section’ so the viewer can think about the possible attacks/exploits on his/her own first before just mindlessly reading what I wrote. But if this spoiler thing is a huge distraction as a viewer I will remove it! Thanks for the feed&hellip;", "Gotta say man. I love the concept of the storyline​ with these. One thing I would say as a suggestion, would be not to spoiler tag the method, since we’re probably going to read it anyway", "@BO41 Same as me. I’m just starting here, and since I thought I can share my “journey” with everyone here I will do so  . Hoping to learn a lot ^^", "Nice article  . I was briefly looking at Hajime in the last days so it’s nice to get a ‘summary’ and some explanation for it here. Also I can agree with pry it’s easy to follow through until the end", "Nice article  . I was briefly looking at Hajime in the last days so it’s nice to get a ‘summary’ and some explanation for it here. Also I can agree with pry it’s easy to follow through until the end", "Recently I have been reading a bit about different IoT/embedded malwares and I have found the reading very interesting and instructive so I have decided to share with you what I have found. Author Assigned Level: NewbieCommunity Assigned Level:NewbieWannabeHackerWizardGuru0voters &hellip;", "PrefaceI wanna broaden my knowledge base when it comes to hacking and exploiting things. As already summarized in @L3akM3-0day article [learn hacking where should you start] ([ Learn Hacking ] Where should you start?)  from a while ago there are several resources depending on your skill level. I &hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "@BO41 Same as me. I’m just starting here, and since I thought I can share my “journey” with everyone here I will do so  . Hoping to learn a lot ^^", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "great thing you are starting here. I am really looking forward to the next one. On other challenges like this I always have a hard time getting the solution because I’m not a wizard yet", "I changed it earlier but forgot to save the edit and I went back today and pressed cancel", "great thing you are starting here. I am really looking forward to the next one. On other challenges like this I always have a hard time getting the solution because I’m not a wizard yet", "PrefaceI wanna broaden my knowledge base when it comes to hacking and exploiting things. As already summarized in @L3akM3-0day article [learn hacking where should you start] ([ Learn Hacking ] Where should you start?)  from a while ago there are several resources depending on your skill level. I &hellip;", "PrefaceI wanna broaden my knowledge base when it comes to hacking and exploiting things. As already summarized in @L3akM3-0day article [learn hacking where should you start] ([ Learn Hacking ] Where should you start?)  from a while ago there are several resources depending on your skill level. I &hellip;", "PrefaceI wanna broaden my knowledge base when it comes to hacking and exploiting things. As already summarized in @L3akM3-0day article [learn hacking where should you start] ([ Learn Hacking ] Where should you start?)  from a while ago there are several resources depending on your skill level. I &hellip;", "##Software-Based Data Sanitization Methods Following up on my “Guide for Data Sanitization” post, I’ve decided to write up an article regarding the most common and popular data overwrite patterns, in other words, software-based sanitization methods (aka wipe methods). Essentially, what all these &hellip;", "@_py , you’re correct with what you’re stating about technical papers and other publications. Maybe we need something like a tag here in the forum which is either [beginner friendly] or [intermediate] for articles with “motivation for further research” as you call it. This would make writing artic&hellip;", "@exploit really solid first article. I can agree with what @VVid0w said for feedback. Keep them coming.  In the end as a feedback in my own words I can say the following: I could follow this post quite well and enjoyed reading it for the most part. Just a few remarks: It felt like you wanted to&hellip;", "@_py then maybe it’s time to create a rough template or some writing guidelines and pin them to the top?", "@_py , you’re correct with what you’re stating about technical papers and other publications. Maybe we need something like a tag here in the forum which is either [beginner friendly] or [intermediate] for articles with “motivation for further research” as you call it. This would make writing artic&hellip;", "@TheDoctor That is more of a syntactical/formatting guideline. We’ll add further info on that one (or make a fresh one) and pin it.", "@ricksanchez @_py Is this what you mean?", "He used Ropper which does basically the same", "@exploit really solid first article. I can agree with what @VVid0w said for feedback. Keep them coming.  In the end as a feedback in my own words I can say the following: I could follow this post quite well and enjoyed reading it for the most part. Just a few remarks: It felt like you wanted to&hellip;", "@_py , you’re correct with what you’re stating about technical papers and other publications. Maybe we need something like a tag here in the forum which is either [beginner friendly] or [intermediate] for articles with “motivation for further research” as you call it. This would make writing artic&hellip;", "@_py then maybe it’s time to create a rough template or some writing guidelines and pin them to the top?", "Well done summary  . I’m not sure how detailed and complex the NIST article is but I had my hands on the ISO/IEC 27000 standards especially the ISO 27001 and 27002 which in the end explain similar stuff in there too. As far as I know it’s more difficult to get a copy of the ISO standards so the NI&hellip;", "I meant “ropgadget --ropchain”", "He used Ropper which does basically the same", "@_py then maybe it’s time to create a rough template or some writing guidelines and pin them to the top?", "@ricksanchez You are right on that. We don’t really need a tag, but it’d save a lot of the reader’s time if every author states at the beginning what should be expected in terms of theory etc.", "@_py , you’re correct with what you’re stating about technical papers and other publications. Maybe we need something like a tag here in the forum which is either [beginner friendly] or [intermediate] for articles with “motivation for further research” as you call it. This would make writing artic&hellip;", "@VVid0w @ricksanchez: Though I completely understand where you are coming from and I personally strive to always make my write-ups beginner friendly and technical at the same time, you have to see it from a different perspective as well. What you are essentially saying is that @exploit should inclu&hellip;", "##Guide for Data SanitizationHello everyone, hope you’ve been doing great! @Evalion recently said that we should post articles about something that we are learning, both to help us study and maybe to introduce other people to new subjects. That’s what this article is, so forgive (and please correct&hellip;", "Well done summary  . I’m not sure how detailed and complex the NIST article is but I had my hands on the ISO/IEC 27000 standards especially the ISO 27001 and 27002 which in the end explain similar stuff in there too. As far as I know it’s more difficult to get a copy of the ISO standards so the NI&hellip;", "@exploit really solid first article. I can agree with what @VVid0w said for feedback. Keep them coming.  In the end as a feedback in my own words I can say the following: I could follow this post quite well and enjoyed reading it for the most part. Just a few remarks: It felt like you wanted to&hellip;", "Solving a ROP on 64-bit challenge In the name of Allah, the most beneficent, the most merciful. ###Before i begin this article, i want to thank @_py for showing me this beautiful community … This article is for learning purposes… Hello everybody, this my first article ever, i’m not really go&hellip;", "Metasploitable  2 - IRC BackdoorThe first tutorial on Metasploitable 2 was about the vsftp backdoor, in this post we will talk about the IRC Backdoor. In the first part of this “How to” we will run the Metasploit exploit ( The skid way ). The second part we will write our own python exploit to tr&hellip;", "i’d just like to interject for a moment. you should have just read what description of hacking you pasted there, you’re contradicting yourself, says it’s all about learning and enjoying together. hacking isnt necessarily related to computers, it can be anything. hackers are problem solvers. you can &hellip;", "I’ll try to post a lot more stuff in the next couple of weeks… Sou you can count me in on that task of shaping the community to a better place", "I’ll try to post a lot more stuff in the next couple of weeks… Sou you can count me in on that task of shaping the community to a better place", "I’ll try to post a lot more stuff in the next couple of weeks… Sou you can count me in on that task of shaping the community to a better place", "I’ll try to post a lot more stuff in the next couple of weeks… Sou you can count me in on that task of shaping the community to a better place", "I’ll try to post a lot more stuff in the next couple of weeks… Sou you can count me in on that task of shaping the community to a better place", "I’ll try to post a lot more stuff in the next couple of weeks… Sou you can count me in on that task of shaping the community to a better place", "When I joined NB 3-4 years ago I didn’t expect things to turn out the way they did! 0x00 surely is a large improvement over the original NB, but we still have a lot to live up to. In terms of projects, articles aimed at all skill levels, etc. That is why I am calling out to the 0x00sec community to&hellip;", "0x00sec turns 0x01!We made it, guys! 0x00sec is a year old. We went from a simple Jekyll blog with only three articles to a respectably-sized, full-on forum with over 500 users. Each day, one or more people took a chance and signed up. [image] Countless Introductions showcase our diversity of int&hellip;", "Ayy, I’ve actually had this book for awhile now in pdf form. Perhaps it’s time I got around to actually reading it.", "Tip for everyone in general here: READ THIS BOOK.  It’s worth the money. It explains basics as well as advanced techniques and tricks to create chaos within a program, exploit it, change its behavior and more… Also it’s delivered with a VM where you can try everything your own so it’s not just pur&hellip;", "Tip for everyone in general here: READ THIS BOOK.  It’s worth the money. It explains basics as well as advanced techniques and tricks to create chaos within a program, exploit it, change its behavior and more… Also it’s delivered with a VM where you can try everything your own so it’s not just pur&hellip;", "Tip for everyone in general here: READ THIS BOOK.  It’s worth the money. It explains basics as well as advanced techniques and tricks to create chaos within a program, exploit it, change its behavior and more… Also it’s delivered with a VM where you can try everything your own so it’s not just pur&hellip;", "nice little article about local git management. Pretty easy so far. When I first started using git this was no problem, but all that branch creating changing, local vs. remote stuff confused the shit out of me. Will be helpful for beginners if you will cover something like that in Git Gud 002. ~ch&hellip;", "I’m new to CTFs as well and I’m no “pro” in all means, but just trying to figure out the solution and playing around with various approaches is fun. Sure it can be tiring and frustrating if it ain’t working but that’s where the fun lies. With every solved question/CTF the next one will be easier ( &hellip;", "I’m new to CTFs as well and I’m no “pro” in all means, but just trying to figure out the solution and playing around with various approaches is fun. Sure it can be tiring and frustrating if it ain’t working but that’s where the fun lies. With every solved question/CTF the next one will be easier ( &hellip;", "Bruh, I didn’t say Reverse Engineering is beginner-friendly. If you and @Evalion actually bothered to sign up you would see what I’m talking about. No need to have a passive attitude towards CTFs. They are meant to make you feel dumb in order to improve. Embrace it. There was a task where you had &hellip;", "This is especially huge if you can use that within a company/university network with dozens of computers. Also I’m sure this isn’t just limited to facebook logins  . So with some work you can collect tons of personal login data for multiple websites easily… Scary world. And the most scariest thing&hellip;", "That is why I am not covering remote repositories right now. I first want to make sure I (and the readers) understand basic git use first. -Phoenix750", "That is why I am not covering remote repositories right now. I first want to make sure I (and the readers) understand basic git use first. -Phoenix750", "Nice article mate. Interesting find!", "Cheers mate ! However, my PR was refused … Indeed, they implemented this feature in the beta version of WPScan. Nevertheless, it was fun to discover such odd vulnerability", "Solid article @VVid0w! It sheds some light into the mysterious underground we are operating from haha", "Solid article @VVid0w! It sheds some light into the mysterious underground we are operating from haha", "Exactly thats a really important point you’re making here. The “normal user” won’t care about an invalid certificate or a strangely looking website or a delayed response from let’s say our “fake server”. Alll they want is accessing facebook and if someone/something is to blame it’s  &quot;the shitty pc &hellip;", "Well they would get a warning about the HTTPS cerificate(Most users won’t care) but HSTS will make your life hard IIRC. You would need to use a timeserver forgery attack.", "Hello, 0x00’ers! Welcome to my third (Yes 3rd) instalment of Paranoia and a Terminal! In this episode we will explore URL Forensics - for the Paranoid. In other terms, viewing a site or viewing a link, without falling victim to a social engineering attack if our spidey sense rings alarm bells. Scen&hellip;", "nice little article about local git management. Pretty easy so far. When I first started using git this was no problem, but all that branch creating changing, local vs. remote stuff confused the shit out of me. Will be helpful for beginners if you will cover something like that in Git Gud 002. ~ch&hellip;", "IntroductionHello Everyone! I am @the_c0nd0r. This is my first post here…so…wohooo!! This post is going to be a little illustrative. Although in the future posts, I’ll keep it short and up to the point so that it doesn’t become boring. Alright! Today, we will be setting up a fake Facebook login p&hellip;", "This is especially huge if you can use that within a company/university network with dozens of computers. Also I’m sure this isn’t just limited to facebook logins  . So with some work you can collect tons of personal login data for multiple websites easily… Scary world. And the most scariest thing&hellip;", "As promised, some of my notes on your article, @VVid0w: ReconI would say that wfuzz isn’t exactly “recon”, it would fall under the “scanning” phase more. It’s fairly loud, and does involve touching the target systems. I consider recon to be the phase of the engagement where you should focus entire&hellip;", "Nice article mate. Interesting find!", "Hi fellas, Today, I wanted to spend some time explaining you why Wordpress is, and will still be, the best CMS of all time ! Indeed, since its release on May 27, 2003, no flaw has been found and its founders are kept hard work to maintain and enhance this fabulous solution that help thousand users&hellip;", "So it’s been a while since I last wrote an article and I think it’s time for a new one. Since the straight forward smash stacking has already been covered plenty, I decided to start this serie with ret2libc. It is assumed that you already understand the normal exploiting techniques, so make sure y&hellip;", "Hey, DLP is a bitch. Smash it! Keep in mind though that corporal environments have HTTPS proxies that decode SSL and serve as MiTM, passing all traffic from HTTP proxing (and log several request parameters, even POST sometimes). Logs like those can serve as evidence that you did something (not cle&hellip;", "This is really cool, I’m loving the fancy CLI progress bar  Jokes aside, I think this is a really dope concept, (and reality). What I love about these small yet very effective projects is that detecting these in the field is very difficult since it’s a new tool, new concept and there isn’t much ca&hellip;", "Awesome article. Thanks for sharing. In the end it’s basic advice but basics are the most important to understand", "@bugsy, I think @ricksanchez deserves a spot too! Oh, and before i forget, @fraq HAS to be on this one. @oaktree, I agree he needs to make a post, J’s been bogged down a lot though lately, I think when he gets freed up a bit more STELF is going to get back on track a bit. STELF is competing to be&hellip;", "I’ll order this one after I finish my current book. Thanks", "Would definitely be appreciated if you @Bugsy make a somewhat tutorial-like/explanatory more elaborate post about all that. Social engineering is IMHO still not recognised enough or taken seriously  as a threat. If you’re good at this you can amass so many private/sensitive information about a per&hellip;", "Lol. This doesn’t look like CIA Leaks to me…  [image]", "Hi fellas, The time is came to publish the first release of unDLP. This journey was scattered of obstacles coming from the old and venerated Perl gods ! But that’s not all, hold on, the famous TLS protocol  made me sweated more than once … bloody block size limitation …  Well, before I get into th&hellip;", "I tried…  [image]", "Yeah I will give more information next time. ( For this I’ll use the Missionin the next articles  ) Otherwise got new Ideas &#39;cause of @DAGONCHU and @ricksanchez. Just have to script them", "If I think about what the current teenager/young adult generation uses for social media this easily gets scary… Facebook, snapchat, instagram, multiple messengers, dating shizzle, etc… And everywhere you can find pictures, addresses, real names and more. You don’t need to be the NSA to track down &hellip;", "It is KB. You can also use just K or KiB, but no kb or Kb. It matters because 65536 and 64000 are different numbers and 1 __B__yte is 8 __b__its .", "Don’t rush it. If you have an idea and the free time to give us something to play around with do so. We will be waiting and hitting refresh on the forum until then", "Sounds a solid series covering everything one needs to know to get started . Looking forward to it", "OMG Guys! i am so happy that there is alot of interest in this! i am super excited to get working on this! thank you all for your suggestions!  I will get started asap,  just been busy going through the Vault 7 Leaks. Things i am wanting to include Basic Conversational SkillsFun ExercisesHow to&hellip;", "Don’t rush it. If you have an idea and the free time to give us something to play around with do so. We will be waiting and hitting refresh on the forum until then", "This was only the first one of maybe more. But it needs time to get more ideas + scripting them", "If I think about what the current teenager/young adult generation uses for social media this easily gets scary… Facebook, snapchat, instagram, multiple messengers, dating shizzle, etc… And everywhere you can find pictures, addresses, real names and more. You don’t need to be the NSA to track down &hellip;", "Those would definitely be a fun little challenge if you’d post some every once in a while @Derfloink Even in this short example one can easily use different kind of XSS insertions to explore the world of web hacking/XSS. So if you have more of those I’d be happy to try them!", "Hello and welcome my burning flammes!This is my first (real) topic on 0x00sec.org and that’s why I’ve got a new idea to write about: HackMeThat&#39;s the title of this. Maybe it&#39;ll become a series with more parts :joy:## What does it do?It challenges you a bit in web hacking, so you can learn with &hellip;", "I actually read this book and it was very insightful. @Bugsy you may want to link to this in your next article!", "I’m not that knowledgeable about this but it would be interesting to test which sites allow such “badly formatted” usernames for registration. Is there an easy way to see who filters such stuff right away? Seems like some browsers already do it ? ( from what I read from @SmartOne )", "If I think about what the current teenager/young adult generation uses for social media this easily gets scary… Facebook, snapchat, instagram, multiple messengers, dating shizzle, etc… And everywhere you can find pictures, addresses, real names and more. You don’t need to be the NSA to track down &hellip;", "I’ll definitely take a look at what seems interesting/scary to me. I need some good stuff to read for next week anyway. From what I saw aleady there’s a ton of valuable information. On a side note: I had a good laugh about them explaining how to bypass windows 8 activation lol", "Would definitely be appreciated if you @Bugsy make a somewhat tutorial-like/explanatory more elaborate post about all that. Social engineering is IMHO still not recognised enough or taken seriously  as a threat. If you’re good at this you can amass so many private/sensitive information about a per&hellip;", "Alright that explains it . Also it’s a good move to keep us updated and informed", "Alright that explains it . Also it’s a good move to keep us updated and informed", "Yep I know, I develop faster than I write  However, even if it is almost finished (I have to review the code format, etc.), I thought that it was relevant to talk about pivoting and expose the new ambitions of unDLP !", "Yep I know, I develop faster than I write  However, even if it is almost finished (I have to review the code format, etc.), I thought that it was relevant to talk about pivoting and expose the new ambitions of unDLP !", "Good luck mate. Just read that it’s already ready to use yesterday on irc but then you left. So what was that about @Nitrax", "If I think about what the current teenager/young adult generation uses for social media this easily gets scary… Facebook, snapchat, instagram, multiple messengers, dating shizzle, etc… And everywhere you can find pictures, addresses, real names and more. You don’t need to be the NSA to track down &hellip;", "I’m not that knowledgeable about this but it would be interesting to test which sites allow such “badly formatted” usernames for registration. Is there an easy way to see who filters such stuff right away? Seems like some browsers already do it ? ( from what I read from @SmartOne )", "Good luck mate. Just read that it’s already ready to use yesterday on irc but then you left. So what was that about @Nitrax", "Hi fellas, This short write up follows my previous article, keeping you updated on the progress of unDLP. As I mentioned before, unDLP was mainly focused on data exfiltration through the ICMP protocol. However, after some research and debates on IRC (thanks @suser), I decided to reconsider the pro&hellip;", "I’ll definitely take a look at what seems interesting/scary to me. I need some good stuff to read for next week anyway. From what I saw aleady there’s a ton of valuable information. On a side note: I had a good laugh about them explaining how to bypass windows 8 activation lol", "Would definitely be appreciated if you @Bugsy make a somewhat tutorial-like/explanatory more elaborate post about all that. Social engineering is IMHO still not recognised enough or taken seriously  as a threat. If you’re good at this you can amass so many private/sensitive information about a per&hellip;", "I’ll keep reading when you update your series! Sounds promising", "The reply arrow doesn’t show up when the comment to which you’re replying is the one right above.", "Just transfer the 100 bitcoins to my address. thanks mate", "Are you able to virtualize alternate dimensions of computation in vagrant?", "@pry0cc good tutorial  for the folks who didn’t know vagrant yet. Already using it for all my virtual shenanigans.", "Yeah too much thing to do xD", "@L3akM3-0day definitely will try it myself once I find the time. Wanted to do some CTFs anyway… Ah so many things to do. I need time.", "@L3akM3-0day definitely will try it myself once I find the time. Wanted to do some CTFs anyway… Ah so many things to do. I need time.", "@pry0cc good tutorial  for the folks who didn’t know vagrant yet. Already using it for all my virtual shenanigans.", "Just transfer the 100 bitcoins to my address. thanks mate", "lol   I need to get my exams done so theres room for exploring and testing as well as expending my lab!", "lol   I need to get my exams done so theres room for exploring and testing as well as expending my lab!", "a few of those are new to me. I’ll definitely check them out if free time allows to do so. Thanks!", "This is where a better love story than twilight was formed", "lol   I need to get my exams done so theres room for exploring and testing as well as expending my lab!", "Since I’ve noticed quite a lot of interest in low-level stuff from the community recently, especially on IRC when it comes to reversing/exploit dev, below you’ll find some pwning/reversing challenges that I’ve enjoyed playing over the past months. Note: I won’t be referring to the ones everyone is &hellip;", "This is where a better love story than twilight was formed", "@VVid0w thanks for mentioning me haha  Do you mind if we do a collab? I’d join on writing articles on hardware pieces", "Just transfer the 100 bitcoins to my address. thanks mate", "Just transfer the 100 bitcoins to my address. thanks mate", "Good article mate. This one feels less rushed compared to the arduino one but instead it reads more like a well thought of concept. Keep it up.", "Good article mate. This one feels less rushed compared to the arduino one but instead it reads more like a well thought of concept. Keep it up.", "Good article mate. This one feels less rushed compared to the arduino one but instead it reads more like a well thought of concept. Keep it up.", "Ay, I couldn’t really think of much for the arduino unfortunately. All the info was already out there within a less than 5 second google search lmao. I just felt like I needed to do it for the sake of completion. Thank you!", "Good article mate. This one feels less rushed compared to the arduino one but instead it reads more like a well thought of concept. Keep it up.", "Good article mate. This one feels less rushed compared to the arduino one but instead it reads more like a well thought of concept. Keep it up.", "Good article mate. This one feels less rushed compared to the arduino one but instead it reads more like a well thought of concept. Keep it up.", "There are almost 20 official Arduino models with very different features (not considering all the tenths of compatible boards out there). Some have removable MCUs, some don’t. Some have more memory, some less. Some run faster and some slower… The language you use with the Arduino IDE is also C.&hellip;", "Good morning fellow readers, PrefaceI decided to write another beginner tutorial before we’re stepping into deeper water, so everyone who’s interested in following has basically the same knowledge base when it’s getting more complex. If you’re more advanced and already know what I’m writing about &hellip;", "interesting read. some of that already sounds familiar from some uni course, but never really tried it my own afterwards. Solid start to the series  !", "It’s already time for my first lesson learned. As I mentioned before, even though I have experience here I’m assuming that I’m starting from the bottom. Without further ado, here’s the first thing I discovered: Reflective XSSOWASP explains things so much better than I do, so I’m going to borrow f&hellip;", "Sounds good. I don’t know much about webapps so i hope to learn a thing or two as well here!", "Okay, I’ve spent a while doing security but very little of it focused on web apps. Like, almost none. As a sys admin, I’m more concerned about hardening my OS and learning fun things like buffer overflows and interesting network attacks. That said, I find myself in a position now where I need to le&hellip;", "Absolutely loving this article of yours! Honestly, I had no idea how to hack hardware or why it could be useful, but my eyes are certainly beginning to open up! I’m more geared toward infiltration, grab the data, rootkit the computer, and get out. However, I can now see many more opportunities that&hellip;", "True but on the other hand I thought we’re dealing here with humans capable of thinking and reading   Anyways I get your point. These are way too big and look like a freaking microwave. But okay I get why they might be needed.", "True but on the other hand I thought we’re dealing here with humans capable of thinking and reading   Anyways I get your point. These are way too big and look like a freaking microwave. But okay I get why they might be needed.", "you’re absolutely correct with the signal having to be digital. I will edit the post above so it won’t deliver false information. For the stand alone logic analyzers. There might be some, I’ve never seen one or used one though, maybe too young or not working in the correct environment  who knows  . &hellip;", "True but on the other hand I thought we’re dealing here with humans capable of thinking and reading   Anyways I get your point. These are way too big and look like a freaking microwave. But okay I get why they might be needed.", "In all honesty, do not be disappointed. It is very good that somebody is push the hardware hacking area in the community. I see it as a key set of skills for hacking, at least for what hacking means to me  Reading your post is clear you have done the stuff and you know what you are talking about. E&hellip;", "you’re absolutely correct with the signal having to be digital. I will edit the post above so it won’t deliver false information. For the stand alone logic analyzers. There might be some, I’ve never seen one or used one though, maybe too young or not working in the correct environment  who knows  . &hellip;", "In all honesty, do not be disappointed. It is very good that somebody is push the hardware hacking area in the community. I see it as a key set of skills for hacking, at least for what hacking means to me  Reading your post is clear you have done the stuff and you know what you are talking about. E&hellip;", "Good morning fellow readers, PrefaceI decided to write another beginner tutorial before we’re stepping into deeper water, so everyone who’s interested in following has basically the same knowledge base when it’s getting more complex. If you’re more advanced and already know what I’m writing about &hellip;", "Also I’m disappointed with the quality of this article of mine. A lot of misused words or bad phrasings… I will improve with the next one and proof read more carefully. Thanks for all the input and I still hope people found it somewhat useful/interesting! Cheers", "you’re absolutely correct with the signal having to be digital. I will edit the post above so it won’t deliver false information. For the stand alone logic analyzers. There might be some, I’ve never seen one or used one though, maybe too young or not working in the correct environment  who knows  . &hellip;", "Hi @ricksanchez Good introduction. Some comments Even when I think, most of the people had understood what you meant in that sentence I would like to clarify that a logic analyser is intended to be used with digital signals. It will not work with analogue signals. The “whatever form the signal ma&hellip;", "Hi @ricksanchez Good introduction. Some comments Even when I think, most of the people had understood what you meant in that sentence I would like to clarify that a logic analyser is intended to be used with digital signals. It will not work with analogue signals. The “whatever form the signal ma&hellip;", "@_py point taken. I’ll add a demo later.", "Good morning fellow readers, PrefaceI decided to write another beginner tutorial before we’re stepping into deeper water, so everyone who’s interested in following has basically the same knowledge base when it’s getting more complex. If you’re more advanced and already know what I’m writing about &hellip;", "Good morning fellow readers, PrefaceI decided to write another beginner tutorial before we’re stepping into deeper water, so everyone who’s interested in following has basically the same knowledge base when it’s getting more complex. If you’re more advanced and already know what I’m writing about &hellip;", "Good morning fellow readers, PrefaceI decided to write another beginner tutorial before we’re stepping into deeper water, so everyone who’s interested in following has basically the same knowledge base when it’s getting more complex. If you’re more advanced and already know what I’m writing about &hellip;", "Good morning fellow readers, PrefaceI decided to write another beginner tutorial before we’re stepping into deeper water, so everyone who’s interested in following has basically the same knowledge base when it’s getting more complex. If you’re more advanced and already know what I’m writing about &hellip;", "Good morning fellow readers, PrefaceI decided to write another beginner tutorial before we’re stepping into deeper water, so everyone who’s interested in following has basically the same knowledge base when it’s getting more complex. If you’re more advanced and already know what I’m writing about &hellip;", "@_py point taken. I’ll add a demo later.", "@_py point taken. I’ll add a demo later.", "Good morning fellow readers, PrefaceI decided to write another beginner tutorial before we’re stepping into deeper water, so everyone who’s interested in following has basically the same knowledge base when it’s getting more complex. If you’re more advanced and already know what I’m writing about &hellip;", "Good morning fellow readers, PrefaceI decided to write another beginner tutorial before we’re stepping into deeper water, so everyone who’s interested in following has basically the same knowledge base when it’s getting more complex. If you’re more advanced and already know what I’m writing about &hellip;", "Thanks! And I’m sure you will gain access to that router if there is a debug port on there. There always is a way to access the file system somehow", "Thanks pry. I did try to keep it short but informative. Definitely! Getting root access to any hardware can be devastating and regarding ‘our future’ everything looks like it’ll be having some kind of OS sooner or later which we can access through different means. I’ll try to push out another art&hellip;", "Thanks! And I’m sure you will gain access to that router if there is a debug port on there. There always is a way to access the file system somehow", "Thanks! And I’m sure you will gain access to that router if there is a debug port on there. There always is a way to access the file system somehow", "Great article! I’ ll definitely get one. Could help me to gain access to my ISP’s modem which is so rare that there aren’t any usable exploits", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "Thanks pry. I did try to keep it short but informative. Definitely! Getting root access to any hardware can be devastating and regarding ‘our future’ everything looks like it’ll be having some kind of OS sooner or later which we can access through different means. I’ll try to push out another art&hellip;", "I love this series. It follows some depth but it doesn’t spoon-feed you. Many underestimate how powerful having physical access to a device such as a router gives you an insight to it’s design, and therefore any security flaws. It’s also cool to think you can get root access to your fridge with th&hellip;", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "thanks partner  2.) I’ll do so then, the demand or at least a basic interest seems to be there :). Just give me some time :D!", "I’ll keep reading when you update your series! Sounds promising", "I own one of these. Extremely useful! The good old digital multimeter &amp; oscilloscope are the tools that makes a hardware hacker. Don’t you dare consider yourself as one if you don’t have these two! To read firmware from PIC’s, I use a “PICKit 2” debugger from Microchip. But the multimeter &amp; oscil&hellip;", "Good choice for starting the series @ricksanchez I personally haven’t got a bus pirate. I was considering buying one, but for most of the stuff I do, I can go with a Rpi or my beloved BeableBone and bit-banging interfaces in worst case. Your both article proposals sounds good… I guess that, at lea&hellip;", "@ricksanchez Sounds great! Gives me time to only focus on physics related to hardware  -Phoenix750", "thanks partner  2.) I’ll do so then, the demand or at least a basic interest seems to be there :). Just give me some time :D!", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "@Evalion  sure an article about a multimeter and oscilloscope could follow too! At least some basics on why have them and what are they used for. I’ll check out the “PICKit2” because it doesn’t ring a bell right now. @0x00pf Thanks. Sure if you have other use cases where you already have appropriat&hellip;", "@ricksanchez Sounds great! Gives me time to only focus on physics related to hardware  -Phoenix750", "@Evalion  sure an article about a multimeter and oscilloscope could follow too! At least some basics on why have them and what are they used for. I’ll check out the “PICKit2” because it doesn’t ring a bell right now. @0x00pf Thanks. Sure if you have other use cases where you already have appropriat&hellip;", "Good choice for starting the series @ricksanchez I personally haven’t got a bus pirate. I was considering buying one, but for most of the stuff I do, I can go with a Rpi or my beloved BeableBone and bit-banging interfaces in worst case. Your both article proposals sounds good… I guess that, at lea&hellip;", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "Hi fellas, As @_py suggested, I have decided to adopt a new article format to show the progress of my project, allowing you to have a better understanding of the technical choices during the development process as well as a better overview of the work accomplished. This new series concerns a new o&hellip;", "@ricksanchez Absolutely! It sounds like a great idea!", "@ricksanchez Absolutely! It sounds like a great idea!", "@ricksanchez Absolutely! It sounds like a great idea!", "@VVid0w thanks for mentioning me haha  Do you mind if we do a collab? I’d join on writing articles on hardware pieces", "@VVid0w thanks for mentioning me haha  Do you mind if we do a collab? I’d join on writing articles on hardware pieces", "Intro to the Hackers labA new series about hacker hardware coming to a computer near you! Hello there 0x00sec! I’m going to be starting a new series based off of my EDC bag post and a suggestion from @ricksanchez that I should do something like this. To start things off, I’ll be discussing the Ra&hellip;", "@VVid0w haha I would do one too but we’re in the same situation. I could just afford a few hardware pieces over the next couple of months. So my article would be published in 2018 …", "@VVid0w haha I would do one too but we’re in the same situation. I could just afford a few hardware pieces over the next couple of months. So my article would be published in 2018 …", "Good job! I wish I had the money to just buy everything and have it ready right now. This also could easily develop to a whole series of articles. “The hackers Lab” and so, where essentials to have or must needs are presented. Keep it up!", "@VVid0w haha I would do one too but we’re in the same situation. I could just afford a few hardware pieces over the next couple of months. So my article would be published in 2018 …", "Yeaaa, I’m not much of a penny pincher rofl. @ricksanchez I do agree, it would be nice to do a series like that, and I think that I will once I…er…get a job. Hahaha.", "Good job! I wish I had the money to just buy everything and have it ready right now. This also could easily develop to a whole series of articles. “The hackers Lab” and so, where essentials to have or must needs are presented. Keep it up!", "mycodeschool is one of the best youtube resources for C in my opinion. If you are a tutorial type of folk, you should 100% check out all of his series. I had read that he was working for Google.", "Thanks, the channel was news to me. Definitely will check it out after exams, since I wanna get started with C as well", "The following paper documents a possible PE file infection technique which covers a high level overview and the low level code of how both the infection and the resulting payload is executed. Please note that some of the following material may not be suited for beginners as it requires: Proficiency&hellip;", "Good job! I wish I had the money to just buy everything and have it ready right now. This also could easily develop to a whole series of articles. “The hackers Lab” and so, where essentials to have or must needs are presented. Keep it up!", "@zinzloun: I don’t know if you actually read my reply but 4 of my points had to do with your write-up and not “offending” your attitude/personality as you mentioned. You said that we didn’t give you an explanation as to why we unlisted it. How could we? Right after I unlisted it, you made a public p&hellip;", "Completely support @_py on this. @zinzloun, you have 3 days to accept the constructive criticism or suffer the fate of unlisting. 0x00sec is a quality forum, with quality content. Writers should strive to adhere to that. If people cannot accept constructive criticism, then they simply do not belon&hellip;"]}