{"user": "rndm_stranger", "history": ["[+] THE COURSE OF THE EVIDENCE From the actual incident / crime to the probative presentation, digital evidence is subject to various phases, as defined in the context of digital forensics. To summarize: Course 1: the digital evidence is directly identified (by the system it’s stored in, for exam&hellip;", "Hello again! The results of the poll from my last post are very clear, so I’ve decided to go forward with the “Intro to Digital Forensics” topic Like I previously mentioned, this post will cover various topics regarding Digital Forensics, hopefully serving as a good introduction to the field. I’m n&hellip;", "My Introduction First, I would like to thank 0x00sec for providing such a great community. I would also like to thank Arrogant Bastard, Sierra Nevada and Deathwish Coffee for providing the sustenance necessary for starting and completing the following series. Not only should you get drunk while com&hellip;", "According to the suggestion of @pry0cc, I open this thread in order to give you a place to share your setups and have feedback from the community. Thanks for your participation. Here is mine  Best, Nitrax", "Hi 0x00’ers! If you had seen the last ‘show off your setup’ thread, Show off your setup! You’ll notice it was a huge success, and there was a tonne of beautiful systems and setups. Since it was a little while ago and a lot of people have already renewed their existing setup, got new hardware, jump&hellip;", "OSINT 0x02 - LinkedIn is not just for jobsSup 0x00’ers, that’s right, I am back with another banger of an article, ready? If you read my last article on OSINT, you’ll know a little bit on how to find dirt on companies, their assets, and how to do all of that passively. Well now I am going to show &hellip;", "OSINT - Passive Recon and Passive Discovery Of AssetsSup 0x00’ers, to kick this badass series off, I am going to begin with the most important aspect of pentesting. Passive Recon and OSINT. Now, do not let the word ‘passive’ fool you. This is no light recon, you can uncover vast amounts of infomati&hellip;", "I think that you should put a linux distro like ubuntu on it,  then use it for streaming and some programing.", "Oh lordy… simple, BURN IT!!! On a more serious note… play with it. The limit is the sky (?)", "I used it dedicatedly for mobile app pentest (not server side). It serves well.", "Like i clearly said…remove my profile/account and all my threads and info", "I had one slightly older, runs OpenBSD like a champ.  I use it for just about everything. At one point I had a honeypot on there, it was funny to watch scriptkiddies try to h4x0r Linux and get very confused.", "I also have an old mid 2010 MacBook Pro lying around and would like to hear what you did with your if you can find something to do…", "Usually I use an old laptop: As a backup in case something happens with my primary laptop.For experiments like installing FreeBSD and figuring out how to debug the FreeBSD kernel.For portability testing, e.g. figuring out whether OpenGL projects runs on this OS/hardware as expected.Also if you&hellip;", "It really depends on the sort of stuff you like to do.  When my battery (and keyboard, and fan) died from water damage, I left it plugged in and got an external keyboard and turned it into a desktop before going server.", "I actually have Late 2011, regardless, this era of MBP’s run Arch amazing. I went one step further and installed an SSD as well, and boy is it nippy. You might find the battery is dying because it is old, mine is starting to go as well. You can get a brand new battery on ebay for these models for a&hellip;", "What about hosting a site on it? That’s what I’ve done to my Pentium 4 tower", "@pry0cc put Arch on his!", "Hey, I have an old MacBook Pro (Late 2010) laying around since it got me an new one in September. The battery drains pretty fast, but otherwise it is in very good conditions. Does anyone have a idea what project I might can realise with it? I don´t want to throw a perfectly fine computer away just &hellip;", "We Need Hackers Now More Than EverI“Yes, I am a criminal. My crime is that of curiosity.” In the years since The Hacker Manifesto was first typed out, much of the internet has changed. It has grown in both size and scope. New protocols have been invented. The web was born. It is altogether diffe&hellip;", "A Teensy? What’s that?First things first…DO NOT give this to your infant. A Teensy device is a “USB-based microcontroller development system.” Honestly, that’s really all it is. http://imgur.com/56Srx1n BUT WAIT, THERE’S MORE!!&quot;But I thought you just said…&quot; Well, yes, but it is a development&hellip;", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "Intro to the Hackers labA new series about hacker hardware coming to a computer near you! Hello there 0x00sec! I’m going to be starting a new series based off of my EDC bag post and a suggestion from @ricksanchez that I should do something like this. To start things off, I’ll be discussing the Ra&hellip;"]}