{"user": "RYUZ4KI", "history": ["Do you think that switching to your browser’s private browsing mode or incognito mode will make you anonymous? Then click: https://www.nothingprivate.ml/ Don’t actually use your real name  A cool little proof of concept, awareness-raising project", "Hello again!It’s been a while since the last Knowing Null. For those of you knew to the series, my name is skidd0 and Knowing Null is an interview series where I pester and prod the top minds of 0x00sec about themselves and then post it all publicly–a dream come true for us paranoid hackers! Today&hellip;", "Welcome to the inaugural Leap Security and 0x00sec CTF!! We have teamed up with the guys at Leap Security to bring you this challenging fun-filled event. The CTF has no limitations on participants as it is open to anyone (no registration required) – think of it as our gift back to the community!  [&hellip;", "Well anonymity, as with many things in life, is a spectrum. Short of not having a birth cert and ever having held gainful employment, someone knows who you are and what you’re doing. I was reading a book a few weeks back about anonymity and a comparison was made that for the regular Joe Schmoe in t&hellip;", "Do you think that switching to your browser’s private browsing mode or incognito mode will make you anonymous? Then click: https://www.nothingprivate.ml/ Don’t actually use your real name  A cool little proof of concept, awareness-raising project", "I just used a VPN + Changed my User agent and that was enough to fool it.", "[18%20PM]  Yep I am anoymous.", "@RYUZ4KI @foxmulderx Cool Project! Also in addition to whatever service/VPN you use to go anonymous, you can also use different search engines while inside private browsing (incognito) mode, for example: https://duckduckgo.com/ or any type of search engine that allows additional security measures t&hellip;", "Do you think that switching to your browser’s private browsing mode or incognito mode will make you anonymous? Then click: https://www.nothingprivate.ml/ Don’t actually use your real name  A cool little proof of concept, awareness-raising project", "Do you think that switching to your browser’s private browsing mode or incognito mode will make you anonymous? Then click: https://www.nothingprivate.ml/ Don’t actually use your real name  A cool little proof of concept, awareness-raising project", "@RYUZ4KI Consider making/getting a planner that has a schedule in it and write down/type in where your deadlines are set. If it is on a phone, set an alarm to remind you of what you have. I recommend trying every other person’s way above. I personally find writing my schedule down is my better way &hellip;", "He goes into details in this post: Run the Trap! How to Setup your own Honeypot to collect Malware samples RE, would you mind writing a few words about the result of this ? I’d really appreciate it. (What kind of stuff are mainly in there? What are your thoughts on it, etc) Thanks for sharing!", "He goes into details in this post: Run the Trap! How to Setup your own Honeypot to collect Malware samples RE, would you mind writing a few words about the result of this ? I’d really appreciate it. (What kind of stuff are mainly in there? What are your thoughts on it, etc) Thanks for sharing!", "Hi fellas, The time is came to publish the first release of unDLP. This journey was scattered of obstacles coming from the old and venerated Perl gods ! But that’s not all, hold on, the famous TLS protocol  made me sweated more than once … bloody block size limitation …  Well, before I get into th&hellip;", "He goes into details in this post: Run the Trap! How to Setup your own Honeypot to collect Malware samples RE, would you mind writing a few words about the result of this ? I’d really appreciate it. (What kind of stuff are mainly in there? What are your thoughts on it, etc) Thanks for sharing!", "He goes into details in this post: Run the Trap! How to Setup your own Honeypot to collect Malware samples RE, would you mind writing a few words about the result of this ? I’d really appreciate it. (What kind of stuff are mainly in there? What are your thoughts on it, etc) Thanks for sharing!", "So basically I’m really the procrastinate kind of guy. I can’t keep deadlines and I always do things last hour. People who function like clockwork, I summon you! Tip me on how to be more organized, please and thank you!", "He goes into details in this post: Run the Trap! How to Setup your own Honeypot to collect Malware samples RE, would you mind writing a few words about the result of this ? I’d really appreciate it. (What kind of stuff are mainly in there? What are your thoughts on it, etc) Thanks for sharing!", "So basically I’m really the procrastinate kind of guy. I can’t keep deadlines and I always do things last hour. People who function like clockwork, I summon you! Tip me on how to be more organized, please and thank you!", "While hackthebox is a great platform, I also feel I should warn you about some “risks”. Unlike vulnhub, htb is an online platform, meaning other, more skilled hackers, can be on the same box as you while you are still on it. Htb certainly takes measures to protect you, but they can’t do everything. &hellip;", "So, I see very few anonymity tutorials on this site, which is ashame because it’s one of the most powerful proficiencies you can master in this industry. So, let me tell you step by step how to acquire the stealthiest and sexiest anonymity setup, and how you can hide from every three-letter agency.&hellip;", "BRACE YOURSELVES because, this is a very long post and, i’ve gathered my pasts pointers to this entire topic and, with social-engineering being one of my primary special endeavors, I have now decided to give all of my pointers to you in one page. There are a lot that’s been covered, so i’m sure a th&hellip;", "I promise to write this many months ago, and finally I found some time to do it. Even when a VPN is not really a hacker tool, it is commonly used to make tracing more difficult and to increase privacy and anonymity. We have talked a lot about VPNs from a user point of view but not much about how the&hellip;", "He goes into details in this post: Run the Trap! How to Setup your own Honeypot to collect Malware samples RE, would you mind writing a few words about the result of this ? I’d really appreciate it. (What kind of stuff are mainly in there? What are your thoughts on it, etc) Thanks for sharing!", "Should add a password to it so: People know what they’re unzipping and can’t accidentally infect themselvesI can download it at school without alarms going off everywhere", "That is a whole lot of malware. Wow. I’m also curious how you collected it. Thanks, though!", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "This is a PoC-style test run for an application that I am currently developing as a personal project. Should anything weird happen, please report it to me and I’ll try to fix it. This is just a simple crackme so it shouldn’t be too hard once you start to figure out what’s happening… maybe…?  Diffic&hellip;", "I don’t know who you’re replying to, but since I created the thread, I’ll address this. A hackers setup is something that they show off. Is it serious? No. Is it fun? Yeah! It’s like putting stickers on your laptop. It gives you some sort of individuality with your setup, right down to the experien&hellip;", "IntroductionThis paper is how to setup your own Honeypot (dionaea). I would say most of us like Reverse Engineering binaries. Many of us have a fascination with malware. Why not combine them and RE some Malware that’s actively being used for exploitation? My tutorial is how to setup a honeypot on &hellip;", "If you want to see young and talented check out the work of @exploit, he’s 16, and has been doing this since he was 13.", "Everything on that list is a bad norm of Vegas except “corporatism”. I usually judge hacker gatherings on six spectrums. Who is the gathering intended for? Underground Anon Hackers to Watchlist HackersNon-Anon Hackers to Well-Known HackersHackers to Hacker Businesses and Hacker Businesses to H&hellip;", "Yes. 19 years old", "I changed my mind. Instead here’s a photo of Joanna’s computer and how she uses Qubes and VMs to secure her passwords and private keys. Each box is a VM and the arrows are how they’re connected.  [image] As you can see in the blackbox, it is a VM, not connected to anything, and it holds her priva&hellip;", "https://tinyurl.com/REalMalware Zipped. 43 GB Enjoy.", "Dude, thanks. This topic is wonderful. @Bl4ckb0x97 @occupi  you too!", "Dude, thanks. This topic is wonderful. @Bl4ckb0x97 @occupi  you too!", "You have to beat yourself into following some sort of plan. Trust me, as a fellow procrastinator the only way I’m able to get things done is if I make myself follow the plan I’ve said I will. It’s all too easy to procrastinate looking for ways to stop procrastinating. Then you end up in a vicious ci&hellip;", "So basically I’m really the procrastinate kind of guy. I can’t keep deadlines and I always do things last hour. People who function like clockwork, I summon you! Tip me on how to be more organized, please and thank you!", "Make a work plan and stick to it for long enough to make it a habit. Repeat, repeat, repeat. Leave a generous portion of down-time to prevent burn out.  Isolate what’s important and use them as the foundation to build upon.", "I did a pretty comprehensive post on this in another thread.", "So basically I’m really the procrastinate kind of guy. I can’t keep deadlines and I always do things last hour. People who function like clockwork, I summon you! Tip me on how to be more organized, please and thank you!", "So basically I’m really the procrastinate kind of guy. I can’t keep deadlines and I always do things last hour. People who function like clockwork, I summon you! Tip me on how to be more organized, please and thank you!", "Hi dude, welcome to the community! There are some things I’d like to highlight to you regarding this post. There is a common mistake people who are diving into the mists of IT make: Asking questions without even googling the title of your topic. And let me tell you that this is the most embara&hellip;", "To add on that: Practical Malware AnalysisMalware Analyst’s CookbookThese two are probably regarded as a common entry point /decent start to dive into this material", "To add on that: Practical Malware AnalysisMalware Analyst’s CookbookThese two are probably regarded as a common entry point /decent start to dive into this material", "Hi dude, welcome to the community! There are some things I’d like to highlight to you regarding this post. There is a common mistake people who are diving into the mists of IT make: Asking questions without even googling the title of your topic. And let me tell you that this is the most embara&hellip;", "Hi dude, welcome to the community! There are some things I’d like to highlight to you regarding this post. There is a common mistake people who are diving into the mists of IT make: Asking questions without even googling the title of your topic. And let me tell you that this is the most embara&hellip;", "Check out this awesome repo of material, it’s got something for everyone! http://index-of.es/ ~ IoTh1nkn0t", "Hi dude, welcome to the community! There are some things I’d like to highlight to you regarding this post. There is a common mistake people who are diving into the mists of IT make: Asking questions without even googling the title of your topic. And let me tell you that this is the most embara&hellip;", "Performing a MITM attack on the .NETGuard desktop applicationAuthors:Washi, 766F6964 Abstract:Code obfuscation is a method of preventing third parties from reverse engineering the inner workings of software. One cloud-based service that provides this kind of protection for .NET applications is .&hellip;", "That’s awesome man. Yeah, walkthroughs are super helpful. I find it’s a great platform for newbies. There is a lot to learn through playing. We’ve even played it at work when we’ve hammered through a heavy project and it’s a Friday afternoon. I learnt how to exploit XXE through HTB as well as a go&hellip;", "That’s awesome man. Yeah, walkthroughs are super helpful. I find it’s a great platform for newbies. There is a lot to learn through playing. We’ve even played it at work when we’ve hammered through a heavy project and it’s a Friday afternoon. I learnt how to exploit XXE through HTB as well as a go&hellip;", "I’ve been on HTB for more than a year now. It’s extremely fun, and imho the best way to practice for OSCP. I recommend it to every aspiring Penetration Tester. If you don’t know where to begin, just get a VIP sub and watch the retired box walkthroughs by IppSec in ascending order by difficulty.", "I’ve been on HTB for more than a year now. It’s extremely fun, and imho the best way to practice for OSCP. I recommend it to every aspiring Penetration Tester. If you don’t know where to begin, just get a VIP sub and watch the retired box walkthroughs by IppSec in ascending order by difficulty.", "Hello, 0x00ers! As you may have heard me talk about before, I am a strong advocate of using labs and CTF platforms for learning to hack and learning the skills involved in performing pentests from day to day. I believe they’re a great way to learn new skills, practice and validate your enumeration&hellip;", "0x00sec has used Cloudflare for a while; mainly for security reasons. Cloudflare is great. And it’s secure as well. But one thing is a little annoying. Captchas. I use Tor on a daily basis, and the two biggest problems with Tor are Exit Nodes and Captcha’s, Exit nodes have been notorious for runnin&hellip;", "It’s a pleasure man. You’ve given so much to this community in terms of information, exposure and knowledge. Thank you dude for choosing 0x00sec as your home!", "I just wanted to thank everyone for helping this essay get widely distributed. Especially @pry0cc. And for everyone who is a part of 0x00sec.org: I have been in this game for awhile now. I pretty much kept to myself for years…however, I believe our world is facing issues that we can only fix toget&hellip;", "Wow. What a read. For the better part of an hour, I read this article in awe. Good job man! This feels kind of like the “Art of War” of hacking. I really enjoyed your depiction of how data theft could soon become a big thing in developing countries; as did I love the Martial Arts metaphor. For re&hellip;", "I’ve been lurking and well, I think it’s time I gave my reply. First off, hacking saved my life also. I was lucky, but felt like a outcast. I started playing games with computers when I was about 7 or 8 give or take. When I was 10, I lost a friend to a disease in his neck. Basically he couldn’t bre&hellip;", "Note: Multiple edits for typos (the ghost of a learning disability mostly overcome) and additional image upload occurred between 21:10 EST, 9/30/18 &amp; 22:23 EST 9/30/18 Last year I released the essay Shared thoughts after 6+ years in pentesting: (Shared thoughts after 6+ years in Pentesting). I dec&hellip;", "Good read, props man!", "Since I haven’t been so active in the past few months because of my lack of time, I’m coming back with some new knowledge to spread around. The 0x00sec drone is on the way to be accomplished right? So why not understand how drones generally work and even build your own. Disclaimer: All the informat&hellip;", "", "This week’s guest: @REal0day!Professional career and adviceHello REal0day. Thanks for participating today! For starters, can you tell us a bit about yourself and your current role/job/work? I’m a Security Researcher at a startup that specializes in asset discovery and vulnerability assessment f&hellip;", "Some weeks ago I found [this interesting article] (https://blog.gdssecurity.com/labs/2017/9/5/linux-based-inter-process-code-injection-without-ptrace2.html), about injecting code in running processes without using ptrace. The article is very interesting and I recommend you to read it, but what caugh&hellip;", "Hello everyone, Following from Robot hacking: the Robot Security Framework (RSF) and seeing the good reception it had, I’m sharing here another piece of our work that’s been made publicly available: The Robot Vulnerability Scoring System (RVSS) is an open and free to access vulnerability scoring s&hellip;", "Hey, whose cPanel are you trying to get credentials to ? Do you have permissions ? What is your goal ?", "Exactly 100 days ago from my writing this, my lab access for Penetration Testing With Kali (PWK) began. PWK is a course offered by Offensive Security intended to prepare you for the OSCP certification exam, a grueling 24 hour endeavor where you must hack roughly 4 out of 5 computers assigned to you &hellip;", "The thesis I presented for my diploma was about physical security, with BadUSB devices taking the most amount of pages. I saw there’s already a pretty good post on how to make your own BadUSB starting from a vulnerable stick (click) but I’d like to make another contribution in the same subject by pr&hellip;", "Welcome back to Knowing NullKnowing Null is a series of interviews randomly conducted on the 0x00sec IRC server and compiled here for your convenience. Today’s guest is the ever present pry0cc! But, first, a poll! Who do you want to see next time?fraqdtmricksanchezzSecsprtn0x00pfPhoenix&hellip;", "Welcome Back to Knowing Null!This week, you voted to bring in ricksanchez! Let’s just jump right into it.First, I’d like to thank you for joining this series of course, anytime  If people really feel the urge to get toknow more about me this is the perfect chance! Can you tell me and the read&hellip;", "https://github.com/colental/byob Built this to teach myself Python. Any thoughts?", "The ProjectI started programming an encrypted chat client and server to learn more about encryption and how it’s implemented in network protocols (e.g. SSH or HTTPs over TLS). Now that it’s almost complete, I wanted to share what I learned with you. I’m splitting up this series into two posts. The&hellip;", "I run macOS High Sierra (Hackintosh), I like the graphics of the Apple Operating System                       [image]           I usually work with 5 workspaces (Browser, Terminal, Music, VM, Communication)                       [image]           I use iTerm 2 as terminal and Fish as shell&hellip;", "Exploitation in 2018 - How Pentesting Has ChangedHi 0x00sec! This is the next installment of my pentesting series. If you missed my last two articles, you can read the first one here and the second one here. They are heavily OSINT focussed, and naturally, the next article should be about active rec&hellip;", "Greetings from space, It’s great to post once in a while and help share knowledge. This series is an android series. We will develop spying features into our app. I’m naming the app AMUNET but you are free to of course name it as you please. The idea originated from the God’s Eye hacking program in&hellip;", "What is the purpose of that “joke” ransomware ?  This stinks man…", "What is the purpose of that “joke” ransomware ?  This stinks man…", "It contains a “puzzle” that the users must play in order for the program to decrypt the files, lol", "What is the purpose of that “joke” ransomware ?  This stinks man…", "I use bleachbit. If you’re asking about a Linux version of defrago or something then you probaly want to use gparted or something.", "Hey peeps, as I was sweeping thru a bunch of drives with the purpose of saving data for 3rd party I started to wonder what is the best way to keep the bytes in order on HDDs with security in mind. Most of these drives are SSDs so the typical let’s write a bunch of data to the drive over and over ag&hellip;", "This is what it feels like to hack via SSH on phone…", "Hey peeps, as I was sweeping thru a bunch of drives with the purpose of saving data for 3rd party I started to wonder what is the best way to keep the bytes in order on HDDs with security in mind. Most of these drives are SSDs so the typical let’s write a bunch of data to the drive over and over ag&hellip;", "OSINT - Passive Recon and Passive Discovery Of AssetsSup 0x00’ers, to kick this badass series off, I am going to begin with the most important aspect of pentesting. Passive Recon and OSINT. Now, do not let the word ‘passive’ fool you. This is no light recon, you can uncover vast amounts of infomati&hellip;", "I don’t really have much in terms of a fancy desktop, I spend most of my life in Vim anyway.  [screenFetch-2018-06-01_12-06-06]The screenshot there is from my laptop, a 2015 MacBook Pro - in my opinion still the best model. Anyway, onto the software I use! My config is not quite as consolidated a&hellip;", "I personally prefer the classics of Microsoft. Me reading this post: [Lynx] On irc: [jrirc] Debugging things and stuff! [debug]", "My Introduction First, I would like to thank 0x00sec for providing such a great community. I would also like to thank Arrogant Bastard, Sierra Nevada and Deathwish Coffee for providing the sustenance necessary for starting and completing the following series. Not only should you get drunk while com&hellip;", "Hoodies are cool. 0x00sec is cool. You know what is even cooler? 0x00sec Hoodies.We get it, you’re a badass, and you love hacking + computers. But you would look even more badass with one of these bad boys. [image][image]Do you want something more understated? Okay. We gotcha.  [image] [i&hellip;", "Knowledge is Power But like all power, there are those who want to keep it for themselves but em not one of them. I was feeling bored and I start checking my bookmarks and I found these linked in my bookmarks so I thought I should make a list and share with others because knowledge should be free .&hellip;", "Getting Stealthy with StelfHello 0x00’ers! In this tutorial, I am going to be giving away some content that has been sought after for a long time. Everybody knows that most prebuilt tools such as Metasploit don’t work, payloads generated by them, or encoders used with them. They get picked up by a&hellip;", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "Hello, fellow 0x00’ers! First off, I lied. It’s not a botnet. But it enables you to achieve botnet-like abilities. Today I am going to show you something that has been kept a secret for a long time in the hacker community and has never really been made accessible to the average hobbyist. With this&hellip;", "Proxychains with a standard nmap scan will work. My question to you would be why you would need TCP syn scans? Of course, they’re nice, but for ordinary recon, a standard nmap -A scan will do plenty. Another thing I would recommend looking into is hooking into the Shodan database. They’ve scanned a&hellip;", "Hello everyone. I have made some minor edits since first posting this as to further clarify a couple of points. I joined this community a while ago; I have/had been a lurker for even longer.  A huge part of what made the hacker community what it was (and what it is here) involves a willingness to &hellip;", "If any of you folks are interested in what I carry for my red team engagements: NOTE: Entry tools are not legal everywhere. Before I go on an engagement, I make sure I know the relevant laws. BagGoRuck GR1 - This bag is tough as nails, and big enough to carry all the gear I need. Whether I’m snea&hellip;", "Note: This is a repost from my personal blog GIF/Javascript Polyglots: Abusing GIFs, tags, and MIME types for evil6 minute read The backstoryRecently I saw a feature on a product I work on where we allowed hotlinking to arbitrary gifs without pulling them in, mangling, and then saving for our ow&hellip;", "If you are reading this is because you want to be a hacker. Therefore, you are automatically a wannabe. It does not sound that cool, but it is actually pretty cool. It means that you still have a lot of exciting things to discover!!! First things first. This is going to be a joint course on C and a&hellip;", "Well, I finally finished ricing my system. Took awhile because of some delays I had.  [image]Operating System: Kali Linux Ricing: i3 Window Manageri3blocks for statusTermite terminal emulatorAtom text editordmenu for applicationsWeb Browser: Firefox-esr with some of twily’s configs Not&hellip;", "Ok here is my setup! I run ArchLinux with the i3 tiling window manager. This is configured by myself using a very heavily modified version of OxHak’s config. I am using conky for the top bar. My anonymity setup is fairly simple. I have a collection of VPN’s and I connect to a different one every da&hellip;", "Today well be learning how to do a simple ARP Spoof or ARP Poison in python. ARP spoofing can be used for a few things, DoS, MitM, Session Hijacking,Stripping SSL(technically mitm). Today well be using it for a basic Man in the Middle attack. So lets get started with some quick background info. &hellip;", "So many of us here are looking for work or interviewing for jobs. Others of us have plenty of experience interviewing or being interviewed. Let’s put those skills together and make our community better! I’m going to lead from the front here by sharing a link where you can subscribe to my calendar a&hellip;", "Hello fellow 0x00sec h4x0rz!! Today I’m coming to you with a discussion topic on EDC bags. An EDC bag is something that you carry with you every day, I.E, an &#39;E’very &#39;D’ay &#39;C’arry bag. The Bag.Alright, so, what’s an EDC bag without the bag part?! Personally, I don’t think you need an expensive, s&hellip;", "IntroductionFirst and foremost, I’d like to note that this is not an all encompassing article. You WILL have to use your creativity and think out of the box when hacking. What will this article entail? It will not have any code whatsoever, and is not meant to teach you how to hack anything specif&hellip;", "Community Assigned Level:NewbieWannabeHackerWizardGuru0voters Show resultsThere won’t be anything groundbreaking in here, and a lot of the content will be sourced from others (properly attributed, mind you). However, I am going to try to bring a different perspective to the t&hellip;", "WordPress is the Flash Player of the CMS world. [image]", "We Need Hackers Now More Than EverI“Yes, I am a criminal. My crime is that of curiosity.” In the years since The Hacker Manifesto was first typed out, much of the internet has changed. It has grown in both size and scope. New protocols have been invented. The web was born. It is altogether diffe&hellip;", "Hey! A very quick little tutorial here, (really not advanced at all), but may save you a tonne of time. Big scary disclaimer: I don’t advise pirating blah blah, I cannot be held responsible for the billions of dollars of “theft” you do with this. Blah Blah. Don’t sue me. Here’s the deal - You’re a&hellip;", "Hi fellas, A few days ago, I decided to start my adventure in the reverse engineering domain. I was quickly overwhelmed by a bunch of information and op codes that confused me a lot, even with solid knowledge in assembly and programming. Reverse engineering can seem complex at the first glance, ho&hellip;"]}