{"user": "salvation", "history": ["Like i clearly said…remove my profile/account and all my threads and info", "remove the thread and my account and all my threads.", "In case it wasn’t clear, I was trying to say that I am sorry. So, I am sorry. I wasn’t trying to offend you. If you have anything you want to say to me, please come by the irc. Thanks, FFY00", "this is exactly why I hate people and society…i try to be myself and do something nice and this is the result", "I didn’t meant it like that. It did came out a bit aggresive and negative, but that was not what I was trying to do.", "I think you should keep your negative ass comment to yourself …first off second … I am sorry that’s just my style nobody told me you were the sole judge and jury on whats 1337 and whats not…lol third … not everything needs to be as plain as white bread and not everything is cli so again keep your&hellip;", "Like i clearly said…remove my profile/account and all my threads and info", "Like i clearly said…remove my profile/account and all my threads and info", "This is for Deshi, welcome to the early-mid 90s, Original txt file from Machacking.net (&gt;Introduction&lt;)What is a BLACK BOX? A BLACK BOX is a device that is hooked up to your phone that fixes your phone so that when you get a call, the caller doesn’t get charged for the call. This is good for call&hellip;", "Like i clearly said…remove my profile/account and all my threads and info", "Like i clearly said…remove my profile/account and all my threads and info", "Like i clearly said…remove my profile/account and all my threads and info", "CTF is always a great place to start. Challenging yourself is the best way to get experience There is a CTF section here, besides lots of reading vulnhubs also help best of luck in your travels", "CTF is always a great place to start. Challenging yourself is the best way to get experience There is a CTF section here, besides lots of reading vulnhubs also help best of luck in your travels", "One of the big hurdles I experienced when entering this industry was that I was intimidated by all the stuff there is to learn, just like you are now. Thankfully, you don’t need to know everything. Some like reverse engineering binaries, others like tinkering, and that is fine! You’ll find your plac&hellip;", "CTF is always a great place to start. Challenging yourself is the best way to get experience There is a CTF section here, besides lots of reading vulnhubs also help best of luck in your travels", "CTF is always a great place to start. Challenging yourself is the best way to get experience There is a CTF section here, besides lots of reading vulnhubs also help best of luck in your travels", "IntroductionLinux has been around for 25 years now. I started using it as my main OS around 2 years back (was quite young then and n00bish). I did not care to learn much about it, I just used it to do my homework and some personal stuff. Not long ago I decided to switch to ArchLinux from Ubuntu Mat&hellip;", "Like i clearly said…remove my profile/account and all my threads and info", "Like i clearly said…remove my profile/account and all my threads and info", "Note: This is a repost from my personal blog GIF/Javascript Polyglots: Abusing GIFs, tags, and MIME types for evil6 minute read The backstoryRecently I saw a feature on a product I work on where we allowed hotlinking to arbitrary gifs without pulling them in, mangling, and then saving for our ow&hellip;", "Like i clearly said…remove my profile/account and all my threads and info", "Like i clearly said…remove my profile/account and all my threads and info"]}