{"user": "SapereAude", "history": ["Hello guys, That’s my very first post here. I’m new to hacking and I’m learning the Reconnaissance phase. I’m also completely new to Networking… but I’m always thinking how anonymize all my techniques. I would like to ask which are the most anonymous active recon technique that you guys are applyin&hellip;", "Sure thing, good luck.", "Becoming Anonymous Like a Pro #3: The Inner Workings of TORTORTOR as we know has been broken and hacked, which is why many people are now discarding TOR and moving on. As you should too, because it used to be a great anonymization tool. As we’ve seen with Sabu. How TOR Works Node = RouterWhen&hellip;", "@mf_redstars Thanks for your suggestion, but as the title says, I’m searching for an active scanning technique. I’m trying to collect information that no more passive gathering can give.", "Sure… that is exactly what this community is for", "Hello guys, That’s my very first post here. I’m new to hacking and I’m learning the Reconnaissance phase. I’m also completely new to Networking… but I’m always thinking how anonymize all my techniques. I would like to ask which are the most anonymous active recon technique that you guys are applyin&hellip;", "First of all, thanks for all the answers!  @fxbg Yes, I’m searching and learning about that. But my concern is about the IP leakage when Nmap bypasses the Proxychain during the part of the execution, as mentioned here @Nitrax Do you have any guide/link about that in hands to share? I would real&hellip;", "@0x00pf Thanks a lot for sharing. I read both articles and now I understand much more about how anonymize my scanning (and searching for more).  I’m still learning, but maybe we can discuss more about some techniques and approaches in the future as I’m testing and learning… if you don’t mind.", "Sure… that is exactly what this community is for", "@0x00pf Thanks a lot for sharing. I read both articles and now I understand much more about how anonymize my scanning (and searching for more).  I’m still learning, but maybe we can discuss more about some techniques and approaches in the future as I’m testing and learning… if you don’t mind.", "@0x00pf Thanks a lot for sharing. I read both articles and now I understand much more about how anonymize my scanning (and searching for more).  I’m still learning, but maybe we can discuss more about some techniques and approaches in the future as I’m testing and learning… if you don’t mind.", "Hi @SapereAude, Giving a straight answer is almost impossible. Indeed, beeing stealthy not relies entirely to your proxies setup, your machine must be hardened too in order to avoid network fingerprinting, etc. The best tip that I can give you is to setup a VPS then ask, to your provider, for a pe&hellip;", "Proxychains with a standard nmap scan will work. My question to you would be why you would need TCP syn scans? Of course, they’re nice, but for ordinary recon, a standard nmap -A scan will do plenty. Another thing I would recommend looking into is hooking into the Shodan database. They’ve scanned a&hellip;", "Well, aggressive scan or others. The point of my post was to encourage you to test by yourself several scanning way in order to understand the inner working of networking as well as find the steathliest way to reach your goal  Will be posted soon", "If you want to understand why/how nmap leaks IPs maybe these post two post may help you to get started: SELFPROMO MODE ON  SELFPROMO MODE OFF  TL;DR;Normal HTTP proxies, as well as SOCKSv4, only support TCP traffic, therefore any nmap flag that requires the transmission of UDP or ICMP packe&hellip;", "LEVEL: Beginner Port scanning is the process of finding out which ports are open in a given machine. An open port usually means a program listening on that port, and a program means bugs, and bugs means exploits… roughly :). OK, everybody in the world uses nmap for this task. It would be stupid to&hellip;", "Welcome to this new series intended to explain the guts of all those hacker’s tools out there you use or want to use… Basically, we are going to explain you how does they work and how do you can build your own… Keep reading if you do not want to be a Skid ;). We will start the series with Proxychai&hellip;", "Hello everyone of 0x00! I figured why not make my first contribution, so heres a quick one  Today, im going to brush the topic of proxies, followed by how to set up ProxyChains to make being tracked a bit harder. So first things first. What is a proxy? In computer networks, a proxy server is a s&hellip;", "If you want to understand why/how nmap leaks IPs maybe these post two post may help you to get started: SELFPROMO MODE ON  SELFPROMO MODE OFF  TL;DR;Normal HTTP proxies, as well as SOCKSv4, only support TCP traffic, therefore any nmap flag that requires the transmission of UDP or ICMP packe&hellip;", "That’s exactly what I’m trying to learn. I’m just trying to connect all the dots. At the moment, it’s a lot of fucking dots floating around.  Please, let me be the first to know! Thanks for your help.", "Well, aggressive scan or others. The point of my post was to encourage you to test by yourself several scanning way in order to understand the inner working of networking as well as find the steathliest way to reach your goal  Will be posted soon", "What combinations do you use? What’s your technique? Yes, now I’m trying to understand which kind of scan I necessarily need leak my IP address to obtain the specific recon goal…", "The paper you posted describes which scans will leak the IP, you would simply avoid those combinations, which I don’t use any of those anyway. Sometimes OS detection but that can be done through plenty of other techniques.  [31%20AM]", "First of all, thanks for all the answers!  @fxbg Yes, I’m searching and learning about that. But my concern is about the IP leakage when Nmap bypasses the Proxychain during the part of the execution, as mentioned here @Nitrax Do you have any guide/link about that in hands to share? I would real&hellip;", "Hi @SapereAude, Giving a straight answer is almost impossible. Indeed, beeing stealthy not relies entirely to your proxies setup, your machine must be hardened too in order to avoid network fingerprinting, etc. The best tip that I can give you is to setup a VPS then ask, to your provider, for a pe&hellip;", "Hello guys, That’s my very first post here. I’m new to hacking and I’m learning the Reconnaissance phase. I’m also completely new to Networking… but I’m always thinking how anonymize all my techniques. I would like to ask which are the most anonymous active recon technique that you guys are applyin&hellip;", "Hello guys, That’s my very first post here. I’m new to hacking and I’m learning the Reconnaissance phase. I’m also completely new to Networking… but I’m always thinking how anonymize all my techniques. I would like to ask which are the most anonymous active recon technique that you guys are applyin&hellip;", "Hello guys, That’s my very first post here. I’m new to hacking and I’m learning the Reconnaissance phase. I’m also completely new to Networking… but I’m always thinking how anonymize all my techniques. I would like to ask which are the most anonymous active recon technique that you guys are applyin&hellip;"]}