{"user": "sir1ous", "history": ["That’s some pretty awesome news! I really need to try HTB, those labs look amazing. Did anyone here tried rastalabs? I heard it’s amazing for sharpening AD skills, but I’m a bit reluctant to jump right in, because I have almost no experience in windows environments.", "That’s some pretty awesome news! I really need to try HTB, those labs look amazing. Did anyone here tried rastalabs? I heard it’s amazing for sharpening AD skills, but I’m a bit reluctant to jump right in, because I have almost no experience in windows environments.", "Hello, 0x00ers! As you may have heard me talk about before, I am a strong advocate of using labs and CTF platforms for learning to hack and learning the skills involved in performing pentests from day to day. I believe they’re a great way to learn new skills, practice and validate your enumeration&hellip;", "That’s some pretty awesome news! I really need to try HTB, those labs look amazing. Did anyone here tried rastalabs? I heard it’s amazing for sharpening AD skills, but I’m a bit reluctant to jump right in, because I have almost no experience in windows environments.", "Sure - I do think however your issue is not one with HackTheBox itself, but rather an issue with CTF platforms period. They have their place, and they’re very good for isolated exercises and learning how to exploit things such as code execution, XXE, XSS, SQL Injection, enumeration and the like. HT&hellip;", "Thank you!!! I will look into this!!!", "I think the best way to do so would be setting up a simple app on an external VPS that will just return your IP address. You could use publicly available services to do so, but I personally would not trust them. Here is a simple flask app that would do exactly that: from flask import Flaskfrom fl&hellip;", "I think the best way to do so would be setting up a simple app on an external VPS that will just return your IP address. You could use publicly available services to do so, but I personally would not trust them. Here is a simple flask app that would do exactly that: from flask import Flaskfrom fl&hellip;", "Yeahhh. I’m starting to notice that. As with the case of F5, you can theoretically pwn many other devices that do not include libssh in their banner, such as the scanner from Leap Security / Jbroche that does banner grab. For example there are likely other embedded devices using Libssh that do not&hellip;", "I think the metasploit module @hackerfantastic is using works only against libssh with removed additional checks. (Pretty FUD if you ask me  ) From what I know there is no way to spawn a shell without those modifications.", "I think the metasploit module @hackerfantastic is using works only against libssh with removed additional checks. (Pretty FUD if you ask me  ) From what I know there is no way to spawn a shell without those modifications.", "Well, you are not really using SHA1MD5 with and without salt but plain SHA1/MD5 and bcrypt (which is completely different hashing method). If you want to implement a simple bruteforce, you can use python’s itertools: from itertools import productfrom hashlib import md5test_hash = &#39;098f6bcd4621d&hellip;", "Well, you are not really using SHA1MD5 with and without salt but plain SHA1/MD5 and bcrypt (which is completely different hashing method). If you want to implement a simple bruteforce, you can use python’s itertools: from itertools import productfrom hashlib import md5test_hash = &#39;098f6bcd4621d&hellip;", "Well, you are not really using SHA1MD5 with and without salt but plain SHA1/MD5 and bcrypt (which is completely different hashing method). If you want to implement a simple bruteforce, you can use python’s itertools: from itertools import productfrom hashlib import md5test_hash = &#39;098f6bcd4621d&hellip;", "Yup, this should be an address of the LoadLibraryA function.", "I think you need to declare proper restype and argtypes for GetModuleHandle and GetProcAddress. Anyway this answer worked for me: https://stackoverflow.com/questions/33779657/python-getmodulehandlew-oserror-winerror-126-the-specified-module-could-not-b/33780664#33780664 TLDR: kernel32 = ctypes.Wi&hellip;", "I appreciate your help, thank you", "You should print them out in hex because it’d make more sense/readable. No one prints addresses in decimal.", "Yup, this should be an address of the LoadLibraryA function.", "[C] Is this normal ?", "I think you need to declare proper restype and argtypes for GetModuleHandle and GetProcAddress. Anyway this answer worked for me: https://stackoverflow.com/questions/33779657/python-getmodulehandlew-oserror-winerror-126-the-specified-module-could-not-b/33780664#33780664 TLDR: kernel32 = ctypes.Wi&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "Exploitation in 2018 - How Pentesting Has ChangedHi 0x00sec! This is the next installment of my pentesting series. If you missed my last two articles, you can read the first one here and the second one here. They are heavily OSINT focussed, and naturally, the next article should be about active rec&hellip;", "Clientside Exploitation - Tricks of the Trade 0x01 - Sharpshooter + SquibblyTwoHi! I hope you’re well, today I am going to show you something that is common knowledge in the red teaming community, people use this kind of thing every day without thinking about it. However, if you’re new to security,&hellip;"]}