{"user": "Sirius", "history": ["g0tmi1k’s blog is dope, for window’s privesc I usually use this as reference. http://www.fuzzysecurity.com/tutorials/16.html", "Yesssss!!! Stack Canaries pleaseeee!!!", "Hey guys, back with just another casual article from me this time around since one of my projects failed miserably and I don’t really have the time for another serious one. Also I’ve getting into something new, as you may have already guessed, kernel-mode development! Yeah, pretty exciting stuff and&hellip;", "Sweet github of malicious things. I have been thinking of setting up malware zoo that has bit more infrastructure such as automated submission to a sandbox and other analysis tools. Do you guys have some thoughts? I have been exploring this idea:", "Here’s all the malware I’ve been collecting from my honeypot. Enjoy the Park! [image]", "Hey guys, as you may or may not know, I developed an application dubbed “NoREpls” for the purposes of teaching Windows reverse engineering as a side project. It’s been a while since its debut here so I’ve decided to finally upload its source on my GitHub page here: https://github.com/NtRaiseHardErro&hellip;", "IntroductionThis paper is how to setup your own Honeypot (dionaea). I would say most of us like Reverse Engineering binaries. Many of us have a fascination with malware. Why not combine them and RE some Malware that’s actively being used for exploitation? My tutorial is how to setup a honeypot on &hellip;", "PrefaceHi folks! For quite some time there was no article from my side. Life kept me busy with all sorts of things, but here is a little something until some cooler project emerges  . This article will focus on explaining the ELF file format. While this may seem like a really boring and very th&hellip;", "ARM Crackme - Starting with EOR@Wunkolo and I have decided that there aren’t enough ARM crackmes on the forum and that we should add a few for people that are interested in learning how the architecture works and for those that just want to show their skills  We will start very easy with some chal&hellip;", "IntroSecond write-up here; this is something I just happened upon today while (super) bored at work.  I’m not a math/algorithm nerd by any means, but I did find this pretty fascinating.  This will walk you through what I found and how I moved forward with it. If anyone knows of an official name fo&hellip;", "Suser would like for me to say that he was here, but he never gets on the forum, so he wasn’t.", "Hi! As for your big reverse engineering frameworks You can always check out the new IDA 7 free version which is quite limited in terms of functionality tho. Otherwise if you can spare a few bucks check out binaryninja. It’s not yet on par with the paid IDA version but for your general CTF style E&hellip;", "Hi, You can use IDA 7.0 Free which runs perfectly on Linux. Or you can use radare2 which is popular amongst Linux reversers (they have also a GUI in development, Cutter). Otherwise for debugging, you still have gdb", "Hello 0x00sec! As some of you may have seen in IRC, I have promised to deliver an article. But I couldn’t unfortunately, because my work has been intense lately. Then I thought that I could translate a few of my blog posts which I’m writing on my website (http://www.robindimyanoglu.com) as a less t&hellip;", "1- How to use outside my LAN ?I tried writing my public IP in the code and a port number but the client didn’t connect. You’ll need to forward the port, that you specified when you created the shell, back from your router to your localhost; this is, of course, assuming you’re sitting behind a rou&hellip;", "1- How to use outside my LAN ?I tried writing my public IP in the code and a port number but the client didn’t connect. You’ll need to forward the port, that you specified when you created the shell, back from your router to your localhost; this is, of course, assuming you’re sitting behind a rou&hellip;", "1- How to use outside my LAN ?I tried writing my public IP in the code and a port number but the client didn’t connect. You’ll need to forward the port, that you specified when you created the shell, back from your router to your localhost; this is, of course, assuming you’re sitting behind a rou&hellip;", "I didn’t get this part, could you explain more? and how this solves problem that the client doesn’t exactly know servers ip each time?", "1- How to use outside my LAN ?I tried writing my public IP in the code and a port number but the client didn’t connect. You’ll need to forward the port, that you specified when you created the shell, back from your router to your localhost; this is, of course, assuming you’re sitting behind a rou&hellip;", "This looks like fun! TFTI @Sirius. Also, what’s up with IRC? Invitation required for #0x00sec ??", "Userland API Monitoring and Code Injection DetectionAbout This PaperThe following document is a result of self-research of malicious software (malware) and its interaction with the Windows Application Programming Interface (WinAPI). It details the fundamental concepts behind how malware is able to&hellip;", "Yesssss!!! Stack Canaries pleaseeee!!!", "@Sirius, this is the @ricksanchez we’re talking about here. Exactly. Stop doubting me y’all  Do you come from the future?! O.o You should have clicked the link below that. Redirects to the Black Hat Asia 2018 site, where you can find a short briefing about that upcoming talk  Awesome write-&hellip;", "You’re missing a #FreestyleFebruary tag, my guy.", "@Sirius, this is the @ricksanchez we’re talking about here. Exactly. Stop doubting me y’all  Do you come from the future?! O.o You should have clicked the link below that. Redirects to the Black Hat Asia 2018 site, where you can find a short briefing about that upcoming talk  Awesome write-&hellip;", "@Sirius, this is the @ricksanchez we’re talking about here.", "@Sirius, this is the @ricksanchez we’re talking about here.", "New ASLR bypass presented in March 2018 Do you come from the future?! O.o", "You’re missing a #FreestyleFebruary tag, my guy.", "New ASLR bypass presented in March 2018 Do you come from the future?! O.o", "New ASLR bypass presented in March 2018 Do you come from the future?! O.o", "New ASLR bypass presented in March 2018 Do you come from the future?! O.o", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "You’re missing a #FreestyleFebruary tag, my guy.", "You’re missing a #FreestyleFebruary tag, my guy.", "Tutorial: Creating Yara Signatures for Malware DetectionIntroductionWe all know it’s way more fun to hack shit than to patch shit. That said, not all employers will be satisfied with a hacker who can only compromise systems. Some companies want security researchers that are able to apply patches b&hellip;", "As we start to see an influx of articles, can we get a couple of native english English-speaking volunteers to go through and edit each post (While while working closely with the author, of course) to ensure proper grammar and flow for easy reading, especially for those who’s whose first language is&hellip;", "Small addition to that: If you don’t have the metasploit framework installed but are using either pwntools or a gdb enhancement like pwndbg you can use either to create cyclic patterns as well: Using pwntools: &gt;&gt;&gt; from pwn import *&gt;&gt;&gt; print cyclic(256)aaaabaaacaaadaaaeaaafaaagaaahaaaiaaajaaaka&hellip;", "Community Assigned Level:NewbieWannabeHackerWizardGuru0voters Show resultsThere won’t be anything groundbreaking in here, and a lot of the content will be sourced from others (properly attributed, mind you). However, I am going to try to bring a different perspective to the t&hellip;", "As we start to see an influx of articles, can we get a couple of native english English-speaking volunteers to go through and edit each post (While while working closely with the author, of course) to ensure proper grammar and flow for easy reading, especially for those who’s whose first language is&hellip;", "As we start to see an influx of articles, can we get a couple of native english English-speaking volunteers to go through and edit each post (While while working closely with the author, of course) to ensure proper grammar and flow for easy reading, especially for those who’s whose first language is&hellip;", "Absolutely! Those with a higher trust level can edit posts. If you’re up for it, talk to me in IRC later today.", "As we start to see an influx of articles, can we get a couple of native english English-speaking volunteers to go through and edit each post (While while working closely with the author, of course) to ensure proper grammar and flow for easy reading, especially for those who’s whose first language is&hellip;", "As we start to see an influx of articles, can we get a couple of native english English-speaking volunteers to go through and edit each post (While while working closely with the author, of course) to ensure proper grammar and flow for easy reading, especially for those who’s whose first language is&hellip;", "As we start to see an influx of articles, can we get a couple of native english English-speaking volunteers to go through and edit each post (While while working closely with the author, of course) to ensure proper grammar and flow for easy reading, especially for those who’s whose first language is&hellip;", "As we start to see an influx of articles, can we get a couple of native english English-speaking volunteers to go through and edit each post (While while working closely with the author, of course) to ensure proper grammar and flow for easy reading, especially for those who’s whose first language is&hellip;", "Yup, that’s the one.", "I think I have done that a couple of times… You may be referring to this one:", "Yup, that’s the one.", "I think I have done that a couple of times… You may be referring to this one:", "If i’m not mistaken, I believe @0x00pf did that at one point in the past 2 yrs.", "If i’m not mistaken, I believe @0x00pf did that at one point in the past 2 yrs.", "Hints will only be given 1-2 months after the challenge’s release Hmmmm, seems like you haven’t even solved it yourself yet. =p", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "IntroductionHello folks, I hope you’re doing great! Today’s topic will be once again heap exploitation related. In fact, we’ll be going over the recent updates of glibc’s heap allocator, (pt)malloc, which I’ve researched/reversed lately and decided to present them to you since there is barely any i&hellip;", "For those of us out there who prefer the written equivalent, could I suggest a short summary about the details you have included in the video?", "Malicious file is a string-obfuscated AutoIT script,Finds the decoding function that decodes the obfuscated strings,Writes his own AutoIT script to call the string decoder by passing in the obfuscated string as a command line parameter,Uses PHP to read in the malicious AutoIT script,Regexes lin&hellip;", "For those of us out there who prefer the written equivalent, could I suggest a short summary about the details you have included in the video?", "For those of us out there who prefer the written equivalent, could I suggest a short summary about the details you have included in the video?", "READMEIf your antivirus detects this page as malicious, it is most probably because I have pasted some scripts into the article. Do not be alarmed! IntroductionVery recently I’ve (finally) set up a proper malware analysis VM and so I thought that it would be super fun to download some samples fro&hellip;", "Hi everyone, You may notice an absence of subcategories. We (Staff) decided that subcategories weren’t really helping. The change has accidentally necrobumped a few posts. Sorry about that. If you see a subcategory remaining, don’t feed it; don’t try to reason with it; just let us know if we miss&hellip;", "Hi @cmderpt, Assuming you’ve understood the theory behind malloc (main arena, bins etc), it’s not hard to understand why I did it. It’s known that there is a UAF vulnerability and I abuse that to leak libc’s base address. When a chunk (either small or large chunk) is free’d, it’s placed in a doubly&hellip;", "Shuffled Love (you need to register) was one of the Linux 64bits reverse challenges available to be solved during the recent 0x00Sec CTF Winter 2017 edition. This challenge was intended to be easy and at the end 42 persons were able to solve it. Before continuing, I’d like to say that there are man&hellip;", "VVid0w?! Do you want to write some malware? Come on lets go and hack I never see you anymore Come on IRC It’s like you switched to slack! We used to be so 1337 And now we’re not I wish you would step it up Do you want to write some malware? It doesn’t have to be some malware… Sirens blare&hellip;", "VVid0w?! Do you want to write some malware? Come on lets go and hack I never see you anymore Come on IRC It’s like you switched to slack! We used to be so 1337 And now we’re not I wish you would step it up Do you want to write some malware? It doesn’t have to be some malware… Sirens blare&hellip;", "I want to see some write-ups, i am still learning in the area of reversing and love reading write-ups about ctf’s", "Hey y’all, I’ve recently stumbled onto securitytube.net’s MegaPrimer series. These videos are actually incredible introductions to a wide variety of security topics. What I’ve chosen to focus on is the Exploit Development series and since i’m in a bit of a lul at work I’ve decided to go through a&hellip;", "Bonus Incentive, I have extra 0x00sec buttons to hand out. (Still tryna find the sticker option though)", "Yesssss!!! Stack Canaries pleaseeee!!!", "Yesssss!!! Stack Canaries pleaseeee!!!", "Yesssss!!! Stack Canaries pleaseeee!!!", "Yesssss!!! Stack Canaries pleaseeee!!!", "PrefaceWelcome to a new series about GNU/Linux exploit mitigation techniques. We always had these awesome pwn and how2exploit articles. I wanna shift the focus to the bypassed techniques to create a series about  currently deployed approaches. Afterwards I’d like to focus on their limitations wi&hellip;", "Slightly off-topic. But couldn’t resist  Remember kids: If something doesn’t work with the tools provided, built your own. keeps your scripting/programming  knowledge up2dateimplants used knowledge even deepercoolness factor+1Just fits perfectly after reading through PoC||GTFO right now and &hellip;", "Bonus Incentive, I have extra 0x00sec buttons to hand out. (Still tryna find the sticker option though)", "Hey you all ! Since my last post here about the GonnaCry ransomware got unlisted, i’ve returned today to share the knowledge I acquire since may, developing this linux ransomware. Motivations Since the world wide spread of the wannacry ransomware in may 2017 affected so much countries and compani&hellip;", "Bonus Incentive, I have extra 0x00sec buttons to hand out. (Still tryna find the sticker option though)", "Bonus Incentive, I have extra 0x00sec buttons to hand out. (Still tryna find the sticker option though)", "Bonus Incentive, I have extra 0x00sec buttons to hand out. (Still tryna find the sticker option though)", "This isn’t going to be specifically about OpenBSD, because without taking Linux in comparison, you’ll miss details on how things have turned out to be. I have been spending some time lately following what the situation is on the BSD front and in the Linux community, and I apologise in advance if I h&hellip;", "Unfortunately not off the top of my head, most of my knowledge is fairly basic. Which is why I’m looking forward to future publications from your account!", "I hope so! I want to write about hooking other places besides the system call table, but I need to find/make a small instruction-length decoder for x86_64 in c first. If you know of any, let me know!", "I was already familiar with the basic concepts of the article so I didn’t have to reread sections as often as I normally would have.", "@Sirius how did you read that so fast!?!?!", "This was an incredible write-up, any plans for related material in the future?", "I have always wanted to dive a bit deeper into how to linux kernel internals work. To do this I figured a good starting point would be to create a small proof of concept rootkit! You can find the code for the rootkit on github https://github.com/jordan9001/superhide. This is a very simple rootkit. &hellip;", "All the challenges here are essentially no different than the challenges on official pwnable sites. Checkout MBE by RPISEC for a full course on Binary Exploitation. Once you’re done with that and you’re feeling hardcore, move on to the mighty pwnable.tw. There are multiple resources on pwnable exer&hellip;", "The amount of network enabled printers I find during engagements is astounding. Excellent write-up, will definitely be coming back to this one for some lulz.", "I changed my mind. Instead here’s a photo of Joanna’s computer and how she uses Qubes and VMs to secure her passwords and private keys. Each box is a VM and the arrows are how they’re connected.  [image] As you can see in the blackbox, it is a VM, not connected to anything, and it holds her priva&hellip;", "Why on Earth would it still use 3DES!?!?!", "Post-it notes, stuck to the frame of my computer’s monitor. I don’t see why this thread is even a thing. /thread", "Bay Area MeetupIf you will be around the Best Coast during the CTF, a few of us will be getting together to meetup and work on challenges. Will be a great way to meet other community members. If anyone wants to make stickers or something fun, that would be coooooooooooooooooooool.", "This is my definition as well, but so many other software providers package shit in their executable. Does SE someone to install stuff relieve the software from being defined as malware? The greatest shitware provided of all time.", "What about malware that is not harmful to a user, but is also not installed by the intent of the user? Yeah I think we call that, Microsoft Windows, aka bloatware.", "What about malware that is not harmful to a user, but is also not installed by the intent of the user? Yeah I think we call that, Microsoft Windows, aka bloatware.", "What about malware that is not harmful to a user, but is also not installed by the intent of the user? Yeah I think we call that, Microsoft Windows, aka bloatware.", "What about malware that is not harmful to a user, but is also not installed by the intent of the user? Yeah I think we call that, Microsoft Windows, aka bloatware.", "November 19th, 2017 - December 19th, 2017Projects (There may be more later!) a. ELF Injection b. PE Injection c. Ransomware on Android - Running into a few issues with one, but am working through it. d. Root-me.org challenges e. Setup Tor Relay f. Blind ROPI will be doing a writeup on the &hellip;", "November 19 - December 19Projects:Reverse pebble watch API with SDRFinish setting up a firejail install for a automated testing server (Sandboxing)Worms and Viruses lectureI am going to try and create a write-up for my process on reversing the API (This is a final project for a class so I &hellip;", "The amount of network enabled printers I find during engagements is astounding. Excellent write-up, will definitely be coming back to this one for some lulz.", "This is the same day the new Star Wars film comes out. D:", "[image]Your downwards is a very strange direction. Or maybe it’s because I live in the southern hemisphere?  Yeah I respect whatever convention you wanna follow, just trying to lure unwary users out there to believe in my God!", "Pretty exited about the CTF since the first time I heard about it on irc! Can’t wait!", "The contents and ideas within this essay are my own and do not reflect the views of this site or my employer… ** Edits may take place for grammatical issues or lines missed  due to author’s learning disability, but any factual issues that are ever deleted will be noted at the bottom of textAtari&hellip;", "So… it’s a script to spin up a rogue AP? How is this different from wiphisher or wifi pineapple infusions?", "There’s a ton of ways, i think the easiest is opening up the dev console in your browser of choice and then just use copy and paste, but you could also use an intercept proxy to catch things on the fly (My Preferred Method). Additionally there exist browser plugins you can use to manage cookies way &hellip;", "Selenium doesn’t let you manipulate your cookies? Disclaimer: Idk anything about selenium. I just know cookies exist.", "Yes, remove them. Make categorizing great again.", "actually i have added some options that will makes you have more control of your AP … and this is the beta version i’m not done with it … many options are coming very soon … i’m working so hard to make it different", "So… it’s a script to spin up a rogue AP? How is this different from wiphisher or wifi pineapple infusions?", "I think this is the correct place to post this. If not, please let me know where one should post articles related to topics such as this. MalwareUnicorn recently released her analysis on BadRabbit. I found it very thorough and wanted to share it with you all. Mitigating BadRabbit “By placing any&hellip;", "I believe the common amount to mix at any one time is just under 10K USD, for legacy reasons. ;] Overall, this was an incredible article! I NEED MOAR!!!", "I believe the common amount to mix at any one time is just under 10K USD, for legacy reasons. ;] Overall, this was an incredible article! I NEED MOAR!!!", "I believe the common amount to mix at any one time is just under 10K USD, for legacy reasons. ;] Overall, this was an incredible article! I NEED MOAR!!!", "How to Anonymize your CryptoCurrencies and CryptoAssetsRequired SkillsList of previous knowledge required to understand the paper. Contents that will not be explained and without knowing them it will be very difficult to follow the paper content. Familiarity with VMs, Tor, and VPNsOwn cryptocur&hellip;", "Boy, people who aren’t in IRC are gonna think you’re schitzo after reading this. Everyone else: We’re talking about this in IRC. Sorry if you miss context but this discussion is rapidly evolving.", "Hello nullers, Retr1 here. I have a suggestion today for the admins (@pry0cc, @oaktree, @IoTh1nkN0t, @_py, @fraq). Thread closingAs a matter of fact, our staff team has decided to discourage necrobumping. And rightfully so, don’t get me wrong. However, I believe that closing the specific thread is&hellip;", "Also, he needs to use this picture to illustrate a very bad rabbit…  [image]", "Also, he needs to use this picture to illustrate a very bad rabbit…  [image]", "Also, he needs to use this picture to illustrate a very bad rabbit…  [image]", "Way to go buddy. Next time I’m consulting you for the graphics.", "Way to go buddy. Next time I’m consulting you for the graphics.", "Also, he needs to use this picture to illustrate a very bad rabbit…  [image]", "Especially considering this particular VM is FILLED with holes. ;3", "Especially considering this particular VM is FILLED with holes. ;3", "Live life on hard mode. That’s not my motto, but I imagine someone says it. Imagine I’m that person.", "VVid0w?! Do you want to write some malware? Come on lets go and hack I never see you anymore Come on IRC It’s like you switched to slack! We used to be so 1337 And now we’re not I wish you would step it up Do you want to write some malware? It doesn’t have to be some malware… Sirens blare&hellip;", "Hello folks! I hope you’re all doing great! Today’s topic is by far my most favorite heap exploitation technique I’ve ever dealt with until now (as far as Linux is concerned). I can’t stress enough how much I love this technique. It’s super smart, technical, and even though malloc has been hardened &hellip;", "NULL Pointer dereferenceIn the name of Allah, the most beneficent, the most merciful. Hello everyone to a boring article once again. I’ve found a bit of freetime, so i decided to write this article, it isn’t really well done, but i hope you guys like it and learn much !Kernel Exploitation ?&hellip;", "Clickbait title, came here looking for py’s actual dream diary, all i got was a pwnable binary. 10/10 would get trolled again.", "@Suser tasked me with helping him pwn the way to your heart. I need those intimate details.", "@Suser tasked me with helping him pwn the way to your heart. I need those intimate details.", "Clickbait title, came here looking for py’s actual dream diary, all i got was a pwnable binary. 10/10 would get trolled again.", "Tags: binarychallengepwningexploitationlinux", "Clickbait title, came here looking for py’s actual dream diary, all i got was a pwnable binary. 10/10 would get trolled again.", "You have a lot of time to develop yourself. Definitely join any tech-related clubs/orgs at your school. Edit: This’ll help you network and give you a chance to learn from others; maybe you’ll even discover a few things you didn’t know about.", "So we all want it, a server type coinhive miner that doesnt need a browser and to do this we need to figure out how to create our own copy of its networking and hashing protocols, So i have taken the liberty to format the miner script as best i can as well as start finding where the hell the socket &hellip;", "Oh man, loaded question. Quick answer? Step 1. Make a blog, youtube channel, website, whatever. You NEED something to show that your passionate about what you do and CAN do it, you don’t even have to be good at it, just decent. Step2. Network, network, NETWORK!!! You HAVE to go to event&hellip;", "Oh man, loaded question. Quick answer? Step 1. Make a blog, youtube channel, website, whatever. You NEED something to show that your passionate about what you do and CAN do it, you don’t even have to be good at it, just decent. Step2. Network, network, NETWORK!!! You HAVE to go to event&hellip;", "I’ve made something like this: But it’s pretty normie, &#39;cause it works with the “Coinhive Documentation”. Nice work", "Tic-Tac-Go! A Tic-Tac-Toe solver in GolangI’ve seen quite a bit of community interest in learning Go but not a lot of material around it. As an exercise for myself, I started writing a Tic-Tac-Toe solver in Golang to get the hang of the language. In the following series, I will share with you thing&hellip;", "Finally something I can do to help the community instead of just lurking all the time. Great idea!", "I’ll be honest: I heard about you only because of a friend interested in ITSec, but the idea of helping so easily by mining is so humble, yet simple that I could not resist to urge to turn it on and mine some. And meanwhile I found some interesting stuff to read among your all-time top posts, so I &hellip;", "So recently I’ve been re-motivated to do some more game hacking and I thought that I’d do another article to introduce more aspects on top of what I’ve already shown from my previous ones. In the following document, I’ll be detailing the usage of DLL injection and its advantages, a fundamental conce&hellip;", "Some weeks ago I found [this interesting article] (https://blog.gdssecurity.com/labs/2017/9/5/linux-based-inter-process-code-injection-without-ptrace2.html), about injecting code in running processes without using ptrace. The article is very interesting and I recommend you to read it, but what caugh&hellip;", "I’m not gunna lie, this might be the best quality post we’ve had on 0x00sec to date. Very well done @Leeky", "I’m not gunna lie, this might be the best quality post we’ve had on 0x00sec to date. Very well done @Leeky", "I’m not gunna lie, this might be the best quality post we’ve had on 0x00sec to date. Very well done @Leeky", "I’m not gunna lie, this might be the best quality post we’ve had on 0x00sec to date. Very well done @Leeky", "Realmode Assembly - Writing bootable stuffPart 5: Graphic ModeWhat is this?This is going to be a walk-through in writing  Operation Systems in assembly which operate purely in Realmode. Goal will be writing different kernels from a simple “Hello World” over small terminal programs to graphical&hellip;", "O.O Oo-ooo jeez rick, I dont know, I’ve collected a lot more bookmarks since then.", "The amount of network enabled printers I find during engagements is astounding. Excellent write-up, will definitely be coming back to this one for some lulz.", "I only half understand this, but I wish I could like it twice.", "Woops, I messed up the markdown format that’s why  It’s now fixed! All of you please do check out the resources I mentioned. I don’t want to take their glory. The folks did an amazing job! Much appreciated man!", "The link in the following paragraph is broken: In other words, libc keeps track of the allocated chunks by storing their pointers in an array according to their sizes. In reality, each entry is a single / double-linked list which holds a pointer to a different size of chunk. Meaning, the first ent&hellip;", "The link in the following paragraph is broken: In other words, libc keeps track of the allocated chunks by storing their pointers in an array according to their sizes. In reality, each entry is a single / double-linked list which holds a pointer to a different size of chunk. Meaning, the first ent&hellip;", "Woops, I messed up the markdown format that’s why  It’s now fixed! All of you please do check out the resources I mentioned. I don’t want to take their glory. The folks did an amazing job! Much appreciated man!", "The link in the following paragraph is broken: In other words, libc keeps track of the allocated chunks by storing their pointers in an array according to their sizes. In reality, each entry is a single / double-linked list which holds a pointer to a different size of chunk. Meaning, the first ent&hellip;", "Sup folks! I hope you are all doing great. It’s been a long time since my last CTF write-up. The main reason is because I was trying to master the beast called heap exploitation and I’ve yet to learn a ton about it. To showcase one of the modern ways to pwn a heap-based vulnerable binary, I’ll use a&hellip;", "Was trying to avoid this: “Extremely brief posts (with little context or explanation). If you find a resource that you want to share, please post more than just “Found this. [LINK].””", "You wouldn’t get banned for a short post (read: short, but on-topic).", "Oh, is that all we need to avoid the banhammer? xD", "Oh, is that all we need to avoid the banhammer? xD", "Good call… that’s why I included a TL;DR…", "Was trying to avoid this: “Extremely brief posts (with little context or explanation). If you find a resource that you want to share, please post more than just “Found this. [LINK].””", "@Sirius mentioned this in IRC but doesn’t want to post it himself. TL;DW: this is a vuln that allows an attacker to spread malware across devices, so long as they have Bluetooth enabled, without even formally pairing. Here’s a paper about it: http://go.armis.com/hubfs/BlueBorne%20Technical%20Whit&hellip;", "0x00sec GuidelinesCore PrinciplesActions have consequences.You can learn anything from anyone.Ask good questions, not lazy ones.Everybody makes mistakes.Freedom of information is a right.ForumsWhen posting something on the forums, consider these points. Will this be helpful to users othe&hellip;", "The amount of network enabled printers I find during engagements is astounding. Excellent write-up, will definitely be coming back to this one for some lulz.", "Sorry for necroposting, but as the current code didn’t work for me I thought I would add how I fixed it, in case anybody else comes here after me. The payload, although running and passing flow over to _main, made the kernel segfault. The reason being that the CPU state had been corrupted by the sy&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "True, since nobody cares about them too much (yet). It’s a printer. It prints. That’s it. right ?  You’re welcome and thanks a lot!", "The amount of network enabled printers I find during engagements is astounding. Excellent write-up, will definitely be coming back to this one for some lulz.", "The amount of network enabled printers I find during engagements is astounding. Excellent write-up, will definitely be coming back to this one for some lulz.", "I’ll have to dig up the documents on it, but they definitely have techniques for doing it (running as much as 60% of the exits nodes in the world at one time also helped). Also, I feel like WackSec Radio did an episode on this very subject at one point", "Greetings, 0x00sec! After much discussion, the 0x00sec mods and admins have put together a new program, a Bounty Program. How it WorksThis very post will be a Wiki. Members will be able to add any topic they’d like to see written about on this site. Other members will see the wiki, scroll through,&hellip;", "Greetings, 0x00sec! After much discussion, the 0x00sec mods and admins have put together a new program, a Bounty Program. How it WorksThis very post will be a Wiki. Members will be able to add any topic they’d like to see written about on this site. Other members will see the wiki, scroll through,&hellip;", "@fraq has dropped a bunch of concepts here that may be confusing for people not familiar with communications systems. So I will try, with @fraq’s permission, to expand a bit further. Sure. I like these topics  As @fraq said, that elephant thingy is related to mechanical waves, like sound, not elect&hellip;", "Be still, my heart, for I have found another waterwalker in the wild. It’s not often I get to talk about signal sampling, multiplexing, digital/analog encoding, or wave propagation with people. It’s a niche subject.", "It is usually a client side problem, and a result of enabling JavaScript. If you use an up-to date tor browser bundle, use it in a confined space with no other devices, had the FBI only compromised the hidden service, and you’d disabled JavaScript, I would think it’s very very difficult to de-anonym&hellip;", "It’s a long-held belief, although not 100% verified, that the NSA has developed a technique for de-anonymyzing traffic being routed through tor. In more recent times, independent researchers have been able to reproduce similar vulnerabilities.", "It’s a long-held belief, although not 100% verified, that the NSA has developed a technique for de-anonymyzing traffic being routed through tor. In more recent times, independent researchers have been able to reproduce similar vulnerabilities.", "Well, a few things     Maybe I’m a bloody asshole, dickhead or whatever but, …, honestly, I think that using a cloud based solution like discord go against the principle of privacy. I really hope that the IRC will NEVER be shutdowned. Cya on IRC. Best, Nitrax", "I’m going to chime in on this. For those of you who don’t know me,  I’m L0k1, I run our IRC,  and our Gitlab,  as well as a few other things. I may not be around all the time,  but I’m constantly maintaining stuff.  Before the talks about switching to Discord,  before we had our own IRC,  we were &hellip;", "For a few weeks now we have been watching the production of https://wacksec.com get better and better. We have seen multiple community members work hard into making this show great as well as informing the community and ordinary people of news and topics in infosec. Over the past few weeks, we have&hellip;", "It’s important to note that if you go to http://0t5.net/images/feed.php you get the FULL collection of indexes put together by these mysterious entities.", "As @pry0cc insisted that I create a post on how I manually signed a apk file in my post. As requested, here it is. Although please see this link here which is the reference that I used for my so called 1337 hax. Before I begin, what you’ll need is: MetasploitMsfvenomPayloadkeytooljarsignerA b&hellip;", "It’s important to note that if you go to http://0t5.net/images/feed.php you get the FULL collection of indexes put together by these mysterious entities.", "It’s important to note that if you go to http://0t5.net/images/feed.php you get the FULL collection of indexes put together by these mysterious entities.", "Just spin up a VM or Docker image real quick and go ham.", "Just spin up a VM or Docker image real quick and go ham.", "Ha ha holy crap its been so long since I’ve seen this repo, probably around early 2014. It used to be SWAMPED with viruses(not in a good way), so I would sandbox and check any programs that this repo has before running them. Although, I’m sure most of you would have done that without me saying a thi&hellip;", "Maybe make a resources category to throw this into? But yeah this repo is the shit. &lt;3", "[image]", "I’d like to offer an Edit. PWK (Which gets you your OSCP) Is more of an intro to pentesting course. While there is one chapter on Exploit Development, it’s not meant to be the main focus of the course. The course that get’s you your OSCE, on the other hand, is the course that actively focuses on E&hellip;", "Reverse Engineering and Crackme challengesThis topic is an aggregation of Crackme and reverse engineering challenges developed for 0x00sec. Please discuss the challenges in the thread they were originally posted or on IRC in #challenges This curation is based entirely on my own whim and not a comp&hellip;", "This place is so awesome. I was like, “hey, let’s google how to do that” and the VERY FIRST LINK was an 0x00sec tutorial. You guys rock. Edit (by oaktree):", "Hi all! A friend was entering a CTF he suspected was “king of the hill” style, which would require him to set and maintain control over a flag file, so he requested some techniques or ideas from me. I gave him a couple of other ideas, but this tool was the one of the products of that discussion. I&hellip;", "VVid0w?! Do you want to write some malware? Come on lets go and hack I never see you anymore Come on IRC It’s like you switched to slack! We used to be so 1337 And now we’re not I wish you would step it up Do you want to write some malware? It doesn’t have to be some malware… Sirens blare&hellip;", "Sigreturn Oriented ProgrammingIn the name of Allah, the most beneficent, the most merciful. Hello everyone to a new boring article, after we took a small look on normal ROP stuff, I decided to write something more fun !@_py is the one that started that idea! for learning purposes …I hope yo&hellip;", "O.O Oo-ooo jeez rick, I dont know, I’ve collected a lot more bookmarks since then.", "@Sirius Do it! Its almost weekend anyway you wouldn’t have anything better to do anyway right…?", "O.O Oo-ooo jeez rick, I dont know, I’ve collected a lot more bookmarks since then.", "summoning the mighty @Sirius to copy &amp; paste his post from here nicely formatted to this wiki  Big Edit: ____ YOU CAN ADD YOUR OWN STUFF TO THAT LIST. IT’S FREE TO EDIT FOR EVERYONE. SO DON’T COMMENT, JUST ADD IT AS ALWAYS KEEP IT CLEAN AND CLASSY! THANK YOU FOR YOUR ATTENTION  ____", "Fwiw, I also heard TIS-100 is also a pretty solid game to pick up on assembly. Currently 6 bucks on steam iirc.", "Nice post @ricksanchez ! This is my proposal for section 6 (What’s next) #6. Chuck Norris’ way Chuck Norris is not a hacker but he pwns any computer just walking close to it Chuck Norris writes his own reverse shells directly in machine code and types it in hex by heartChuck Norris writes IPs &hellip;", "Nope. We need 3 + a DM, so we’re missing one player.", "Did we finally set an initial start date?", "Interesting, Just took a look at it, so far so easy lol. The login box is a piece of cake. Perhaps you should check how it verify’s the codes", "dude how many times do I have to fucking say it!? I’M JUST A STANDARD USER", "That one is pretty amazing too. I used it for the OSCP labs a couple times.", "g0tmi1k’s blog is dope, for window’s privesc I usually use this as reference. http://www.fuzzysecurity.com/tutorials/16.html", "g0tmi1k’s blog is dope, for window’s privesc I usually use this as reference. http://www.fuzzysecurity.com/tutorials/16.html", "VVid0w?! Do you want to write some malware? Come on lets go and hack I never see you anymore Come on IRC It’s like you switched to slack! We used to be so 1337 And now we’re not I wish you would step it up Do you want to write some malware? It doesn’t have to be some malware… Sirens blare&hellip;", "VVid0w?! Do you want to write some malware? Come on lets go and hack I never see you anymore Come on IRC It’s like you switched to slack! We used to be so 1337 And now we’re not I wish you would step it up Do you want to write some malware? It doesn’t have to be some malware… Sirens blare&hellip;", "Holy shit, it’s glorious. We need to make a complete remix and have someone sing it. Like, this legitamately needs to be a thing. Hell, why not make a music video too?", "VVid0w?! Do you want to write some malware? Come on lets go and hack I never see you anymore Come on IRC It’s like you switched to slack! We used to be so 1337 And now we’re not I wish you would step it up Do you want to write some malware? It doesn’t have to be some malware… Sirens blare&hellip;", "VVid0w?! Do you want to write some malware? Come on lets go and hack I never see you anymore Come on IRC It’s like you switched to slack! We used to be so 1337 And now we’re not I wish you would step it up Do you want to write some malware? It doesn’t have to be some malware… Sirens blare&hellip;", "VVid0w?! Do you want to write some malware? Come on lets go and hack I never see you anymore Come on IRC It’s like you switched to slack! We used to be so 1337 And now we’re not I wish you would step it up Do you want to write some malware? It doesn’t have to be some malware… Sirens blare&hellip;", "VVid0w?! Do you want to write some malware? Come on lets go and hack I never see you anymore Come on IRC It’s like you switched to slack! We used to be so 1337 And now we’re not I wish you would step it up Do you want to write some malware? It doesn’t have to be some malware… Sirens blare&hellip;", "For the covering your tracks section, might want to add a blurb about learning DFIR techniques so that you can do anti-forensics on your hacks. Sure, deleting a few logs goes a long way when your up against the average sysadmin, but if it’s a larger organization that can pay for DFIR ppl to come in,&hellip;", "Breaking and Entering is also not legal everywhere. xD I’m assuming you get a voucher from the company hiring your services before you go on an engagement? I know I always bring a “Get out of jail free card” everytime (I did this once…) i go on a red team engagement. How do you go about dealing wi&hellip;", "For the covering your tracks section, might want to add a blurb about learning DFIR techniques so that you can do anti-forensics on your hacks. Sure, deleting a few logs goes a long way when your up against the average sysadmin, but if it’s a larger organization that can pay for DFIR ppl to come in,&hellip;", "Ayy, of course I don’t mind at all! Feel free to share  @Sirius Yea, I honestly thought about adding that in there, but I kinda felt as though it was out of the scope of the article and like you said, should go in a post all their own.", "For the covering your tracks section, might want to add a blurb about learning DFIR techniques so that you can do anti-forensics on your hacks. Sure, deleting a few logs goes a long way when your up against the average sysadmin, but if it’s a larger organization that can pay for DFIR ppl to come in,&hellip;", "For the covering your tracks section, might want to add a blurb about learning DFIR techniques so that you can do anti-forensics on your hacks. Sure, deleting a few logs goes a long way when your up against the average sysadmin, but if it’s a larger organization that can pay for DFIR ppl to come in,&hellip;", "We always have a “get out of jail free card” when we’re doing physical security assessments or red team engagements. If the cops are called, you need to have evidence that you are doing this legally. If the client doesn’t own the entire facility, we’ll coordinate with the building management when &hellip;", "Breaking and Entering is also not legal everywhere. xD I’m assuming you get a voucher from the company hiring your services before you go on an engagement? I know I always bring a “Get out of jail free card” everytime (I did this once…) i go on a red team engagement. How do you go about dealing wi&hellip;", "I nominate @Suser for teh lulz.", "I nominate @Suser for teh lulz.", "I nominate @Suser for teh lulz.", "The thing that works for me on the phone, and might help you, is that you can hang up at any time. I can quit if it goes wrong. In person that can be much more difficult to eject.", "Oh! This is also probably good for those of us computer people than can be really awkward! &lt;---- me", "I’d like to offer an Edit. PWK (Which gets you your OSCP) Is more of an intro to pentesting course. While there is one chapter on Exploit Development, it’s not meant to be the main focus of the course. The course that get’s you your OSCE, on the other hand, is the course that actively focuses on E&hellip;", "That depends entirely on what you are trying to do. The OSCP and OSCE are just certs, all it’s gunna do at the end of the day is help you get a job; but both are really excellent courses if you can afford it. Of course, all of the information in those courses are also scattered about the web, and m&hellip;", "That depends entirely on what you are trying to do. The OSCP and OSCE are just certs, all it’s gunna do at the end of the day is help you get a job; but both are really excellent courses if you can afford it. Of course, all of the information in those courses are also scattered about the web, and m&hellip;", "Since they all cost a bank, are there any qualifications that mean something, but at the same time don’t burn your wallet?", "I’d like to offer an Edit. PWK (Which gets you your OSCP) Is more of an intro to pentesting course. While there is one chapter on Exploit Development, it’s not meant to be the main focus of the course. The course that get’s you your OSCE, on the other hand, is the course that actively focuses on E&hellip;", "That’s what I figured, I’m not super nervous about it, I just really don’t want to write the report. xD I’m still trying to write up my lab and course exercise report because I was a total shithead about taking screenies and documenting stuff so it’s taking ages.", "Right on! The exam wasn’t as hard as I thought it would be. Like the machines aren’t technically that hard, but its the time constraint that’s the real problem. You won’t see anything akin to BOB or sufferance or anything.", "Oh yeah man, I take my exam for the OSCP on saturday. It’s an incredible course, I liked it so much that I plan on taking more OffSec courses in the future.", "I’d like to offer an Edit. PWK (Which gets you your OSCP) Is more of an intro to pentesting course. While there is one chapter on Exploit Development, it’s not meant to be the main focus of the course. The course that get’s you your OSCE, on the other hand, is the course that actively focuses on E&hellip;", "Good point. Ill throw that in there. Yeah the courses are pretty expensive. I found PWK worth it though.", "I’d like to offer an Edit. PWK (Which gets you your OSCP) Is more of an intro to pentesting course. While there is one chapter on Exploit Development, it’s not meant to be the main focus of the course. The course that get’s you your OSCE, on the other hand, is the course that actively focuses on E&hellip;", "Found in a Parisian sushi restaurant and presented without comment. https://imgur.com/q6n2apj (Upload too big. =[ )", "Found in a Parisian sushi restaurant and presented without comment. https://imgur.com/q6n2apj (Upload too big. =[ )", "Found in a Parisian sushi restaurant and presented without comment. https://imgur.com/q6n2apj (Upload too big. =[ )", "Well, I was able to do simple recon and login to the router from my phone. So really all it did was serve as a welcome mat…", "Found in a Parisian sushi restaurant and presented without comment. https://imgur.com/q6n2apj (Upload too big. =[ )", "Found in a Parisian sushi restaurant and presented without comment. https://imgur.com/q6n2apj (Upload too big. =[ )", "Found in a Parisian sushi restaurant and presented without comment. https://imgur.com/q6n2apj (Upload too big. =[ )", "Found in a Parisian sushi restaurant and presented without comment. https://imgur.com/q6n2apj (Upload too big. =[ )", "Looks top neat. How’d you find out about it? Came across while googling for carrot images?", "Get ready for this…  [image](This is a part joke xD)", "[image]", "[image]", "Another one on me.  [image]@Sirius", "Another one on me.  [image]@Sirius", "Well, hope I dont get arrested. I watched a youtube video of a tiger killing a zebra. I mean I could have stopped the tiger but I just enjoyed the clip which makes me an accomplice to the tiger. Am sorry guys.", "Dual booting is an alternative to all of those.", "Don’t you think I knew that already?", "LOL!!! The Agora (Asides from the obvious historical reference) is the name of a darknet marketplace that was one of the many replacements for the silk road.", "LOL!!! The Agora (Asides from the obvious historical reference) is the name of a darknet marketplace that was one of the many replacements for the silk road.", "Hey pry0cc, L0k1/Sstrykerr here. Long story short is I got into an accident, and got messed up pretty bad, I’m almost back to normal now, which means I&quot;ll be active once again with Mia and Wulfbut. Anywho, on to my point. How much do you need for a GitLab server? I’m sure I can cover the costs for &hellip;", "Nvm, i lied. I just realized all i did was screenshot the pdf and uploaded it as a jpeg. Woops.", "Just a heads up, you can embed your PDF in your post so that nobody has to open anything.", "Nvm, i lied. I just realized all i did was screenshot the pdf and uploaded it as a jpeg. Woops.", "Are you sirius (pun intended)? How so?", "Just a heads up, you can embed your PDF in your post so that nobody has to open anything.", "Hey y’all, I’ve recently stumbled onto securitytube.net’s MegaPrimer series. These videos are actually incredible introductions to a wide variety of security topics. What I’ve chosen to focus on is the Exploit Development series and since i’m in a bit of a lul at work I’ve decided to go through a&hellip;", "First off, for Devs (@oaktree, @unh0lys0da, @pry0cc): Can we get a category for Exploits/Exploit Development? Now, main topic, Exploit Development. BACKGROUND: If you have ever run a vulnerability scan on an application or network, you’ll notice that some scanners will also accompany the vulnerabi&hellip;", "Hey y’all, I’ve recently stumbled onto securitytube.net’s MegaPrimer series. These videos are actually incredible introductions to a wide variety of security topics. What I’ve chosen to focus on is the Exploit Development series and since i’m in a bit of a lul at work I’ve decided to go through a&hellip;", "Hey y’all, I’ve recently stumbled onto securitytube.net’s MegaPrimer series. These videos are actually incredible introductions to a wide variety of security topics. What I’ve chosen to focus on is the Exploit Development series and since i’m in a bit of a lul at work I’ve decided to go through a&hellip;", "Hey y’all, I’ve recently stumbled onto securitytube.net’s MegaPrimer series. These videos are actually incredible introductions to a wide variety of security topics. What I’ve chosen to focus on is the Exploit Development series and since i’m in a bit of a lul at work I’ve decided to go through a&hellip;", "[TRANSLATION] [TITLE]  Question: Getting PHP Warning Error [BODY] Hi, So I have an eCommerce site (www.arganizylar.com) that i’m working on and i’m having an issue where users are unable to order anything. We keep getting the error: “TECHNICAL ERROR: unable to save account Details: Error throw&hellip;", "Hey y’all, I’ve recently stumbled onto securitytube.net’s MegaPrimer series. These videos are actually incredible introductions to a wide variety of security topics. What I’ve chosen to focus on is the Exploit Development series and since i’m in a bit of a lul at work I’ve decided to go through a&hellip;", "thanks bro will post thiss allot better", "[TRANSLATION] [TITLE]  Question: Getting PHP Warning Error [BODY] Hi, So I have an eCommerce site (www.arganizylar.com) that i’m working on and i’m having an issue where users are unable to order anything. We keep getting the error: “TECHNICAL ERROR: unable to save account Details: Error throw&hellip;", "[TRANSLATION] [TITLE]  Question: Getting PHP Warning Error [BODY] Hi, So I have an eCommerce site (www.arganizylar.com) that i’m working on and i’m having an issue where users are unable to order anything. We keep getting the error: “TECHNICAL ERROR: unable to save account Details: Error throw&hellip;", "Nmap is literally one of my favorite tools ever.", "That’s true, but Jerry would. I forgot to mention that in this crazy universe, Jerry is Rick’s son.", "&gt;.&gt; There’s no way rick would fall for such a thing… Git rickity rickity wrecked son! But otherwise this was beautiful. I want moar!", "I might even check the site more frequently if there were lulz to be had. &gt;.&gt;", "Welp: thanks @unh0lys0da and @pry0cc for your love and support. Don’t worry: I got irssi now.", "Ye, wtf m8, r u fkin kiddin me, irssi fkin rocks m8 8/8 no h8", "IntroductionHello to all of the Hackers ! I’m back for a new Tutorial. I’m sorry for the long delays of this tutorial to come. But let’s get started ! What is a Honey pot ?Before we start to delve into the Tutorial here some informations about what is Honeypot Honey Pot Systems are decoy serv&hellip;", "Team name: NeedCashForPizza Team Members as of now: @pry0cc@oaktree", "You know what to do :333", "Oh, Hey! I know Web App Sec! XD", "Oh, Hey! I know Web App Sec! XD", "Nmap is literally one of my favorite tools ever.", "to stay secure, you dont just need Tor, and a VPN. You need good browsing habits. ** What are Browsing Habits?** Let me tell explain. Its basically how you behave on the internet, what websites you click, your language pattern (how you speak), what websites you are registered to, pretty much any&hellip;", "Nmap is literally one of my favorite tools ever.", "Besides Social Engineering, recon is by far the most important aspect of hacking. Without recon, all the greatest hackers of our time probably wouldn’t be able to hack anything. Besides, just shoving one exploit after another, when there are thousands of exploits in Metasploit alone, is inefficient. &hellip;", "Totally missed that paragraph. XD My bad.", "I covered that right in the beginning: Steganography is the practice of concealing a file, message, image, or video within another file, message, image, or video", "Not just text files, steg can be used in most file formats. It’s most popularly used in picture formats and more famously Elliot Alderson uses it in Mr. Robot to hide his hack data in mislabled CD’s as mp3 data.", "Fwiw, I also heard TIS-100 is also a pretty solid game to pick up on assembly. Currently 6 bucks on steam iirc.", "Very interesting. Looks pretty similar to RedCode (the assembly I mean), so I would say that, from a learning point of view, it would be pretty similar. I like more the concept of having to programs fighting for resources in a computer that solving puzzle approach… But that is a completely person m&hellip;", "Fwiw, I also heard TIS-100 is also a pretty solid game to pick up on assembly. Currently 6 bucks on steam iirc.", "#SOCIAL ENGINEERING - PART 2 - ELICITATION# Elicitation is a conversation where you subtely try to extract information. However, this conversation needs to look casual and innocent. It’s all about asking the right questions. The goal here is to manipulate the behaviour of your target in order to ac&hellip;", "Alternate Title: Picking Up Women: For Hackers.", "LOL, proper he says.", "A proper CVE gives a line number or a function name", "They usually are. XD But yeah I kinda figured this would be the response, I know how to do it all manually, I just wanted something to tell me where to look so i dont have to sift through thousands of lines of code.", "https://0x00sec.org/c/How-to/exploit-development https://0x00sec.org/c/hacking/exploit-development All done!  As for the question, I have no idea. But the easiest way to actually acquire the applications binary, would be to download it from the developers site, or build it from source. Compiled a&hellip;", "First off, for Devs (@oaktree, @unh0lys0da, @pry0cc): Can we get a category for Exploits/Exploit Development? Now, main topic, Exploit Development. BACKGROUND: If you have ever run a vulnerability scan on an application or network, you’ll notice that some scanners will also accompany the vulnerabi&hellip;", "First off, for Devs (@oaktree, @unh0lys0da, @pry0cc): Can we get a category for Exploits/Exploit Development? Now, main topic, Exploit Development. BACKGROUND: If you have ever run a vulnerability scan on an application or network, you’ll notice that some scanners will also accompany the vulnerabi&hellip;", "First off, for Devs (@oaktree, @unh0lys0da, @pry0cc): Can we get a category for Exploits/Exploit Development? Now, main topic, Exploit Development. BACKGROUND: If you have ever run a vulnerability scan on an application or network, you’ll notice that some scanners will also accompany the vulnerabi&hellip;", "First off, for Devs (@oaktree, @unh0lys0da, @pry0cc): Can we get a category for Exploits/Exploit Development? Now, main topic, Exploit Development. BACKGROUND: If you have ever run a vulnerability scan on an application or network, you’ll notice that some scanners will also accompany the vulnerabi&hellip;", "We did it! 100 users!Hello 0x00’ers! A couple of weeks ago, this community started off as a fun new place to teach, learn and discuss Infomation Security, following the swift decline in activity at Nullbyte. Between three humble hackers on the #nullbyte IRC channel; Me, @oaktree and @unh0lys0da wor&hellip;", "I plan to do a tutorial on google dorking", "Uh… what’re you doing with those cookies? I’ve already been fed analytic/tracking cookies and they gave me the fiery poops…", "Uh… what’re you doing with those cookies? I’ve already been fed analytic/tracking cookies and they gave me the fiery poops…", "Ahaha sorryy! It’s for tracking our progress…", "Someone should really do a comprehensive article about google dorking as it is probably one of the more useful things to know when trying to learn.", "Uh… what’re you doing with those cookies? I’ve already been fed analytic/tracking cookies and they gave me the fiery poops…"]}