{"user": "SmartOne", "history": ["Thank you for your outstanding answer! I’m currently attending to a local countrywide infosec competition to benchmark my skills. So far, many of the challenges did have to do with WebApps (I indeed started my journey with WebDev) and I found them very easy. I will definitely follow your advice to&hellip;", "OTW is OccupyTheWeb, a former NullByte member who wrote many good articles(and even had a contract with them). When we split from NullByte(when he got fired), he made a website on his own where he does some posts and sells some certification (trainings?). https://www.hackers-arise.com/", "Introduction to Quantum Computing :: Part #1Hello everyone, I hope you are having a wonderful week, day or month. My name is Thirsty-Robot a wannabe hacker that is not really into hacking. I enjoy it, but what I’m really into is theoretical computer science, and also programming. For the past 2 mo&hellip;", "Welcome Back to Knowing Null!This week, you voted to bring in ricksanchez! Let’s just jump right into it.First, I’d like to thank you for joining this series of course, anytime  If people really feel the urge to get toknow more about me this is the perfect chance! Can you tell me and the read&hellip;", "Hi 0x00ers, While surfing the web, I stumbled upon a blog post which I found to be very helpful for beginners. Be sure to check out this guide if you want to start a successful cybersec career!   Best Regards, SmartOne", "Hi @fxbg, Nice series which surely helps beginners a lot! Just wanted to point out that this passage: if (btnState == HIGH) {    digitalWrite(ledPin, HIGH);  } else {    digitalWrite(ledPin, LOW);  }Can be shortened to: digitalWrite(ledPin, btnState);elitism off", "@SmartOne As far as I know a button is just a button. The button used in the post looks like a push-button or more specifically a momentary push button (because it comes back to the original position when you stop pushing it). This kind of button are usually switches with a spring. When you push i&hellip;", "@SmartOne As far as I know a button is just a button. The button used in the post looks like a push-button or more specifically a momentary push button (because it comes back to the original position when you stop pushing it). This kind of button are usually switches with a spring. When you push i&hellip;", "Way back in the day (about 1902, actually) ranches in rural Texas had a rather ingenious way of calling each other on the telephone: They used their barbed wire. Anyone who has ever played with a POTS (Plain Old Telephone System) phone probably knows that a phone is little more than a 2-wire circui&hellip;", "Or your math homework. Or anything, really. Z3’s rad.  What is Z3?Z3 is an open-source theorem prover by Microsoft (yes, seriously). In layman’s terms, you can give it any mathematically expressable problem and it will tell you if there is a solution for it and what the solution is. It’s not only &hellip;", "The &gt; 400 was only a guess, you’ll have to read the documentation depending on which button you use", "The button used in the tutorial only has 2 states, some buttons (switches I guess) have multiple states, but I’ve never used one on the Arduino, I’ll have to get one and check it out. Also, will this work with the button? (I’m not in the office right now or I’d give it a go) analogRead(0) &gt; 400I&hellip;", "@SmartOne, you’re right, for two state buttons like in this tutorial that would be fine, I’m not sure if it would be okay for buttons with a neutral state.", "Just curious, but what do you mean by buttons with a neutral state(3 states)? If you retrieve the state with analogRead() there, it still should work as in Arduino C HIGH corresponds to a boolean true. E.g. bool btnState = analogRead(0) &gt; 400 &amp;&amp; analogRead(0) &lt; 800;", "@SmartOne, you’re right, for two state buttons like in this tutorial that would be fine, I’m not sure if it would be okay for buttons with a neutral state.", "Hi @fxbg, Nice series which surely helps beginners a lot! Just wanted to point out that this passage: if (btnState == HIGH) {    digitalWrite(ledPin, HIGH);  } else {    digitalWrite(ledPin, LOW);  }Can be shortened to: digitalWrite(ledPin, btnState);elitism off", "My Introduction First, I would like to thank 0x00sec for providing such a great community. I would also like to thank Arrogant Bastard, Sierra Nevada and Deathwish Coffee for providing the sustenance necessary for starting and completing the following series. Not only should you get drunk while com&hellip;", "OSINT 0x02 - LinkedIn is not just for jobsSup 0x00’ers, that’s right, I am back with another banger of an article, ready? If you read my last article on OSINT, you’ll know a little bit on how to find dirt on companies, their assets, and how to do all of that passively. Well now I am going to show &hellip;", "OSINT - Passive Recon and Passive Discovery Of AssetsSup 0x00’ers, to kick this badass series off, I am going to begin with the most important aspect of pentesting. Passive Recon and OSINT. Now, do not let the word ‘passive’ fool you. This is no light recon, you can uncover vast amounts of infomati&hellip;", "Whoa! This might be the longest post/introduction ever on 0x00sec! It gave some very interesting insights and took me about half an hour to read  How did you start to learn infosec? Which resources did you use to learn more about networks? I’m mostly a software guy wanting to get on deeper levels a&hellip;", "IntroSecond write-up here; this is something I just happened upon today while (super) bored at work.  I’m not a math/algorithm nerd by any means, but I did find this pretty fascinating.  This will walk you through what I found and how I moved forward with it. If anyone knows of an official name fo&hellip;", "PrefaceThis quick article will give a short introduction on what fuzzers are, how they work and how to properly setup the afl - american fuzzy lop fuzzer to find flaws in arbitrary projects. Well known alternatives to afl (for the same or other purposes): boofuzz: Network Protocol Fuzzing for Hu&hellip;", "https://www.phishtank.com/phish_search.php?verified=u&amp;active=y (Active Phishing  Urls)http://www.virussign.com/ (Malware Packs) 3.http://vxvault.net/ViriList.php?s=40&amp;m=40 (Malware Sources) 4.http://siri-urz.blogspot.com/  (Malware Blog) 5.http://malc0de.com/database/  (Malware Sources) 6.6.h&hellip;", "Hi there, I don’t really understand the problem, so please elaborate. The VPS has a static ip which you should hardcode in the client. You only connect to the VPS via SSH and run the handler there. Best, SmartOne", "Buy a VPS (via TOR)Get your shell from thereYou &lt;=&gt; TOR &lt;=&gt; VPS &lt;=&gt; Victim", "@BlackSteelCannon Did you try running ngrok without proxychains? Should work if tails automatically routes everything through tor.", "@BlackSteelCannon Did you try running ngrok without proxychains? Should work if tails automatically routes everything through tor.", "As I mentioned, I used a simple python script to check, when I ran it without (torify) , connection was refused. using torify, Script returned IP of tor exit node ( Thus, I think it stops some connections unless torified) Doing the same with ngrok ( i.e:using Torify) , I got the error I mentioned &hellip;", "Recently I moved into a new suburban neighborhood littered with default router access points. One day, I decided I wanted to test my luck and see what I could get by using a simple but very effective Wordlist A few years ago I use to work as a cable installation technician. I’ve noticed most techni&hellip;", "@BlackSteelCannon Did you try running ngrok without proxychains? Should work if tails automatically routes everything through tor.", "DISCLAIMER: Article originally published on immunIT. Hi fellas, Today, I will introduce you a new tool, developed for the sake of my penetration testing activities, named Drupwn which claims to provide a reliable and efficient way to perform enumerations on Drupal web applications. You may thin&hellip;", "It seems I am wrong, I saw it VPN not VPS, sorry", "Hi there, I don’t really understand the problem, so please elaborate. The VPS has a static ip which you should hardcode in the client. You only connect to the VPS via SSH and run the handler there. Best, SmartOne", "Hi there, I don’t really understand the problem, so please elaborate. The VPS has a static ip which you should hardcode in the client. You only connect to the VPS via SSH and run the handler there. Best, SmartOne", "This solves my problem by makes another one  I mean , both Ngrok ( paid plan ) and Tor hidden service provide me a static ip that I can hard-code it in my backdoor to the victim. Your solution requires the backdoor the get the ip I am working now on every time my server disconnects, which is not p&hellip;", "Hello all, Nestor10 here to share a couple things I’ve learned in my day job as an infosec samurai. If you want to know some vague things about me, you can check out my introduction. So a few months ago, I noticed some emails coming in with really sketchy attachments - a few dozen had been delivere&hellip;", "Buy a VPS (via TOR)Get your shell from thereYou &lt;=&gt; TOR &lt;=&gt; VPS &lt;=&gt; Victim", "Of course we assume this is just for educational purposes  Do you intend to make your Ransomware easily beeing “broken”? You can easily decompile C# back to IL code, so malware analysis should not be hard. If you store the decryption key on the client and only “check” the password on the client, the&hellip;", "Great article! However, be sure to leave a space before the commands in order to make sure that they aren’t saved to the (bash) history", "This post is part two of a multi-part series. If you haven’t already, please read part one here: Encrypted Chat: Part I Welcome BackAfter gaining an understanding of the concepts behind my encrypted chat server, we’re now ready to take a closer look at the code to see how the client and server ope&hellip;", "Hello, fellow 0x00’ers! First off, I lied. It’s not a botnet. But it enables you to achieve botnet-like abilities. Today I am going to show you something that has been kept a secret for a long time in the hacker community and has never really been made accessible to the average hobbyist. With this&hellip;", "The ProjectI started programming an encrypted chat client and server to learn more about encryption and how it’s implemented in network protocols (e.g. SSH or HTTPs over TLS). Now that it’s almost complete, I wanted to share what I learned with you. I’m splitting up this series into two posts. The&hellip;", "Thanks for the reply and here you go.", "I would be happy to help, but I need the values of paramString1 and paramString2(method call) Unfortunately the APK-DL service seems to be out of quota today. Can you upload the APK somewhere?", "Oh, dude, this is crazy. Spin one of these up on a bulletproof host? Make the host a tor exit node. Sell ngrok access with monero. Profit. ALTHOUGH. I don’t want to go to jail, so I think I’ll hold off.", "Theoretically speaking: Is it even illegal? Of course you would score a nice position on the FBI watchlist, but are you responsible for the actions of your „users“ if you shut down their accounts after you get a federal request?", "Oh, dude, this is crazy. Spin one of these up on a bulletproof host? Make the host a tor exit node. Sell ngrok access with monero. Profit. ALTHOUGH. I don’t want to go to jail, so I think I’ll hold off.", "The idea itself sounds pretty dope. However, i think you have to make sure you don’t hit the connection limit of 40 connections / minute. Even cooler: It’s open source", "The idea itself sounds pretty dope. However, i think you have to make sure you don’t hit the connection limit of 40 connections / minute. Even cooler: It’s open source", "you can’t catch me", "So, I am again up with a new article to share. It is a great write-up by Rob Brown. It is about penetration testing an Active Directory. This is useful for the penetration testers who are into internal penetration testing. https://markitzeroday.com/pass-the-hash/crack-map-exec/2018/03/04/da-from-ou&hellip;", "Userland API Monitoring and Code Injection DetectionAbout This PaperThe following document is a result of self-research of malicious software (malware) and its interaction with the Windows Application Programming Interface (WinAPI). It details the fundamental concepts behind how malware is able to&hellip;", "No hate but if you consider pentesting just as something what @pry0cc said: Then you don’t necessarily need to know C/C++. Fair enough. But if you strive to understand what is going on under the hood, what a learning and evolving individual should do then imo knowing low level languages will help&hellip;", "I think most of the western school systems were brought up in a time where “curiosity was a crime”, and have not been modernized to a sufficient degree. (I don’t know of any country) Studying in one of these systems, I feel that every day. People who willfully repeat what the teacher said get rew&hellip;", "I think most of the western school systems were brought up in a time where “curiosity was a crime”, and have not been modernized to a sufficient degree. (I don’t know of any country) Studying in one of these systems, I feel that every day. People who willfully repeat what the teacher said get rew&hellip;", "The engineer you know does that. That does not mean every single engineer on the planet does that. There is a crucial difference between these two terms that both @Evalion @ricksanchez and @fraq are missing. “Engineer” is a job title, anybody can attain this with schooling. “Hacker” is a mindset. &hellip;", "What is the difference between a soldier and a terrorist? One is trained and employed by the government, the other by a criminal organization. But their tactics remain mostly the same. Both fire rifles, throw grenades, and kill others for different reasons. One to maintain public order, the other t&hellip;", "Hello SmartOne and thank you. To be honest, I only really began working on penetrating web applications because that is becoming the best way to gain ingress. I am more a grasp a bunch of things and get what I need guy; I’m like a half blind lab rat that always finds the cheese… There are people &hellip;", "Hello SmartOne and thank you. To be honest, I only really began working on penetrating web applications because that is becoming the best way to gain ingress. I am more a grasp a bunch of things and get what I need guy; I’m like a half blind lab rat that always finds the cheese… There are people &hellip;", "Hi @maderas, It’s very nice to hear from you after a while! Very good post providing some very interesting insights into your work. Which is the vulnerability you encounter most in your pentests? Misconfigured Web-Apps? P.S.: If you want to win a BinaryNinja License, you might wan to add the “fre&hellip;", "Firstly, due to my insane schedule, I do not get to interact with all of you as I would like. Let me take this opportunity to state that many of you are doing incredible work with the content of your posts; I do read just about everything released here on the Big 0; I am proud to be here among such&hellip;", "Hey 0x00ers, Just a quick post to share an awesome website I’ve just found (thanks to our software security teacher tbh) : www.root-me.org/en/Challenges There are a lot of different categories (Cryptanalysis, Reverse, Stegano, Web, etc…) and the challenges range from very easy to very hard, so ev&hellip;", "We Need Hackers Now More Than EverI“Yes, I am a criminal. My crime is that of curiosity.” In the years since The Hacker Manifesto was first typed out, much of the internet has changed. It has grown in both size and scope. New protocols have been invented. The web was born. It is altogether diffe&hellip;", "PrefaceHey there! I’m finally ready to present you the third installment of the series exploit mitigation techniques. The last two times we talked about Data Execution Prevention and Stack Canaries Today I want to talk about Address Space Layout Randomization or ASLR in short. Format wise the a&hellip;", "So many of us here are looking for work or interviewing for jobs. Others of us have plenty of experience interviewing or being interviewed. Let’s put those skills together and make our community better! I’m going to lead from the front here by sharing a link where you can subscribe to my calendar a&hellip;", "This is my write-up for the SolidState machine provided by HackTheBox and created by ch33zplz. Sup fellow padawans, this was an interesting box because the exploit had to be done in stages. This goes to show that proper enumeration, and really thinking about what an exploit is doing can save you a &hellip;", "If you’re familiar with the Damn Vulnerable Web App (DVWA) then you will love this. It’s called Hackazon and in its own words: Hackazon is a free, vulnerable test site that is an online storefront built with the same technologies used in today’s rich client and mobile applications. Hackazon has an&hellip;", "Don’t Download From Untrusted Links!If it’s not from the people who wrote it, it’s untrusted. I know this sounds like super basic stuff but we’ve had to delete/unlist a few posts recently where people (I’m talking about you, @the_heat_man) are posting sketchy links to download tools instead of poi&hellip;", "PrefaceHey there! After quite some time the second part will be finally published  ! Sorry for the delay, real life can be overwhelming ;)… Last time I have introduced this series by covering Data Execution Prevention (DEP). Today we’re dealing with the next big technique. As the title already&hellip;", "Trust me, that’s absolutely the least I want. Also, this wasn’t my point here. I’m sorry if I didn’t put it in the right words. My point was that if you don’t provide some background information here, or give newbies some stuff to read further, I’m afraid they won’t benefit much. I don’t wanna ba&hellip;", "Hi Dustin, Is USB boot enabled? Best, SmartOne", "Actually, please don’t. That’s what the like button is for  If you have something to add to the topic, leave a comment of course.", "You’re right, man. My bad.", "You’re right, man. My bad.", "Actually, please don’t. That’s what the like button is for  If you have something to add to the topic, leave a comment of course.", "I don’t think that the FBI is going to give a sh*t on your EULA  Anyways, thanks for the tutorial. What about using PyToC? I haven’t used it yet, but what i so far have heard about it, it should suit the purpose.", "Maybe he’s a ghost hacker which has to travel around the world for disguising his location", "One question: If you run a geolocation on a cell phone IP, would you ever be able to get the location of it? That would be a very serious privacy issue! And, though I know it’s only a story and you maybe wanted to keep your post short, only a skiddy would mess up the routers settings, when you could&hellip;", "True Story… I think teachers have nightmares of that little black box", "With the spreading of the new version of Petya/NotPetya Ransomware, called as BadRabbit, I thought it would  be a nice idea to sum up it’s targets, potential damage &amp; the found vaccination to prevent it from infecting others. Propagation technique: fake Adobe Flash update. Potential Damage: -Encr&hellip;", "Hi 0x00ers, While surfing the web, I stumbled upon a blog post which I found to be very helpful for beginners. Be sure to check out this guide if you want to start a successful cybersec career!   Best Regards, SmartOne", "Hello folks! I hope you’re all doing great! Today’s topic is by far my most favorite heap exploitation technique I’ve ever dealt with until now (as far as Linux is concerned). I can’t stress enough how much I love this technique. It’s super smart, technical, and even though malloc has been hardened &hellip;", "Monero coins", "Monero coins", "Some weeks ago I found [this interesting article] (https://blog.gdssecurity.com/labs/2017/9/5/linux-based-inter-process-code-injection-without-ptrace2.html), about injecting code in running processes without using ptrace. The article is very interesting and I recommend you to read it, but what caugh&hellip;", "Hello 0x00’ers! As many of you are aware, we are very fortunate to be able to offer 0x00sec as an ad-free service, hopefully forever. As this community grows, it will eventually require more and more just to keep it running. At the present, we receive a minimal amount from Amazon affiliates, anyti&hellip;", "Realmode Assembly - Writing bootable stuffPart 5: Graphic ModeWhat is this?This is going to be a walk-through in writing  Operation Systems in assembly which operate purely in Realmode. Goal will be writing different kernels from a simple “Hello World” over small terminal programs to graphical&hellip;", "Sup folks! I hope you’re doing great! CSAW Quals took place the past weekend and @exploit and myself teamed up for some binary exploitation session. He’s actually so good that he pwned a 500 point binary! Interestingly enough, there was a heap exploitation-related pwnable which covered a concept I &hellip;", "Right, you can send a receive (simultaneously) anything on frequencies from 10 MHz to 3.5 GHz. Also you can extend this range by using additional devices called upconverter and downconverter.", "So, am I right that one can not only receive, but also send with it and like run OsmocomBB on it?", "Sup folks! I hope you are all doing great. It’s been a long time since my last CTF write-up. The main reason is because I was trying to master the beast called heap exploitation and I’ve yet to learn a ton about it. To showcase one of the modern ways to pwn a heap-based vulnerable binary, I’ll use a&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "damn why does this always happen when I’m asleep! I feel left out for this planning stuff  … I can deliver some content on printer exploitation tho. Just gimme a bit! @SmartOne @pry0cc the requested article will probably be up around Tuesday. Unfortunately I had to leave home over the weekend and&hellip;", "damn why does this always happen when I’m asleep! I feel left out for this planning stuff  … I can deliver some content on printer exploitation tho. Just gimme a bit! @SmartOne @pry0cc the requested article will probably be up around Tuesday. Unfortunately I had to leave home over the weekend and&hellip;", "For the LuLZ  This is a 17 LoC, multi-architecture virus (works on x86 -32/64bits-, ARM, MIPS, PowerPC,…). It increases the infected binary in less than 350 bytes!!!. Feel the power of Bash! Best language ever for virus development!! #!/bin/bash#AMiINFECTEDfor f in *; do        if [ ! -z `fi&hellip;", "First!  Nice idea! Hope there won’t be two people working on the same topic", "Trust me, that’s absolutely the least I want. Also, this wasn’t my point here. I’m sorry if I didn’t put it in the right words. My point was that if you don’t provide some background information here, or give newbies some stuff to read further, I’m afraid they won’t benefit much. I don’t wanna ba&hellip;", "First!  Nice idea! Hope there won’t be two people working on the same topic", "Greetings, 0x00sec! After much discussion, the 0x00sec mods and admins have put together a new program, a Bounty Program. How it WorksThis very post will be a Wiki. Members will be able to add any topic they’d like to see written about on this site. Other members will see the wiki, scroll through,&hellip;", "Add it to the new bounty program! You can be the first", "Definetly. It could cover a huge ranche of skills, from firmware extraction and analysis to even modifying it and copy it on the fly via a update(seems overkill, but would definetly be a nice thing) Things like analysing exposed services and versions from the most common printers should also be on t&hellip;", "Printing is easily overlooked. I personally don’t think we should print on ordinary paper anymore at all, print should be reserved for banners and nice artwork, not quarterly reports. Would some content on printer security be good?", "Definetly. It could cover a huge ranche of skills, from firmware extraction and analysis to even modifying it and copy it on the fly via a update(seems overkill, but would definetly be a nice thing) Things like analysing exposed services and versions from the most common printers should also be on t&hellip;", "Printing is easily overlooked. I personally don’t think we should print on ordinary paper anymore at all, print should be reserved for banners and nice artwork, not quarterly reports. Would some content on printer security be good?", "Wow, that’s pretty neat stuff! The advertising firm did a great work. We have to do some research/posts about printer security  What do you think? How realistic was this ad? Normally printers should at least have their own VLAN, right?", "Hi 0x00’ers! Depending on your level of skill, you may be under the impression that using a VPN for all your traffic is a good thing for your privacy, you’ll have been told that using Tor 24/7, or tunneling all your traffic through it may save you from the infamous 3 letter agencies. Whatever crud &hellip;", "Wow, that’s pretty neat stuff! The advertising firm did a great work. We have to do some research/posts about printer security  What do you think? How realistic was this ad? Normally printers should at least have their own VLAN, right?", "Hey fellas, Small tribute for Mr. Robot fans  Thanks me later  http://www8.hp.com/uk/en/solutions/security/thewolf.html?jumpid=va_346a8z9p1w Best, Nitrax", "The legend himself gave another mind-blowing talk at BH this year. Even if you are not into very technical low level exploitation, it’s a must-watch talk in my opinion.", "@all/moderators: Maybe this is better suited for the support category? Best, SmartOne", "Hey Guys, First post here,  I am here to introduce a new aspect of a project I am working on(http://ki.tc). An IP logger with CLI in mind. Now, I have taken an API approach to this, so all calls are JSON dependent. Apart from my introduction, I would appreciate new ideas or rather feedback from th&hellip;", "SQLmap is indeed a nice tool. What i like best is to have Burp proxy on intercepting mode, copy the request to a new file(e.g. REQUEST.txt) and then simply use this command: sqlmap -r REQUEST.txt -p param", "I absolutely agree… the tut is more of a cheatsheet, but after a review it could’ve been better. There’s always room for improvement. I got lazy toward the end and I admit that much. By the way, it’s alright @SmartOne, you’re entitled to your opinion. Don’t apologize. ~Cheers!", "I absolutely agree… the tut is more of a cheatsheet, but after a review it could’ve been better. There’s always room for improvement. I got lazy toward the end and I admit that much. By the way, it’s alright @SmartOne, you’re entitled to your opinion. Don’t apologize. ~Cheers!", "Trust me, that’s absolutely the least I want. Also, this wasn’t my point here. I’m sorry if I didn’t put it in the right words. My point was that if you don’t provide some background information here, or give newbies some stuff to read further, I’m afraid they won’t benefit much. I don’t wanna ba&hellip;", "Trust me, that’s absolutely the least I want. Also, this wasn’t my point here. I’m sorry if I didn’t put it in the right words. My point was that if you don’t provide some background information here, or give newbies some stuff to read further, I’m afraid they won’t benefit much. I don’t wanna ba&hellip;", "Trust me, that’s absolutely the least I want. Also, this wasn’t my point here. I’m sorry if I didn’t put it in the right words. My point was that if you don’t provide some background information here, or give newbies some stuff to read further, I’m afraid they won’t benefit much. I don’t wanna ba&hellip;", "Continuing the discussion from [Malware Analysis] Case GBC-17_124: The dropper Part I: The get_msg FunctionOur analysis is going pretty well. By now, we know that the get_msg function is the one that gets the data from the network, data that is later dumped into a file. Time to rip it off:       &hellip;", "Cliiiiiickbaaaaaaait", "Trust me, that’s absolutely the least I want. Also, this wasn’t my point here. I’m sorry if I didn’t put it in the right words. My point was that if you don’t provide some background information here, or give newbies some stuff to read further, I’m afraid they won’t benefit much. I don’t wanna ba&hellip;", "First of all I kinda “disagree” with all of you making a debate of principles out of this under @Red_Joker’s post. This is an important thing to note. If you feel superior and don’t learn anything by briefly reading over an article then skip it.If you learn something or the topic was extra ordi&hellip;", "I have to agree (although we all were skiddies once ) This is very basic information which could help newbies. However in my opinion, it somehow lacks background information. Newbies will never “get to the next level” with simple “how to hack x” information.", "I have to agree (although we all were skiddies once ) This is very basic information which could help newbies. However in my opinion, it somehow lacks background information. Newbies will never “get to the next level” with simple “how to hack x” information.", "What most here fail to realize is that the “next level” is already on here. If you don’t know what I mean, just go to the homepage and scroll for a few minutes. What we ARE lacking however is introductory material for the freshmen just entering the industry. If you’d take time to visit Discord or I&hellip;", "What most here fail to realize is that the “next level” is already on here. If you don’t know what I mean, just go to the homepage and scroll for a few minutes. What we ARE lacking however is introductory material for the freshmen just entering the industry. If you’d take time to visit Discord or I&hellip;", "I have to agree (although we all were skiddies once ) This is very basic information which could help newbies. However in my opinion, it somehow lacks background information. Newbies will never “get to the next level” with simple “how to hack x” information.", "If you are reading this is because you have miserably failed to solve the Case GBC-17/124. LoL, just kidding. The GBC-17_124 challenge was intended to show you something that you can easily find in the real world, but still easy to solve. Yes, real world stuff is not as fun as the challenge you usua&hellip;", "WTF is RFC5114?We all know the importance of large prime numbers in cryptography, given that n = pq form large numbers’ prime factorization requires an unreachable amount of computational resources. But why is this RFC enforces a secure DH group (used not just in crypto, but zeroknowledge systems &hellip;", "[image]", "Wow, that was fast!  I think I should finally take the time to check out what’s new the IRC", "[image]", "Maybe write a chatbot which serves as a bridge between discord &lt;=&gt; irc and relays all messages to each other? This way everybody can choose whats more convenient for them and it keeps the community together. Just an idea.", "mspy was just an extension for the ircd, it’s not a standard name, but its the only thing I can remember that relates back to spying on PMs with a command. IRC networks usually declare in their ToS that they wont log secret channels and PMs, but that also means that the opers can do it, but ofcours&hellip;", "Realmode Assembly - Writing bootable stuff - Part 4Part 4: Basic Math OSWhat is this?This is going to be a walk-through in writing an Operation System in assembly which operates purely in Realmode. Goal will be writing different kernels from a simple “Hello World” over small terminal programs t&hellip;", "Realmode Assembly - Writing bootable stuff - Part 3Part 3: Building &amp; RunningWhat is this?This is going to be a walk-through in writing an Operation System in assembly which operates purely in Realmode. Goal will be writing different kernels from a simple “Hello World” over small terminal progr&hellip;", "So, I guess I finally found out why all these hackbacks work", "The only reason I would not use Discord over IRC personally is that I can’t “switch between aliases” so easy. I have a private Discord account which I do not want to disclose, so I would need to log out/on every time. Never heard about that tool, can you elaborate?   (Found nothing on Google besid&hellip;", "Good find! I’ll take a look at this and see if it’s something we can use. I think it will be.", "Idk if this still works, but it could be a start https://github.com/jekyc/wig", "Good find! I’ll take a look at this and see if it’s something we can use. I think it will be.", "For a few weeks now we have been watching the production of https://wacksec.com get better and better. We have seen multiple community members work hard into making this show great as well as informing the community and ordinary people of news and topics in infosec. Over the past few weeks, we have&hellip;", "Idk if this still works, but it could be a start https://github.com/jekyc/wig", "Well, a few things     Maybe I’m a bloody asshole, dickhead or whatever but, …, honestly, I think that using a cloud based solution like discord go against the principle of privacy. I really hope that the IRC will NEVER be shutdowned. Cya on IRC. Best, Nitrax", "That was a jab at HackingTeam. During the prep for this post I was reading an article about the awful shit they do. Also, I was thinking about using Py2C or Py2exe to write a light implant for preliminary recon for windows and linux boxes. It’s main goal would be to provide a “shell” type feature &hellip;", "Hi there, Maybe I get you wrong, but shouldn’t this 1 0 = 1 True True = false 0 0 = 0 False True = True be this? 1 0 = 1 True False = True 0 0 = 0 False False = False I think this table would fit in better here: Input        OutputA       B000011101110Best regards, Sm&hellip;", "I don’t think that the FBI is going to give a sh*t on your EULA  Anyways, thanks for the tutorial. What about using PyToC? I haven’t used it yet, but what i so far have heard about it, it should suit the purpose.", "He has left the dark side and migrated to the light side. He has seen the light; forever enlightened to build his houses with grains of sand, because he’s a power hungry, mad CS scientist. Just kidding @_py, however, scripting languages do have their place.  I wrote a twitter bot for the 0x00secOff&hellip;", "Hm… frankly I’m not convinced that you need Docker to solve such a simple task. For instance, on Arch Linux it’s as simple as: Install nginx or any service you need to hide:sudo pacman -S nginxsudo systemctl enable nginxsudo systemctl start nginxInstall tor:sudo pacman -S tor torsocksM&hellip;", "I am firewall’d by the corporal on IRC. Back in 8 hours…", "Man, this got pretty long here! I feel like we should continue this on the IRC", "I referred to the European Finals of the ECSC, which take place in Malaga this year. But your answer to @_py seems to have answered my question", "And what is “Malaga”? Are you referring to our national word? I’ve been to Barcelona recently but no Malaga anyways!", "@operatorequals Did you make it to Malaga?", "Yeah we’ve talked with @operatorequals on IRC. My field is more binary-related as you probably know so I’m pretty sure I don’t stand much of a chance. I’ve also noticed @operatorequals at the ECSC quals’ scoreboard this year for our country’s national team. Check out the alias “0sec” @operatorequal&hellip;", "Go and grab your beer, @_py!", "I think we talked before with @_py. If I remember correctly he studies really close to my home (like 10 bus stops). He gotta solve the challenge first though, or his beer is on him…", "I think we talked before with @_py. If I remember correctly he studies really close to my home (like 10 bus stops). He gotta solve the challenge first though, or his beer is on him…", "Go and grab your beer, @_py!", "Hey, guys (and gals)! Long time no see. I &#39;ve been working hard on several projects and stuff lately so I was just an observer all that time. Observing this page and several projects starting on github, I was really impressed with how many backdoor projects are being created. I remember reading a&hellip;", "Currently my favorite is Rigol DS1054Z oscilloscope. The best thing about this particular oscilloscope is that there is a keygen that turns it into much more expensive 100 MHz oscilloscope. So you get a 4 channel 100 MHz oscilloscope for a price of something more like 2 channel and 70 MHz. There ar&hellip;", "Nice post! Please fix the formatting tho’", "Nice post! Please fix the formatting tho’", "This is for Deshi, welcome to the early-mid 90s, Original txt file from Machacking.net (&gt;Introduction&lt;)What is a BLACK BOX? A BLACK BOX is a device that is hooked up to your phone that fixes your phone so that when you get a call, the caller doesn’t get charged for the call. This is good for call&hellip;", "as an alternative to the method above, we also can bruteforce the password by counting the instructions executed which can be done using intel’s pin tool or Linux’s performance analysis tool (perf). this method exploit the fact that the program exits when incorrect character is guessed and executes &hellip;", "Hi 0x00ers, While surfing the web, I stumbled upon a blog post which I found to be very helpful for beginners. Be sure to check out this guide if you want to start a successful cybersec career!   Best Regards, SmartOne", "Hello, I am not a low-level guy but I thought this will be a good link to share and a lot of you may get interested in this. I will keep sharing such link if you all want.", "[image]", "Did you have a look at this?   (Beware shameless self promotion )", "Morning folks. I know its been a while since ive posted here, life has been crazy,  and my company just agreed on a takeover of another blue team company,  so I’ve been dealing with all that fun legal stuff. Id like the communities input on something.  I’ve been speaking to my Microsoft rep for th&hellip;", "No but now I will!! Thanks so much.", "Did you have a look at this?   (Beware shameless self promotion )", "Did you have a look at this?   (Beware shameless self promotion )", "Realmode Assembly - Writing bootable stuff - Part 2Part 2: Hello World BootloaderWhat is this?This is going to be a walk-through in writing an Operation System in assembly which operates purely in Realmode. Goal will be writing different kernels from a simple “Hello World” over small terminal p&hellip;", "This place is so awesome. I was like, “hey, let’s google how to do that” and the VERY FIRST LINK was an 0x00sec tutorial. You guys rock. Edit (by oaktree):", "Of course you can get that by doing a deauth", "Suhdudes. I’m back with another challenge but it will be different because this will be designed for Windows! Another thing I will be doing is a kind of “series” with these crackmes where each successive one will get incrementally more difficult. I will also supply research material (to replace hint&hellip;", "Hello, thanks @dtm for this crackme, it was nice relax during Sunday afternoon for me. My original solution was the same as @0x00pf presented in first post, so I try find another single-byte patch. Instead of patching only the length of printed string, I try to change the “malicious” piece of co&hellip;", "Hey, pwntools developer here! Here’s some additional pro tips you may want to integrate into your blog payload = str(foo)payload += pack(bar)payload += bazCan be collapsed down into a single statement with the flat() function. payload = flat(foo, bar, baz)Integers are passed to pack, string&hellip;", "Realmode Assembly - Writing bootable stuffPart 1: Theory and ConceptsWhat is this?This is going to be a walk-through in writing  Operation Systems in assembly which operate purely in Realmode. Goal will be writing different kernels from a simple “Hello World” over small terminal programs to gr&hellip;", "Sigreturn Oriented ProgrammingIn the name of Allah, the most beneficent, the most merciful. Hello everyone to a new boring article, after we took a small look on normal ROP stuff, I decided to write something more fun !@_py is the one that started that idea! for learning purposes …I hope yo&hellip;", "Hi 0x00ers, While surfing the web, I stumbled upon a blog post which I found to be very helpful for beginners. Be sure to check out this guide if you want to start a successful cybersec career!   Best Regards, SmartOne", "Came across this, went through it, worked swell!  Anyone know of any other ways to acquire a full “tty” shell reversly with history and FINALLY not killing your shell with CTRL-C?  https://blog.ropnop.com/upgrading-simple-shells-to-fully-interactive-ttys/", "Found in twitter feed today:", "That is possibly one of the worst idea’s (if he connects to the unencrypted clearnet address). A tor exit node could snoop all the traffic. If they use a client, there is a tor address, and https, they’ll be fine.", "Hello everyone, It is my first post here so tell me if I do something wrong. During a CTF with a LFI vulnerability. I found this article talking about getting a RCE from a LFI using the temporary file of php. So I think It is a good idea to share this article here.", "Of course this depends on your opponent, but you should never have the battery in it anywhere near your home and leave your personal phone at home when conducting your “activities”. Just my $0.02 BTW: Excellent and funny video!", "@SmartOne No Reversing involved. Sadly. I bought the month pass just for starters. Im not sure if it was worth it… I do really enjoy the labs but the “course” itself was not worth 100$", "Do you think they are worth the money? Which Pass did you buy? What I can see so far, there are no ReverseMe’s unfortunately. (A topic where I would like to get better) Best, SmartOne", "Hi there, Maybe I get you wrong, but shouldn’t this 1 0 = 1 True True = false 0 0 = 0 False True = True be this? 1 0 = 1 True False = True 0 0 = 0 False False = False I think this table would fit in better here: Input        OutputA       B000011101110Best regards, Sm&hellip;", "Maybe he’s a ghost hacker which has to travel around the world for disguising his location", "As @SmartOne suggested. It would be really cool to have a wiki with useful links. Simply edit this topic and away you go! Blogs Security blog(s) overviewPenetration Testing Blog by @hkh4cksNews The Hacker News Security Affairs WIRED (Security Category) SANS Newsletter(s) (For&hellip;", "As @SmartOne suggested. It would be really cool to have a wiki with useful links. Simply edit this topic and away you go! Blogs Security blog(s) overviewPenetration Testing Blog by @hkh4cksNews The Hacker News Security Affairs WIRED (Security Category) SANS Newsletter(s) (For&hellip;", "The CTF I have been developing will be launched as is, with 15 challenges. There are no web challenges on this one. It is mostly forensics type categories,  since I lost some help when I first started this project. This will be for 0x00sec members only for final scoring to count, otherwise, open to&hellip;", "(post withdrawn by author, will be automatically deleted in 24 hours unless flagged)", "@all: Can you please send him PMs? This topic keeps showing up on latest without any new information", "@all: Can you please send him PMs? This topic keeps showing up on latest without any new information", "@all: Can you please send him PMs? This topic keeps showing up on latest without any new information", "@all: Can you please send him PMs? This topic keeps showing up on latest without any new information", "@all: Can you please send him PMs? This topic keeps showing up on latest without any new information", "@all: Can you please send him PMs? This topic keeps showing up on latest without any new information", "Hello, 0x00sec! Before discussing my project, I want to introduce myself a little; if you’re more interested in xcreds, feel free to skip to the bottom. Introduction I’ve been reading 0x00sec for a while, but have held off from creating an account until I had something interesting to share. I use&hellip;", "Thanks @SmartOne  I will fix the typo in the next commit", "Meant to be “Dumping Core”?", "Meant to be “Dumping Core”?", "Nice, I remember when I first learned about XOR. Seems like magic right? This blew my mind back in the day: https://sinister.ly/Thread-How-To-Write-Nonalphanumeric-PHP-Backdoors", "SmartOne- I am glad you found some merit in my reply. And thank you for pointing out the issue with the link; I fixed it. It is an awesome thing that you are out in the world testing your skills. I feel like this is a very important thing to do. Especially when you can test those skills against o&hellip;", "SmartOne- I am glad you found some merit in my reply. And thank you for pointing out the issue with the link; I fixed it. It is an awesome thing that you are out in the world testing your skills. I feel like this is a very important thing to do. Especially when you can test those skills against o&hellip;", "Thank you for your outstanding answer! I’m currently attending to a local countrywide infosec competition to benchmark my skills. So far, many of the challenges did have to do with WebApps (I indeed started my journey with WebDev) and I found them very easy. I will definitely follow your advice to&hellip;", "Thank you SmartOne. Answers to your questions are below. You had asked for advice; I take this request seriously, and thus the length of the reply. Whatever you choose to do in this field, it all comes down to competency. . What anyone says isn’t as important as what they can do  at the keyboard o&hellip;", "Whoa! This might be the longest post/introduction ever on 0x00sec! It gave some very interesting insights and took me about half an hour to read  How did you start to learn infosec? Which resources did you use to learn more about networks? I’m mostly a software guy wanting to get on deeper levels a&hellip;", "Thank you SmartOne. Answers to your questions are below. You had asked for advice; I take this request seriously, and thus the length of the reply. Whatever you choose to do in this field, it all comes down to competency. . What anyone says isn’t as important as what they can do  at the keyboard o&hellip;", "Something more low level that directly compiles to assembly. C# is way too easy to decompile if you deal with “advanced” targets. Pick something like C++ and learn how to use the underlying Windows APIs. It will of course not be an easy transition, but it will pay out in long term, as it will also l&hellip;", "What’s your suggestion?", "If you want your ransomware to be “perfect”, stop using C#. The article you posted is in no way related to your ransomware. It’s about a specific encryption chip. They talk about network appliances(“attacker controlled data”). Your application isn’t the only one to use AES. I can say that it’ll be i&hellip;", "I believe this that When you create something, you have to be in every way perfect. It is true that there is nothing perfect but,  must be as good as possible. So, if I am going to create a Ransomware that is one of the best, I have to consider all aspects even those that are less likely to happen&hellip;", "Can you please explain to me how this would matter for your ransomware? Someone can capture the random AES key used for encryption of the files much easier by installing a fake .NET runtime or running some sort of debugger. However, one has to know when exactly the ransomware runs, the location of t&hellip;", "", "It is just raw idea, Exactly, this is the second problem of using RSA", "It is just raw idea, Exactly, this is the second problem of using RSA", "Considering that RSA is based off intense calculations with huge numbers, the speed of encryption will be much slower than that of a symmetric cipher.", "Why don’t you wanna use AES for encrypting the files and encrypt the key with RSA?", "Im a n00b when it comes to stuff like this but I ran across this article and it seems relevant to this conversation Ghost Hook Bypass", "There’s no need for the decryption key to be sent anywhere. Using public key crypto, you can simply encrypt the decryption key with a public key and leave it on the victim’s machine as there’s no way (currently) for anyone to be able to recover it. For generating the key pairs, see here: https://sec&hellip;", "Educational purposes, Of course  Codes are obfuscated and the program packed with packing tools. Also, the decryption password will not store in victim machine, the password will generate before encryption phase and will be sent to a server on the TOR network, I should add this that password will &hellip;", "Thanks @SmartOne That capstone framework is amazing. I’ve got a working PoC (around 1.2KLoC) in a couple of days. Then it took me 2/3 days to just refactor that code in something with a bit of structure. So, roughly it took two complete weekends plus some hours every day during the week. Regarding&hellip;", "Thanks @SmartOne That capstone framework is amazing. I’ve got a working PoC (around 1.2KLoC) in a couple of days. Then it took me 2/3 days to just refactor that code in something with a bit of structure. So, roughly it took two complete weekends plus some hours every day during the week. Regarding&hellip;", "This is crazy  Phenomenous work! And you did it all on your own? How long did it actually take you to code it/get the idea? Best, SmartOne", "This is crazy  Phenomenous work! And you did it all on your own? How long did it actually take you to code it/get the idea? Best, SmartOne", "Of course we assume this is just for educational purposes  Do you intend to make your Ransomware easily beeing “broken”? You can easily decompile C# back to IL code, so malware analysis should not be hard. If you store the decryption key on the client and only “check” the password on the client, the&hellip;", "Of course we assume this is just for educational purposes  Do you intend to make your Ransomware easily beeing “broken”? You can easily decompile C# back to IL code, so malware analysis should not be hard. If you store the decryption key on the client and only “check” the password on the client, the&hellip;", "Man…so many. The ones that stand out the most are the ridiculous ones. This was the worst one; it is so bad it is long (sorry everyone): Pivoting onto a manager’s desktop and finding an Excel Workbook entitled “PASSWORDS”. Inside was every current username/password for that manager’s direct report&hellip;", "Hello everyone. I have made some minor edits since first posting this as to further clarify a couple of points. I joined this community a while ago; I have/had been a lurker for even longer.  A huge part of what made the hacker community what it was (and what it is here) involves a willingness to &hellip;", "Whoa! This might be the longest post/introduction ever on 0x00sec! It gave some very interesting insights and took me about half an hour to read  How did you start to learn infosec? Which resources did you use to learn more about networks? I’m mostly a software guy wanting to get on deeper levels a&hellip;", "Whoa! This might be the longest post/introduction ever on 0x00sec! It gave some very interesting insights and took me about half an hour to read  How did you start to learn infosec? Which resources did you use to learn more about networks? I’m mostly a software guy wanting to get on deeper levels a&hellip;", "Yes there are 4 attempts limit after that it blocks the attempt and can only try after some time but as i said there is around 4 month tolerance limit, so in 4 attempts u can cover up to 2 years gap", "There is a security hole in your account if you created it in a specific time. When did you create your account? I got my google account now for almost 6.5 years. How long do you have yours? My first google history entry is 5 years old. How old is yours? I think you can get the date more or les&hellip;", "There is a security hole in your account if you created it in a specific time. When did you create your account? I got my google account now for almost 6.5 years. How long do you have yours? My first google history entry is 5 years old. How old is yours? I think you can get the date more or les&hellip;", "Funny thing, I already tried to reset my Google password more than once, and always failed at that question. How should I remember when I created my account?  Generally speaking, one has to be a very creative Social Engineer to wrap this question in a plausible context. Would love to hear about so&hellip;", "That kind of information is possible through elicitation or hard research of somebody. So they only have one cookie? If you can obtain this, why would you not just get the login cookie? Also, how have you obtained this information? Is there a Google write-up somewhere? Or have you done your own re&hellip;", "One problem I think will be hard to get around: How would you guess the account creation date? Is there a limit of wrong tries?", "LoL, Maybe I am Wandering Soul", "LoL, Maybe I am Wandering Soul", "Did you read this? Also a great post with CheatEngine", "Maybe he’s a ghost hacker which has to travel around the world for disguising his location", "Maybe he’s a ghost hacker which has to travel around the world for disguising his location", "Maybe he’s a ghost hacker which has to travel around the world for disguising his location", "Yes I read that one a while ago as well and this here reminded me of the article by @dtm too", "Did you read this? Also a great post with CheatEngine", "Hey, this is a very brief tutorial on scanmem, a memory manipulation tool for Linux that’s well suited to game hacking. I’ll be using GZDoom as an example, but you should be able to follow along with any game you want. Firstly, install scanmem. Check your distro’s repositories as there’s a very goo&hellip;", "Hoodies are cool. 0x00sec is cool. You know what is even cooler? 0x00sec Hoodies.We get it, you’re a badass, and you love hacking + computers. But you would look even more badass with one of these bad boys. [image][image]Do you want something more understated? Okay. We gotcha.  [image] [i&hellip;", "Man you are a genius! I must admit I didn’t dig very deep, Well done!", "Seems like they messed up the https cert by issuing it to https://gitlab.s-3.tech instead of https://git.0x00sec.org/ You can still use it either in a fresh browser installation(because of HSTS) or just click the s-3.tech link", "You could hire spiderman out. I’m sure he does kids parties and the odd red team engagment. [image]", "Somone like him I want as a friend", "I will have to be a red teamer at least for a while in my life. It’s absolutely a dream job of mine, and I can imagine it being very fun !  It would be nice if you could share, of course anonymized, experiences/stories in your job. (You know, these stories one tells everyone to feel cool )", "Somone like him I want as a friend", "Personally I don’t have any experience with Arch and Gentoo yet. I think it depends on one’s personal use case which one to chose. For people who want to compile everything theirself, although possible with both, Gentoo may be the better choice. Users who are more happy with having a precompiled ker&hellip;", "I will have to be a red teamer at least for a while in my life. It’s absolutely a dream job of mine, and I can imagine it being very fun !  It would be nice if you could share, of course anonymized, experiences/stories in your job. (You know, these stories one tells everyone to feel cool )", "PrefaceThis is a write-up for solving the devil-swapper RE challenge by @0x00pf . It was mostly intended for my personal archive but since it may be interesting to all of you I will try to format it in a clear and most importantly scrub friendly way for people like myself… Since I got stuck along&hellip;", "Ah, this is the thread I’ve been craving  I’ve had multiple phones, most of which have expired due how poor they are at lithobraking. (Honestly, they fell and broke but I’m not accepting responsibility therefore ) Anyway, here are some screenshots of the phone’s I have abused so far: – LG G3 (D85&hellip;", "One of the best article on buffering (buffer cache) / optimization I ever have read. How is GNU yes so fast?", "PrefaceAfter a break because life kept me busy the next part of this beginner series is here. I will try to finish these articles rather quick now if they are staying on the this level, since I wanna dive deeper into different waters but in the end I dislike unfinished projects. As always: I st&hellip;", "I tried to enable encryption on Android 5 and it was very buggy-Launcher crashing every few minutes. At some point, my phone(Note 4) showed me that it had -15 GB of storage. When I connected it to my computer running windows, it said it had stunning 99 exabyte available  I also installed all sorts &hellip;", "Tip: don’t get Samsung… (Don’t hit me)", "Actually I didn’t buy them. I have good relations to someone who works for Samsung partner company and gives them to me for free (because he doesn’t need them anymore).", "Tip: don’t get Samsung… (Don’t hit me)", "I tried to enable encryption on Android 5 and it was very buggy-Launcher crashing every few minutes. At some point, my phone(Note 4) showed me that it had -15 GB of storage. When I connected it to my computer running windows, it said it had stunning 99 exabyte available  I also installed all sorts &hellip;", "I tried to enable encryption on Android 5 and it was very buggy-Launcher crashing every few minutes. At some point, my phone(Note 4) showed me that it had -15 GB of storage. When I connected it to my computer running windows, it said it had stunning 99 exabyte available  I also installed all sorts &hellip;", "Just interjecting, I have a iPhone 7 for all “official” stuff. I used to have Androids before but I couldn’t keep myself from messing with my “production” phone and as a result, I got the iPhone. I like the OS, albeit I miss a file manager. For pentesting purposes, I have about 6 Samsung with Cyan&hellip;", "Just interjecting, I have a iPhone 7 for all “official” stuff. I used to have Androids before but I couldn’t keep myself from messing with my “production” phone and as a result, I got the iPhone. I like the OS, albeit I miss a file manager. For pentesting purposes, I have about 6 Samsung with Cyan&hellip;", "What do you mean with messing, did you broke ur phone? OS design is good, but i prefer Android for the other things (like customizing all the phone)… Wow 6 Samsung on the desk? or did you mean Samsung S6?", "Hello members, I just joined this forum and is a nice place to meet people and discuss, I’m really happy for this. Now I want to ask if you have got a smartphone, and what do you have, if is Rooted (Android) or Jail-broken (iPhone), ROM, recovery, kernel, security/privacy apps, and whatever you ha&hellip;", "Just interjecting, I have a iPhone 7 for all “official” stuff. I used to have Androids before but I couldn’t keep myself from messing with my “production” phone and as a result, I got the iPhone. I like the OS, albeit I miss a file manager. For pentesting purposes, I have about 6 Samsung with Cyan&hellip;", "iPhone. Ringtone: defaultText tone: defaultBackground: not default", "Ah damn another wiki page i have to bookmark in case i win the lottery or this fine Nigerian prince is finally sending me these 50 million $ Edit: as of right now all of the amazon links are a dead end and are showing “the dogs of amazon” lel  [image]", "Great article! However, be sure to leave a space before the commands in order to make sure that they aren’t saved to the (bash) history", "Great article! However, be sure to leave a space before the commands in order to make sure that they aren’t saved to the (bash) history", "You can also use set +o history to turn it off and set -o history to turn it back on.", "You can also use set +o history to turn it off and set -o history to turn it back on.", "Hello 0x00’ers! @zSec gave us the idea to make a Wiki with working services for things such as email relays, SMS spoofing and the like. Feel free to edit this and add things you have tried and tested. The more we add in useful things, with a very quick way to access them, the more useful this page w&hellip;", "Continuing the discussion from Spawning reverse shells: I was about to reply on (Spawning reverse shells), but my reply has got so long that I decided to made it into a post. Please first read the original thread from @RickSanchez and the comments there, before you continue. The discussion here, i&hellip;", "That’s a nice trick. Thanks for sharing @SmartOne", "Great article! However, be sure to leave a space before the commands in order to make sure that they aren’t saved to the (bash) history", "Great article! However, be sure to leave a space before the commands in order to make sure that they aren’t saved to the (bash) history", "Nice post @ricksanchez ! This is my proposal for section 6 (What’s next) #6. Chuck Norris’ way Chuck Norris is not a hacker but he pwns any computer just walking close to it Chuck Norris writes his own reverse shells directly in machine code and types it in hex by heartChuck Norris writes IPs &hellip;", "PrefaceThis will be a short article which will demonstrates how to spawn an interactive reverse shell using built-in tools on any linux distribution. Also it shows what mindset and what kind of creativity might be needed when being a hacker or pentester. But why?There are many distributions of l&hellip;", "I used FaceNiff about 4 years ago and it worked  One of the best moments of my skid times  Personally I have a Phone with NetHunter next to me so I could do some writeups in the summer if people are interested.", "I used FaceNiff about 4 years ago and it worked  One of the best moments of my skid times  Personally I have a Phone with NetHunter next to me so I could do some writeups in the summer if people are interested.", "I used FaceNiff about 4 years ago and it worked  One of the best moments of my skid times  Personally I have a Phone with NetHunter next to me so I could do some writeups in the summer if people are interested.", "I used FaceNiff about 4 years ago and it worked  One of the best moments of my skid times  Personally I have a Phone with NetHunter next to me so I could do some writeups in the summer if people are interested.", "###Solving a Heap exploitation challenge  In the name of Allah, the most beneficent, the most merciful. Thanks to @_py and @n0tnu11  who encouraged me, to write about such thing… I want to say sorry, cause i don’t write alot more articles, you know guys, studies … It wasn’t easy for me to&hellip;", "Hey guys, I have created this tool: https://github.com/operatorequals/gatheros just to cope with Info Gathering in team environments (CTFs, etc). There is also a blog post that describes its usage.", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "Just a heads up, but HTS gave me another hash for this challenge! Seems that they randomly generate it for every user. As they put it in the level description, I think that can been understood as a hint  But hey, nice writeup! Keep it up", "You don’t even have to guess that the table is ‘email’, just put a invalid email in the submit form and it says: Error inserting into table “email”! Email not valid! Please contact an administrator of Fischer’s", "I found it nice to have the spoiler tags because I now try the challenges on my own. If you remove them, maybe add a spoiler warning and some spaces", "@ricksanchez Expanding on this, if you provided a link to the challenge, or the code, then it would give us a place to try it out.", "I found it nice to have the spoiler tags because I now try the challenges on my own. If you remove them, maybe add a spoiler warning and some spaces", "Yes they sometimes generate different passwords or solutions depending on e.g. what browser youre using", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "PrefaceI stated my reasoning behind this article series in the first article which can be found here. To avoid redundancy please check out the preface over there and let’s get right into action! note: If I write non sense in this and the next following articles please correct me for the sake of m&hellip;", "Just a heads up, but HTS gave me another hash for this challenge! Seems that they randomly generate it for every user. As they put it in the level description, I think that can been understood as a hint  But hey, nice writeup! Keep it up", "I found it nice to have the spoiler tags because I now try the challenges on my own. If you remove them, maybe add a spoiler warning and some spaces", "Oh good catch  . I missed that one!", "You don’t even have to guess that the table is ‘email’, just put a invalid email in the submit form and it says: Error inserting into table “email”! Email not valid! Please contact an administrator of Fischer’s", "You don’t even have to guess that the table is ‘email’, just put a invalid email in the submit form and it says: Error inserting into table “email”! Email not valid! Please contact an administrator of Fischer’s", "I found it nice to have the spoiler tags because I now try the challenges on my own. If you remove them, maybe add a spoiler warning and some spaces", "Will be useful on unpatched machines!", "Will be useful on unpatched machines!", "Note: I did not do the original work for this. This is an adaptation from Sheila A. Berta’s Exploit DB guide and mdiazcl from github on how to do it. With out further ado, let’s get right on into it shall we?! So, everyone by now (unless you live under a rock) has heard about the NSA tools leaked&hellip;", "Hi and welcome the 0x00sec community! Before trying to answer your question, I would like you to read oaktree’s post adherency guidelines and the Markdown Cheatsheet. Please help us to help you and reformat your post!  Thanks! SmartOne", "What a blast from the past!", "What a blast from the past!", "I changed it, thanks for the feedback", "I changed it, thanks for the feedback", "Hi and welcome the 0x00sec community! Before trying to answer your question, I would like you to read oaktree’s post adherency guidelines and the Markdown Cheatsheet. Please help us to help you and reformat your post!  Thanks! SmartOne", "Hi and welcome the 0x00sec community! Before trying to answer your question, I would like you to read oaktree’s post adherency guidelines and the Markdown Cheatsheet. Please help us to help you and reformat your post!  Thanks! SmartOne", "Hi Kage, Nice idea! But somehow, I found the title a bit misleading(makes me think of a list of current 0x00sec gitpab collabs). Maybe “What projects have you done while learning cybersec?” or something like that would be more appropiate", "If it’s just a cheapo hdd and not a ssd, i always buy a new one before reselling and treat the old one with a special hammer message  Of course I encrypt everything sensible while actually using the pc, but better safe than sorry!", "I’ll give it a try next time", "I’ll give it a try next time", "Sorry to break it to you @SmartOne, but a hammer massage isn’t the best method. Sure it does a good job, but you’re wasting energy and are leaving scrapsa, + your HDD becomes unusable Simple magnetic HDD’s work according to Weber’s hypothesis (look it up) and Faraday’s law of induction (look it up &hellip;", "Sorry to break it to you @SmartOne, but a hammer massage isn’t the best method. Sure it does a good job, but you’re wasting energy and are leaving scrapsa, + your HDD becomes unusable Simple magnetic HDD’s work according to Weber’s hypothesis (look it up) and Faraday’s law of induction (look it up &hellip;", "If it’s just a cheapo hdd and not a ssd, i always buy a new one before reselling and treat the old one with a special hammer message  Of course I encrypt everything sensible while actually using the pc, but better safe than sorry!", "Metasploitable  2 - IRC BackdoorThe first tutorial on Metasploitable 2 was about the vsftp backdoor, in this post we will talk about the IRC Backdoor. In the first part of this “How to” we will run the Metasploit exploit ( The skid way ). The second part we will write our own python exploit to tr&hellip;", "Do you mean 1337357?", "Do you mean 1337357?", "0x00sec turns 0x01!We made it, guys! 0x00sec is a year old. We went from a simple Jekyll blog with only three articles to a respectably-sized, full-on forum with over 500 users. Each day, one or more people took a chance and signed up. [image] Countless Introductions showcase our diversity of int&hellip;", "Well they would get a warning about the HTTPS cerificate(Most users won’t care) but HSTS will make your life hard IIRC. You would need to use a timeserver forgery attack.", "Exactly thats a really important point you’re making here. The “normal user” won’t care about an invalid certificate or a strangely looking website or a delayed response from let’s say our “fake server”. Alll they want is accessing facebook and if someone/something is to blame it’s  &quot;the shitty pc &hellip;", "Well they would get a warning about the HTTPS cerificate(Most users won’t care) but HSTS will make your life hard IIRC. You would need to use a timeserver forgery attack.", "Now this is not a programming tutorial as most of you are probably hoping for, but I think most of you (if not all) ever had to use git. Wether it is to get involved in our Gitlab or to clone a nice little piece of software you found from GitHub, you’ll most likely use it in the future. I am current&hellip;", "Here ya go. This is everything it could dig up https://s-3.tech/evilcode1.html", "Fun fact: WP-SCAN won’t allow you to scan wordpress.blogspot or whatever sites. Fix is easy! Go to where wp-scan libs are (Prob /usr or /opt (/opt/wpscan/lib/wpscan/wp_target.rb) for me. change the lines: def wordpress_hosted? @uri.to_s =~ /.*\\.wordpress.blogspot.com/iTO def wordpress_hosted&hellip;", "Hi fellas, Today, I wanted to spend some time explaining you why Wordpress is, and will still be, the best CMS of all time ! Indeed, since its release on May 27, 2003, no flaw has been found and its founders are kept hard work to maintain and enhance this fabulous solution that help thousand users&hellip;", "OTW is OccupyTheWeb, a former NullByte member who wrote many good articles(and even had a contract with them). When we split from NullByte(when he got fired), he made a website on his own where he does some posts and sells some certification (trainings?). https://www.hackers-arise.com/", "OTW is OccupyTheWeb, a former NullByte member who wrote many good articles(and even had a contract with them). When we split from NullByte(when he got fired), he made a website on his own where he does some posts and sells some certification (trainings?). https://www.hackers-arise.com/", "Hello there! I am the author of those posts. Thanks a lot for mentioning them! unDLP looks quite promising! Added to the things I follow.", "If people really want to use a scripting language, I recommend Lua. Well designed, and the interpreter can be around 100kb.", "pyinstaller compiles to an executable. This is pretty stealthy.", "I would suggest part of the concept would be that a lot of things, (data collection, surveillance) would be mostly automated. It could create packages (organized by date) that will upload periodically. If designed well, it could be designed to operate on a very large scale, with a P2P C&amp;C server. T&hellip;", "I’m not so experienced with Python, but isn’t it very unstealthy when running on Windows? If not, I think we could create modules/packages with it, but leave the core in C++. Anyways, looking forward to this project! I always had something similar in mind, and my head is sparkling full of ideas!  M&hellip;", "Hello there, first of all: Excellent read, great PoC! Very informative. I decided to test how the domain name interacts with emails and will post my results below: (By “Nickname” I am referring to the “Name” you could select, in this example it would be &quot;noreply@i.imgur.com&quot;, the supposed email of&hellip;", "Works on android too. SMS could prove very powerful as well.", "Works on android too. SMS could prove very powerful as well.", "BTW, Whatsapp and Signal both seem vulnerable, only the underline looks a bit weird. Tested on iOS 10", "BTW, Whatsapp and Signal both seem vulnerable, only the underline looks a bit weird. Tested on iOS 10", "I think that it would be a good exercise for y’all (myself included) to write some decent malware. I’ve been rolling the concept for one around in my head for a few weeks and it would be fun to implement, especially with a small team of people working on it. Here’s a basic concept that is in no wa&hellip;", "BTW, Whatsapp and Signal both seem vulnerable, only the underline looks a bit weird. Tested on iOS 10", "I was up early, checking my twitter feed, and I came across this. They were a bunch of guys who decided to take letters in a domain name, and convert them to unicode. So they look visually the same, although they are actually completely different. I decided to give this a go. Hot DamnI hopped ove&hellip;", "I absolutely plan on sharing some of my experiences with everyone, I just have to pick the good ones out, and find the time to write them up! I’m glad this post is interesting to some of you.", "I will have to be a red teamer at least for a while in my life. It’s absolutely a dream job of mine, and I can imagine it being very fun !  It would be nice if you could share, of course anonymized, experiences/stories in your job. (You know, these stories one tells everyone to feel cool )", "This is a cool tool i found,thought i would share it with everyone-It’s called Asemica. Github Link Click me for more information Definition: Asemica is a symmetric cipher whose key is a document and whose ciphertext looks like plaintext. Why use this? One of the downsides of encrypting message&hellip;", "What’s in a Red Team?If you’re interested in information security, you’ve probably heard “penetration testing” and “red teaming” used interchangeably. However, for those of us actually doing red teaming, they’re not necessarily the same. So what do they mean? Penetration TestingPenetration testi&hellip;", "Very interesting read! The bash bunny is new to me, but looks very useful!  In your opinion, how does it compare to the USB Armory? Do you have any experience with it? Spec wise, the USB Armory has a newer CPU. Also, with it’s micro SD card slot it seems to be more expansible. I didn’t find the dim&hellip;", "If any of you folks are interested in what I carry for my red team engagements: NOTE: Entry tools are not legal everywhere. Before I go on an engagement, I make sure I know the relevant laws. BagGoRuck GR1 - This bag is tough as nails, and big enough to carry all the gear I need. Whether I’m snea&hellip;", "Drink a beer before you go up on stage  But seriously, there are a couple things I do/keep in mind: Prepare your intro and nail that. Once you get rolling, your nerves tend to relax a bitIf you find anyone in the room that is giving you really positive feedback via their expression or reaction, &hellip;", "IntroductionFirst and foremost, I’d like to note that this is not an all encompassing article. You WILL have to use your creativity and think out of the box when hacking. What will this article entail? It will not have any code whatsoever, and is not meant to teach you how to hack anything specif&hellip;", "Did I miss it? (or did I miss the irony)", "Come on, @Joe_Schmoe! Don’t be __stelf__ish. Make a post!", "Wow. I have to get there at least once in my life!", "Sunday: No talks, but I did hang out on the trade show floor and see some awesome booths.NASA booth was amazing.Everyone was crowded around the CIA booth for some weird reason.Facebook Live was conspicuously crammed into a small booth way off in the corner, away from the action.Went to the IEE&hellip;", "Did I miss it? (or did I miss the irony)", "Yes! i do plan on doing some body cam footage, audio recordings, and all that jazz.", "The Project Is Now Underway guys!  [image]", "I saw @oaktree asking where I was and figured I’d let y’all know so you’d quit worrying. I’ve been at SxSW since Sunday and I give a talk tomorrow morning some time about how to not screw up a hackathon. Bad news: It won’t be recorded like I previously thought. Sorry, peeps. Cool news: I had an in&hellip;", "No because I’m a bad Webmaster", "Did you enable the ENT_QUOTES switch?", "Lmao, there should be one on the official WikiLeaks page. I followed a link to it on twitter, but I don’t remember what the link is and I certainly didn’t bookmark it. Also, yea that is indeed the full. If I remember correctly, that’&#39;s a profile picture of one of the users.", "So… Is it just fake?", "Would be very interesting if you write about your techniques! Looking forward to it", "So… Is it just fake?", "So… Is it just fake?", "Lol. This doesn’t look like CIA Leaks to me…  [image]", "What exactly is in there? Is it an archive of the “official” information?", "Yeah I will give more information next time. ( For this I’ll use the Missionin the next articles  ) Otherwise got new Ideas &#39;cause of @DAGONCHU and @ricksanchez. Just have to script them", "I tried…  [image]", "Yea. I’m looking forward to what they’ve got in store for us.", "Whoa. They say it was just one percent", "Hi 0x00ers, While surfing the web, I stumbled upon a blog post which I found to be very helpful for beginners. Be sure to check out this guide if you want to start a successful cybersec career!   Best Regards, SmartOne", "Hi @Derfloink, You should maybe add some details next time, I was desperately looking for a Php code/sql injection  Anyways, nice idea!", "Whoa. They say it was just one percent", "OMG Guys! i am so happy that there is alot of interest in this! i am super excited to get working on this! thank you all for your suggestions!  I will get started asap,  just been busy going through the Vault 7 Leaks. Things i am wanting to include Basic Conversational SkillsFun ExercisesHow to&hellip;", "OH DUDE. I am very looking forward to Video Evidence + Audio Tapes. That is going to be absolute gold. If you need some hosting for those files hit me up and we can sort something out (if you don’t use youtube or vimeo).", "I can also totally recommend this book. I bought it some time and it is great.", "I can also totally recommend this book. I bought it some time and it is great.", "Politically, I hope people finally wake up. Stop the CIA and NSA, they do nothing good for the American people. Professionally, I’m looking forward to blackhats and whitehats alike using the leaks for new exploits and malware. And I don’t just mean vulnerabilities that remain unpatched on purpose. &hellip;", "I’m not that knowledgeable about this but it would be interesting to test which sites allow such “badly formatted” usernames for registration. Is there an easy way to see who filters such stuff right away? Seems like some browsers already do it ? ( from what I read from @SmartOne )", "Not sure actually. I’m hoping it could add some insight for me on how I can go about…er…joining them lmao. Looking at their docs, their code, and their files I’m hoping to learn quite a bit from this leak (and I’m sure that there will be other leaks that follow it). EDIT: There is some really real&hellip;", "Would be very interesting if you write about your techniques! Looking forward to it", "Thanks for your advise. It seems that I was really too stupid to customize the options  However, it also seems that my browser auto-corrects some of the characters in a url. I can see it being useful with usernames and such", "1.) Type in the text box the original username 2.) Now you can choose different characters (Radio buttons) for the letters (Focus on &#39;o’s; they can easily be changed ) 3.) Copy the fake username at the bottom Should work . Maybe you’ve forgot to change some of the letters before copying?", "Thanks for your advise. It seems that I was really too stupid to customize the options  However, it also seems that my browser auto-corrects some of the characters in a url. I can see it being useful with usernames and such", "Hi fellas, This short write up follows my previous article, keeping you updated on the progress of unDLP. As I mentioned before, unDLP was mainly focused on data exfiltration through the ICMP protocol. However, after some research and debates on IRC (thanks @suser), I decided to reconsider the pro&hellip;", "Thanks Man! Will Get Started in a few days!", "Thanks Man! Will Get Started in a few days!", "Would be very interesting if you write about your techniques! Looking forward to it", "Would be very interesting if you write about your techniques! Looking forward to it", "Im an extremely Extroverted Person.   I love people, to the point i have full blown conversations with people inside a store, or gas station, as if we have been friends for years.  I dont really have that much knowledge base about exploits, or full on pentesting…YET! I am still learning, but i know&hellip;", "1.) Type in the text box the original username 2.) Now you can choose different characters (Radio buttons) for the letters (Focus on &#39;o’s; they can easily be changed ) 3.) Copy the fake username at the bottom Should work . Maybe you’ve forgot to change some of the letters before copying?", "Interesting website, but it doesn’t seem to work for me. It only gives out the original one. Already tried it on the 0x00sec registration form and it says ‘username already taken’. Must be doing something wrong…", "Yo, found this script recently: https://github.com/Tompazi/confundo What this script does is it replaces letters with similar looking Unicode glyphs. So you feed it a string, and it outputs several strings that look the same, yet use different characters. An example that comes to mind: If your tar&hellip;", "@SmartOne For a home server, I am using the HP Proliant Microserver and it works really well. It has hot-swappable bays and all sorts. It is also insanely quiet, I run it in my room. I personally run Open Media Vault on it and it runs lovely, with a web-gui. It’s like heaven in a box.", "@SmartOne For a home server, I am using the HP Proliant Microserver and it works really well. It has hot-swappable bays and all sorts. It is also insanely quiet, I run it in my room. I personally run Open Media Vault on it and it runs lovely, with a web-gui. It’s like heaven in a box.", "Hello Hackers  I’m back for a tutorial on privilege escalation , and today we will talk about Docker ! [image] I’ve done a lot of CTF challenge recently and one of them ( Flick v1 )  include a “Docker privilege escalation”. If you want to read the original post about the docker privilege escalat&hellip;", "When I started studying and learning about exploit development, one of the biggest issues I ran in to was finding a good starting point. I am by no means an expert in this field, but here is a list of some of the material I found helpful while learning (I still am learning and will always be) to res&hellip;", "I’ll leave that bit up to the reader! I’m not just gonna hand over everything.  @pry0cc Yea. I was actually thinking about exchanging the default parabolic antenna with a cantenna. I feel like it’d do better, but I’ll save that project for another day!", "What about the latency/throughput of those networks far away? Could you post some tests?", "Holy cow! A Satellite dish?!Yup…You read that right! Today, I’ll be doing a write up on creating your very own WiFi range extender using an old satellite dish! Resources:1. Build pictures 2. Results pictures  [image]The finished product How does it work?Now, we’re going to try and explai&hellip;", "There are almost 20 official Arduino models with very different features (not considering all the tenths of compatible boards out there). Some have removable MCUs, some don’t. Some have more memory, some less. Some run faster and some slower… The language you use with the Arduino IDE is also C.&hellip;", "Hello Hackers ! In this topic, I will share you some link and some tips on how to find good resources to learn “Hacking” The first thing to do is maybe learn a programming language I start in learning C when I was younger but I didn’t go too  deep in this programming language. A good starting poi&hellip;", "Hi @ricksanchez Good introduction. Some comments Even when I think, most of the people had understood what you meant in that sentence I would like to clarify that a logic analyser is intended to be used with digital signals. It will not work with analogue signals. The “whatever form the signal ma&hellip;", "I ordered a bus pirate and a logic analyzer to take over my ISPs Router. If it works, I will do a tutorial/writeup from a beginners side of view.", "Good morning fellow readers, PrefaceI decided to write another beginner tutorial before we’re stepping into deeper water, so everyone who’s interested in following has basically the same knowledge base when it’s getting more complex. If you’re more advanced and already know what I’m writing about &hellip;", "TEENSY. I think pretty much all HID attacks are really powerful. I wonder if you could communicate with an ODB port, to carry out functions on a vehicle? Like the tool used in this:", "Great article! I’ ll definitely get one. Could help me to gain access to my ISP’s modem which is so rare that there aren’t any usable exploits", "Thanks! And I’m sure you will gain access to that router if there is a debug port on there. There always is a way to access the file system somehow", "Thanks! And I’m sure you will gain access to that router if there is a debug port on there. There always is a way to access the file system somehow", "Great article! I’ ll definitely get one. Could help me to gain access to my ISP’s modem which is so rare that there aren’t any usable exploits", "Great article! I’ ll definitely get one. Could help me to gain access to my ISP’s modem which is so rare that there aren’t any usable exploits", "Intro to the Hackers labAs asked in the The Hackers lab - Rpi Edition  by @VVid0w, he and I will now collaborate when writing this series about hardware and essentials a hacker should have to solve the task efficiently Today with a 100% fresh portion about debugging/reversing What is a Bus Pirat&hellip;", "The second in a series on microservices. MicroservicesPart 2: The start of microservicesOut of the water, onto land…The motivation for and benefits of a microservices architecture extend far beyond simply breaking down the monolith as mentioned, but for most engineers and companies I’ve spoken &hellip;", "NB: I have filed this under programming because it is in its purest essence a programming problem. However, this extends above and beyond the mere laying of code and into overall systems design I have also decided to break these into shorter chunks of around 1,000-1,200 words each. MicroservicesP&hellip;", "Interesting to learn about the naming difference . Had never heard of that before", "Interesting to learn about the naming difference . Had never heard of that before", "Interesting to learn about the naming difference . Had never heard of that before", "The main benefit is that Perl is the coolest scripting language ever  On top of that, it is very easy to integrate a Perl interpreter in any other project and it has a quite powerful extension system to interface to any other library out there (man perlembed  and man perlxstut for details). P.S.: &hellip;", "The main benefit is that Perl is the coolest scripting language ever  On top of that, it is very easy to integrate a Perl interpreter in any other project and it has a quite powerful extension system to interface to any other library out there (man perlembed  and man perlxstut for details). P.S.: &hellip;", "What are the benefits of Perl over C++? I think it would be easier to integrate/port into existing projects if you write it in C++, wouldn’t it? Best, SmartOne P.S.: I could be wrong though, because I don’t have a lot of experience with Perl", "It will be, for sure, easier to maintain a C++ code base and it will clearly simplify its integration within another engine / software. However, I would like to keep unDLP independent and, frankly, I don’t care about a possible merge or integration with another structure.  Develop this project with&hellip;", "What are the benefits of Perl over C++? I think it would be easier to integrate/port into existing projects if you write it in C++, wouldn’t it? Best, SmartOne P.S.: I could be wrong though, because I don’t have a lot of experience with Perl", "It will be, for sure, easier to maintain a C++ code base and it will clearly simplify its integration within another engine / software. However, I would like to keep unDLP independent and, frankly, I don’t care about a possible merge or integration with another structure.  Develop this project with&hellip;", "What are the benefits of Perl over C++? I think it would be easier to integrate/port into existing projects if you write it in C++, wouldn’t it? Best, SmartOne P.S.: I could be wrong though, because I don’t have a lot of experience with Perl", "Hi fellas, As @_py suggested, I have decided to adopt a new article format to show the progress of my project, allowing you to have a better understanding of the technical choices during the development process as well as a better overview of the work accomplished. This new series concerns a new o&hellip;", "Hello fellow 0x00sec h4x0rz!! Today I’m coming to you with a discussion topic on EDC bags. An EDC bag is something that you carry with you every day, I.E, an &#39;E’very &#39;D’ay &#39;C’arry bag. The Bag.Alright, so, what’s an EDC bag without the bag part?! Personally, I don’t think you need an expensive, s&hellip;", "I promise to write this many months ago, and finally I found some time to do it. Even when a VPN is not really a hacker tool, it is commonly used to make tracing more difficult and to increase privacy and anonymity. We have talked a lot about VPNs from a user point of view but not much about how the&hellip;", "mycodeschool is one of the best youtube resources for C in my opinion. If you are a tutorial type of folk, you should 100% check out all of his series. I had read that he was working for Google.", "Hello! This guide is based on my own experience and opinions. First you need to ask yourself is programming something that you want to do for the rest of your life as a hobby or profession or it’s just a thing that you like to see how it works. If programming is just a thing that you like to see h&hellip;", "Found in a Parisian sushi restaurant and presented without comment. https://imgur.com/q6n2apj (Upload too big. =[ )", "Completely support @_py on this. @zinzloun, you have 3 days to accept the constructive criticism or suffer the fate of unlisting. 0x00sec is a quality forum, with quality content. Writers should strive to adhere to that. If people cannot accept constructive criticism, then they simply do not belon&hellip;", "Hi fellas, First of all, I wanted to apologize for my lack of activities the last month. Indeed, I was overwhelmed by my work and my training for my OSCP certification which was quite time consuming  By the same token, would you be interested in my feedback about OSCP? YesNo0voters &hellip;", "Great share man! Keep &#39;em coming!", "Hi 0x00ers, While surfing the web, I stumbled upon a blog post which I found to be very helpful for beginners. Be sure to check out this guide if you want to start a successful cybersec career!   Best Regards, SmartOne", "Hey, thanks for the link! That’s what I was looking for o/", "Hi 0x00ers, While surfing the web, I stumbled upon a blog post which I found to be very helpful for beginners. Be sure to check out this guide if you want to start a successful cybersec career!   Best Regards, SmartOne", "Hi 0x00ers, While surfing the web, I stumbled upon a blog post which I found to be very helpful for beginners. Be sure to check out this guide if you want to start a successful cybersec career!   Best Regards, SmartOne", "Hi 0x00ers, While surfing the web, I stumbled upon a blog post which I found to be very helpful for beginners. Be sure to check out this guide if you want to start a successful cybersec career!   Best Regards, SmartOne", "Hi 0x00ers, While surfing the web, I stumbled upon a blog post which I found to be very helpful for beginners. Be sure to check out this guide if you want to start a successful cybersec career!   Best Regards, SmartOne", "Hi 0x00ers, While surfing the web, I stumbled upon a blog post which I found to be very helpful for beginners. Be sure to check out this guide if you want to start a successful cybersec career!   Best Regards, SmartOne", "Hi 0x00ers, While surfing the web, I stumbled upon a blog post which I found to be very helpful for beginners. Be sure to check out this guide if you want to start a successful cybersec career!   Best Regards, SmartOne", "Since 0x00sec’s conception, 0x00sec has relied entirely on the wallets of the admins, as well as the donations from kind people in the community for funding. Starting today, the new official sponsor of 0x00sec is Sequoia Cyber Solutions!  [Sequoia]These guys are doing some really great things wit&hellip;", "Please share it!", "I resume this old post because this tutorial helped me to develop a complete C# Crypter for a bind shell that I need in my job. You can include the encrypted file as embedded resource in your VS 2005 stub project, selecting Do not copy to the output directory and the file will be embedded in your ex&hellip;", "We used to hate shitposts on Null Byte, now we got this…  [image]", "There’s a typo in both scripts, on the line which prints what model they are attacking. Literally unusable.", "IntroductionHello fellow h4x0rz! I’m sure you’ve all heard about the recent Netgear router exploit, correct?! Well, on this fine day I now present to you this article of Netgear administrator credential finding, using the CVE-2017-5521 vulnerability. (DISCLAIMER: I am offering this article as pur&hellip;", "Continuing the discussion from Remote Exploit. Shellcode without Sockets: No this is not a log post on how to hack remote services. By chance I found an interesting paper that presents an interesting technique to hack your way into a remote server without having a local binary. This is the link h&hellip;", "Straight outta superuser, It seems that a mesh network is what we would be looking at.", "Yes, this is exactly what i meant. Somehow, I didn’t really manage to find a implementation of it. It would be a nice project, though very complex", "Yes, this is exactly what i meant. Somehow, I didn’t really manage to find a implementation of it. It would be a nice project, though very complex", "Straight outta superuser, It seems that a mesh network is what we would be looking at.", "Hm interesting. P2P WiFi? I’d like to know how that would work…  Decentralized DHCP…", "Sweet article and nice storytelling!  In the case of your story, it would be interesting to do an ad-hoc network that doesn’t rely on one single router. Would be interesting how to do this… SmartOne", "Dynamic Loading of Shared Objects at RuntimeI’ve been doing a lot of tutorials about dynamic stuff. It’s because we trees rustle whenever the wind blows. Anyway, this post comes as an addition to @_py’s Linux Internals - The Art Of Symbol Resolution. This whole thing started when I decided that t&hellip;", "Sweet article and nice storytelling!  In the case of your story, it would be interesting to do an ad-hoc network that doesn’t rely on one single router. Would be interesting how to do this… SmartOne", "Picture the moment. It’s 2057, technology has barely progressed, and the earth is under harsh censorship and surveillance. Humanity has reverted to the Hitler days. Don’t get depressed! Let’s build a mesh net! In your manic mindset, you quickly throw together your portable phone re-charger, your R&hellip;", "It is said that once in a while a person has to reinvent himself (I follow Zen philosophy). I believe it’s my time to answer myself to the questions I’ve been pondering upon for quite some time now. So I’ve decided to go on a break, facing the uncertainty of life to refuel the mind. Home is not a p&hellip;", "I have done IP geolocation of IP’s i know the location of. And it was accurate to the town,  5 miles give or take. It really depends on the IP and the provider,  either way its better not to take the chance. Privacy should be a focus for everybody, regardless of whether they have nefarious intentio&hellip;", "Let me respond to both @oaktree and @pry0cc in this one response: Geolocation is overrated. You can’t get a precise location with a simple IP address. You just can’t. Typically, the location consists of where your ISP is located. Even then, if I run a whois lookup on my IP address, it gives me my I&hellip;", "Speaking of my research work, which one would you recommend?", "Some people say that there are three things you have to do before you die: Write a book, have a child and plant a tree. Actually, the three things you have to do before you die are: write your own IRC bot, create a massive framework that only you will ever use and code an awesome  Linux kernel modul&hellip;", "7 days left! Joe_schmoe is right.", "Isn’t there the option ‘Request Desktop Site’ on every major Android/iOS browser?   (This should change the user agent, it isn’t persistent as your solution though) P.S.: Tried about:config on Firefox on iOS and it didn’t work", "If I’m not wrong, all VPN’s can see your traffic. It’s up to you if it is encrypted and up to the VPN if they log it", "There is, but those sites don’t care about that. All they care about is the User Agent string. Also request desktop might change the user agent string, but not sufficiently, it still won’t think you’re on a PC. Haven’t tried it on iOS.", "Isn’t there the option ‘Request Desktop Site’ on every major Android/iOS browser?   (This should change the user agent, it isn’t persistent as your solution though) P.S.: Tried about:config on Firefox on iOS and it didn’t work", "If I’m not wrong, all VPN’s can see your traffic. It’s up to you if it is encrypted and up to the VPN if they log it", "I’ve been doing some thinking about DNS Rebinding, and I think this could be really insightful to a lot of you out there. I found this a while ago, (Def Con rocks), and he is speaking about bypassing Same Origin Policy in order to execute code on machine on your local network using DNS Rebinding. I&hellip;", "Ay, nice! Much better than using the google dorks way. Heres the search term for research purposes. Name of Movie -inurl:(htm|html|php|pls|txt) intitle: index.of “last modified” (mp4|wma|aac|avi)", "That’s very cool! Thanks for sharing", "That’s very cool! Thanks for sharing", "That’s very cool! Thanks for sharing", "That’s very cool! Thanks for sharing", "Hey! A very quick little tutorial here, (really not advanced at all), but may save you a tonne of time. Big scary disclaimer: I don’t advise pirating blah blah, I cannot be held responsible for the billions of dollars of “theft” you do with this. Blah Blah. Don’t sue me. Here’s the deal - You’re a&hellip;", "Welcome everyone! In this article, I’ll try to briefly introduce you to the amazing Carrot2 Clustering Engine. I don’t know about you, but I only found out about this tool a couple of days ago and I thought it was worth sharing it. So, ###What is Carrot2? Carrot2 is an Open Source Search Results&hellip;", "I’m so glad 0x00sec is bringing people together!", "Hi all, I’m a new aspiring hacker and right now I’m going through a couple of books about penetration testing but I’m not sure if does books are enough for becoming a hacker. I have no intention of becoming good at things in a short amount of time, I know that I have to spend a lot of time in order &hellip;", "Welcome back, 0x00sec community, to my series on sorting. I introduced in my last article the concept of complexity. When I say complexity, I’m talking about time complexity. What Is Time Complexity?You can view the Wikipedia article here, but I’ll be speaking from my heart and soul. Time compl&hellip;", "Imagine you are sitting in an airport, and you feel a sudden urge to browse the Internet. You take out your phone, and there seems to be an open network for travelers. Having safety in mind, you fire up your VPN client. But wait - It can’t connect? You open your browser and witness a horrible sight &hellip;", "[image]", "Didn’t realize penguins have noses.", "basically a University in Europe, focused on crypto and infosec :]", "basically a University in Europe, focused on crypto and infosec :]", "Cool! Which (type of) school do you attend to that you have ‘Software Security’ as a subject?", "Thank you. You can do whatever you want with the wallpapers. Just give credit", "Really nice work @Fust3rCluck. What’s the license of the wallpapers/the pictures used? Best, SmartOne", "Thank you for the clarification! I always had a dream of a “virus” that turns plugged in usb’s into bad usbs, but that doesn’t seem possible", "Really nice work @Fust3rCluck. What’s the license of the wallpapers/the pictures used? Best, SmartOne", "Hello 0x00’ers. I have made some wallpapers with the 0x00sec logos. I hope you enjoy them. I have attached a compressed tar archive with the full album. (MEGA link, The files are huge because I didn’t compress them.) Enjoy   https://mega.nz/#!7BRQBTyZ!AjsIxERCVe0_l0Ub2jl49vSZ8HViwKtJi2idTuGKESo –F&hellip;", "Hi there. When I wrote this trick I had in mind it was not theorically valid, which led me not to propose an implementation for Metasploit for example. Hence, as an exploit coding fan, I suggest to rather use this shellcode for challenges and ROP your way for concrete and accurate socket-reuse explo&hellip;", "Hacking isn’t a superpower, it’s just a skill (and that’s why it’s so much better than if it were a superpower). It’s not so much a strictly defined thing as much as it is a way of thinking. Science isn’t one thing. It’s a process. Hacking isn’t one thing, it’s a process (or rather, the breaking ap&hellip;", "I really like to see whats in the directory I change into, so function cdls() { cd $1 ls } alias cd=cdls", "In this paper I will present an elegant technique (it’s my opinion, indeed) to get shell access to a vulnerable remote machine. It is not my own technique but I found it very interesting. The focus of this paper is on this technique and not in the way to exploit the vulnerability. Setting your envi&hellip;", "Ayyye, another malware guy! I’d say stick with C/C++ for malware since you have more power over your resulting binary which destroys antivirus’ signature-based detection. Having said that, assembly is probably a favourable addition upon them, especially for reverse engineering compiled binaries. If&hellip;", "When using vim go in command mode (press ESC) and then: :%!gpg --clearsign Then to save it to a file :w myfile.asc", "@SmartOne As Joe_Schmoe told, it’s a way of exchanging keys and is popular for it’s application in AES. Where as Rijndael is the block cipher algorithm used in AES. Hope this cleared up my ambiguous statement I made above. My bad! Regards, Cal0X", "@SmartOne As Joe_Schmoe told, it’s a way of exchanging keys and is popular for it’s application in AES. Where as Rijndael is the block cipher algorithm used in AES. Hope this cleared up my ambiguous statement I made above. My bad! Regards, Cal0X", "I might be wrong, but did you mistake Diffie Hellman with Rijndael?", "Diffie Hellman key exchange is a way to share an encryption key over an insecure channel. An example from wikipedia: Alice and Bob agree on a prime modulus P = 23 and a base G = 5. Alice then chooses a secret integer, A = 6. Bob also chooses a secret number, B = 15. Alice then computes C = G^A mod&hellip;", "So you’re saying people should fall into censorship because they’re not l33t enough @pry0cc?  [image] -Phoenix750", "https://help.riseup.net/en/vpn Try it.", "Personally I don’t have any experience with Arch and Gentoo yet. I think it depends on one’s personal use case which one to chose. For people who want to compile everything theirself, although possible with both, Gentoo may be the better choice. Users who are more happy with having a precompiled ker&hellip;", "Users who can’t be bothered to even have a look at their kernel config, rather. jk You’re right.", "Wise Words @SmartOne. @kowalski go onto freenode#archlinux and type “!best”.", "Wise Words @SmartOne. @kowalski go onto freenode#archlinux and type “!best”.", "Personally I don’t have any experience with Arch and Gentoo yet. I think it depends on one’s personal use case which one to chose. For people who want to compile everything theirself, although possible with both, Gentoo may be the better choice. Users who are more happy with having a precompiled ker&hellip;", "Personally I don’t have any experience with Arch and Gentoo yet. I think it depends on one’s personal use case which one to chose. For people who want to compile everything theirself, although possible with both, Gentoo may be the better choice. Users who are more happy with having a precompiled ker&hellip;", "I run a Ubuntu minimal installation with systemd. I understand linux decently and I just don’t want to bother with the hoop-jumping necessary for Gentoo or LFS. I’ve had no problems with my setup (granted, it’s only a week or so old)… I also run – GASP – macOS.", "IntroductionLinux has been around for 25 years now. I started using it as my main OS around 2 years back (was quite young then and n00bish). I did not care to learn much about it, I just used it to do my homework and some personal stuff. Not long ago I decided to switch to ArchLinux from Ubuntu Mat&hellip;", "Cryptography is an ancient mathematical science that was originally used for military communications, and designed to conceal the contents of a message should it fall into the hands of the enemy. Recent developments in cryptography have added additional uses, including mechanisms for authenticating &hellip;", "Hello, This is a python tutorial on programming a reverse shell with RSA encryption. I like to mention that this post is more about understanding the cryptography involved in the shell rather than the shell itself. The github link is https://github.com/ca10x/RSA-reverse-shell. ListenerFirst we ne&hellip;", "Hi fellas, Following the practical cases of @VoidAccess, I wanted to introduce you the reputation trust model and a piece of history behind PGP. As you probably already know, PGP, which stands for “Pretty Good Privacy”, has been developed by Phil Zimmermann in 1991. The general purpose of this tec&hellip;", "I’d quite like to use this time as well to thank @SmartOne for his very kind donation of 50 euros! Thank you also to everybody who’s donated anonymously!", "I’d quite like to use this time as well to thank @SmartOne for his very kind donation of 50 euros! Thank you also to everybody who’s donated anonymously!", "Good day all, Seeing as this is my first real post here, and I’m fairly certain a few of you know me, but the large majority don’t, I’ll introduce myself a little, and then continue from there. Names Mike, I go by L0k1 online, which is what most of you will come to know me as. I’ve been involved i&hellip;", "I’m loving these setups! SO MANY GOOD IDEAS TO BORROW! I try to keep my setup hardware agnostic and *nix oriented. As such, just about everything that makes my setup mine is saved in my dotfiles. That was I can jump into a new machine of almost any nix flavor and be ready to rock right away. That a&hellip;", "I don’t run any fancy OS (just a Win10 + ParrotSec in dual boot), but I am happy to share my powerful hardware setup for those who are interested: CPU: I7-6700K: This is probably the best price-performance CPU on the market, hands down. With a base clock of 4GHz and 4 physical cores, which can be e&hellip;", "The web client works for me! Also, the page seems to be up: http://isup.me/kiwiirc.com Maybe your browser/ad-blocker blocks the request?", "The web client works for me! Also, the page seems to be up: http://isup.me/kiwiirc.com Maybe your browser/ad-blocker blocks the request?", "Apparently kiwiirc.com just blocks all SSL connections from Russia. It’s reachable from my VDS in Germany but it’s not from my laptop. Everything is OK with pings and port 80 in both cases.", "The web client works for me! Also, the page seems to be up: http://isup.me/kiwiirc.com Maybe your browser/ad-blocker blocks the request?", "Hi, 0x00sec. Long time no see  I got a new hobby - electronics. And I would like to recommend a book that helped me a lot with it. The book is “Make: Electronics” by Charles Platt. Best thing about it is that you can order a book with all necessary components (a.k.a starter kit). Also it’s transla&hellip;", "This is the second in a series on ssh config files IntroductionThe previous article in this series was an introduction to the ssh config file, how it can be used, and a teaser of some of the possibilities. You’ve probably already figured out that it’s quite easy to set common config strappings suc&hellip;", "Thanks @SmartOne. All my code is GPL so anybody can use/modify/redistribute it. Be free to put it anywhere you want and modify it as you wish. Just, please, honour the GPL license and release publicly any modification you do to the code also as a GPL module. That’s it.", "Nice concept! Maybe you could put it on our 0x00sec Gitlab?", "Yesterday, I joined the 0x00sec IRC channel and, as many other times, @dtm come up with an interesting concept… and I had to try. The idea was pretty challenging and I have not completely come up with a full implementation but I manage to get a minimal Proof of Concept program to illustrate the conc&hellip;", "Nice concept! Maybe you could put it on our 0x00sec Gitlab?", "ofc, but it is salted iirc.", "Well, if I didn’t overlook sth, it shouldn’t take too long to crack it  I could be wrong though https://www.phillips321.co.uk/2012/04/04/cracking-an-md5-of-an-ip-address/", "@pry0cc should get it", "It’s not your fault, I think @pry0cc posted an old one here. This one should work: https://blog.0x00sec.org/donations/", "They do! Somebody reported an issue but it appears to be okay on our side.", "Do credit card donations work atm?", "Do credit card donations work atm?", "And of course we could do something like Proxychains -&gt; TOR -&gt; VPN to make it even harder for them", "This is cool, but all the tech in the world won’t save you from bad opsec. Remember that.", "Of course, don’t forget the SSH tunnel either", "Of course, don’t forget the SSH tunnel either", "And of course we could do something like Proxychains -&gt; TOR -&gt; VPN to make it even harder for them", "And of course we could do something like Proxychains -&gt; TOR -&gt; VPN to make it even harder for them", "I might be wrong, but I think that there should be an only in there. If you do normal stuff over TOR too, it’s going to be marginally harder for Law Enforcement to link an online crime to you. It would no longer be a case of “he usually doesn’t use TOR, but he did on that day and that’s when x got h&hellip;", "I might be wrong, but I think that there should be an only in there. If you do normal stuff over TOR too, it’s going to be marginally harder for Law Enforcement to link an online crime to you. It would no longer be a case of “he usually doesn’t use TOR, but he did on that day and that’s when x got h&hellip;", "@Nitrax or @pry0cc //20chars", "@pry0cc should get it", "Part 1: Pimp my SSH~/.ssh/config is a blank canvas full of possibility. Over the next couple posts I’m going to talk about fun things you can do with SSH and the config file. Most of the time the use case for SSH is pretty simple: ssh foo@bar and done. Every once in a while we need to get slightly&hellip;", "Exactly. His beef is that it encourages bad behavior with the key management and WoT.", "Hi Guys, I’ve been lurking around here for some time now, and I have only now realized that there is no 2FA Implementation on 0x00sec! Either I’m totally stupid  and can’t find the setting, or this feature has to be implemented. Maybe some OTP that I can add to my Google Authenticator? Do we need &hellip;", "Yes, that could indeed be a problem. It would generally be nice to look at getting the authentication to a (self hosted) SSO server, because then we could even integrate gitlab with it!   https://meta.discourse.org/t/official-single-sign-on-for-discourse/13045", "Hi Guys, I’ve been lurking around here for some time now, and I have only now realized that there is no 2FA Implementation on 0x00sec! Either I’m totally stupid  and can’t find the setting, or this feature has to be implemented. Maybe some OTP that I can add to my Google Authenticator? Do we need &hellip;", "Wow! That’s very kind! We have Bitcoin payments at the present, and will need to re-organise PayPal as well as I’ve caught word it isn’t working. I pay personally for the VPS which is $20 per month. 20x12 = $240. Donations are pretty slim although we’ve had some very kind people donate! The current&hellip;", "For everyday messaging of course.", "Valid points! I’m looking to donate 50€ as a Christmas present  Just have to figure out how to get the money to you anonymously. How much do you actually need per year to keep the site running(at a normal performance level)?", "For everyday messaging of course.", "Of course as it has been established for a longer time (and therefore more people should have looked over the code), it should be more trustworthy. He does state that PGP for encryption is secure, it is rather about the entire design of long term key usage. My interpretion is that for everyday messa&hellip;", "I think a 3rd party would be better for stability, where as I think a self-hosted solution would be better for the privacy of the users - my only worry is that I don’t think we have the processing power.", "Of course as it has been established for a longer time (and therefore more people should have looked over the code), it should be more trustworthy. He does state that PGP for encryption is secure, it is rather about the entire design of long term key usage. My interpretion is that for everyday messa&hellip;", "Looks decent! Does this mean we would need a own oauth server or rely on a third party?", "Or this https://github.com/discourse/discourse-oauth2-basic", "Of course it would mean a bit of work, but it would be a long-lasting clean solution", "This is a very good idea. @oaktree thoughts?", "Yes, that could indeed be a problem. It would generally be nice to look at getting the authentication to a (self hosted) SSO server, because then we could even integrate gitlab with it!   https://meta.discourse.org/t/official-single-sign-on-for-discourse/13045", "I would love 2FA! One issue though… Discourse. I will look around, but I’m not sure we’ll be able to get this working on Discourse. We can all request it from the Discourse devs though. Nice suggestion though!", "Hi Guys, I’ve been lurking around here for some time now, and I have only now realized that there is no 2FA Implementation on 0x00sec! Either I’m totally stupid  and can’t find the setting, or this feature has to be implemented. Maybe some OTP that I can add to my Google Authenticator? Do we need &hellip;", "His main premise is that the web of trust model fundamentally breaks several important things, such as encouraging long-lived keys. I’m a fan of GPG for encryption, but I’ve always found it unwieldily for communication. Thoughts?", "Hi. This is another great suggestion. We’ll have to look into what our forum platform provides for us first… Thank you.", "Hi Guys, I’ve been lurking around here for some time now, and I have only now realized that there is no 2FA Implementation on 0x00sec! Either I’m totally stupid  and can’t find the setting, or this feature has to be implemented. Maybe some OTP that I can add to my Google Authenticator? Do we need &hellip;", "LOL “even me.” What’s that supposed to mean?", "Thanks for the clarification!", "Well, let’s look at it; pretend you’re a sysadmin investigating the damage. If they see an IP address take 5 GiB of dumps way before the leak was released; it’s obvious you’re the recieving end and thus the attacker. If it goes to say a upload site like Mega, then Mega appears to be the attacker; bu&hellip;", "Well, let’s look at it; pretend you’re a sysadmin investigating the damage. If they see an IP address take 5 GiB of dumps way before the leak was released; it’s obvious you’re the recieving end and thus the attacker. If it goes to say a upload site like Mega, then Mega appears to be the attacker; bu&hellip;", "So you mean that it would stand out in the logs if one accesses the data over TOR? I get this but what do you mean by “download it when everybody else does?” When legit users access the site?", "Hi everyone. We’re moving from freenode to irc.0x00sec.org. Connect with SSL on port 6697 and make sure you “accept invalid certificates.” EDIT:", "Nice! I haven’t used qubes before. I’ve heard it’s good though?", "So you mean that it would stand out in the logs if one accesses the data over TOR? I get this but what do you mean by “download it when everybody else does?” When legit users access the site?", "Well, it’s clear to me that one shouldn’t do this", "Well, it’s clear to me that one shouldn’t do this", "Data correlation attacks are the #1 killer of large-scale hackers. So when you compromise that site with SQL injection, don’t download it over Tor. Upload it from the server and then download it when everybody else is downloading it. Of course make a sha256sum,", "@SmartOne : An example would be routing some DDoS through the TOR network.", "Data correlation attacks are the #1 killer of large-scale hackers. So when you compromise that site with SQL injection, don’t download it over Tor. Upload it from the server and then download it when everybody else is downloading it. Of course make a sha256sum,", "Maybe a really silly noob question, but what do you exactly mean by ‘Don’t hack over TOR’?", "Hm ok. Let me see…", "@SmartOne : An example would be routing some DDoS through the TOR network.", "So, I see very few anonymity tutorials on this site, which is ashame because it’s one of the most powerful proficiencies you can master in this industry. So, let me tell you step by step how to acquire the stealthiest and sexiest anonymity setup, and how you can hide from every three-letter agency.&hellip;", "Maybe a really silly noob question, but what do you exactly mean by ‘Don’t hack over TOR’?", "I can’t play the video. Can you fix it?", "Ok here is my setup! I run ArchLinux with the i3 tiling window manager. This is configured by myself using a very heavily modified version of OxHak’s config. I am using conky for the top bar. My anonymity setup is fairly simple. I have a collection of VPN’s and I connect to a different one every da&hellip;", "Hello, my loyal 0x00’ers! You are reading my 4th Installment of Paranoia and a Terminal! Today we are going to discuss how to set up a Tor Service; and how to access it. Tor services are a really good addition to your toolkit as a Paranoid hacker. Tor can be used as an Anonymity tool, but providing&hellip;", "Note that you will need to have GnuPG (GPG)  installed before starting the tutorial. First, a bit of background as to how this works: A digital signature certifies and timestamps a document. If the document is subsequently modified in any way, a verification of the signature will fail. A digit&hellip;", "We live in a post-Snowden world. For many, that means assuming none of your digital assets are safe from surveillance. There are ways, however, to use the internet and insane mathematics in your favor to ensure that no one can see whatever it is that you’re sending to someone else. It’s called PGP&hellip;", "Well, I promised you a complete description of my setup so here we go. The main con that I faced at work was the hardware performance. Indeed, my machine was so slow that I could not even run firefox and my virtual machine at the same time … Consequently, I designed my environment to be as much as &hellip;", "5 months later. We were relying on suser for this CTF. Although he has failed to live up to expectations. It hasn’t happened yet, no reason though why it still can’t happen.", "5 months later. We were relying on suser for this CTF. Although he has failed to live up to expectations. It hasn’t happened yet, no reason though why it still can’t happen.", "Has there been any progress with this or did I miss sth?", "This is a very thorough write up of an old but previously unknown 0day exploit for Ubuntu 12.04.5, leveraging libgstnsf.so in gstreamer 0.10.x to bypass 64-bit ASLR and DEP. Essentially that version of gstreamer uses 6502 assembly code to emulate the NES’ CPU and sound hardware in realtime, which d&hellip;", "That’s a pretty great suggestion. Thanks.", "It would have been nice to configure some sort of SingleSignOn with the gitlab site, so we wouldn’t need a new account  This way we could make stuff available only for regulars", "That’s a pretty great suggestion. Thanks.", "It would have been nice to configure some sort of SingleSignOn with the gitlab site, so we wouldn’t need a new account  This way we could make stuff available only for regulars", "It would have been nice to configure some sort of SingleSignOn with the gitlab site, so we wouldn’t need a new account  This way we could make stuff available only for regulars", "Hey guys, a few days ago, I found this on GitHub. These are “Information Assurance” tools made by the NSA. Most of them are about attack mitigation, but I REALLY don’t trust this. I haven’t read the complete source code yet, but I wonder why the NSA would share tools that could help to keep them o&hellip;", "Hi, I hope this doesn’t count as spam already, if so, please contact me, admins. After I found the NSA Tools on GitHub, I looked around a bit further. I finally found an awesome collection of Computer Science course videos, from really high-level universities such as MIT. There is an endless arra&hellip;", "Hi fellas, As part of my work, I did plenty of researches about hacking / pentesting operating systems in order to find which one could be the most suitable for my needs. Chose his operating system is crucial and avoids unpleasant surprises that could lead to an incredible wastage of time (tools in&hellip;", "Welcome back! So in my previous post we talked about extracting the places.sqlite file from our target’s computer and there were a couple of things I forgot to mention. First, what actually is a profile? Below is how Mozilla defines a User Profile: ###Mozilla’s Support Page - All of the changes &hellip;", "Agreed. Also if you’re a lucky insider you’ll know about offline.0x00sec.org Which is just insanely basic snapshots in pure 100% static html + CSS no linked scripts or JavaScript of any sort. This is totally on the DL rn.", "0x00sec has used Cloudflare for a while; mainly for security reasons. Cloudflare is great. And it’s secure as well. But one thing is a little annoying. Captchas. I use Tor on a daily basis, and the two biggest problems with Tor are Exit Nodes and Captcha’s, Exit nodes have been notorious for runnin&hellip;", "Hi fellas, Following my conversations with you guys on IRC about the job of pentester, I decided to introduce you the different facets of a pentesting and maybe enlighten gray areas that remain in this domain. Disclaimer : Once again, it will be a long reading  PentestingCompanies spend millions&hellip;", "What happened with this in the end?! Cmon guys. We need to step up our collab game  There are a few projects on the Gitlab but mainly it’s Me, Jschmoe + Oaktree.", "Hi Friends, In the last time, I’m trying to get deep in the windows Internals section. I found some stuff that maybe can help you also: Windows Internals 6th (Part 1 &amp; 2): http://materias.fi.uba.ar/7508/WI6/Windows%20Internals%20Part%201%20(6th%20Edition).pdf http://materias.fi.uba.ar/7508/WI6/&hellip;", "It’ll be out in this or next week.", "It’ll be out in this or next week.", "@dtm When will this be out? Waiting for it", "It’s not that the attacker needs to send the packet, it’s that the victim needs to receive one. Due to TCP’s error checking/correction, if you did stop the outgoing RST packets, the victim will follow protocol and keep sending SYN-ACK packets until it gets a response or times out (if the port is ope&hellip;", "AFAIK no port scanner sends a RST packet during the scan. Only the SYN packet is sent. What happens is that, as we are not calling connect the TCP/IP stack in the kernel does not know about any connection going on and it responds to the unexpected SYN|ACK packet with a RST, as it does for any unexp&hellip;", "I small note about SYN scans. The server will always respond to a successful connection request with a SYN-ACK, it’s just the way TCP works. The reason the SYN scan works is because the attacker responds to a server with an RST packet, closing the connection before it’s actually established. This i&hellip;", "Hello, 0x00’ers! Welcome to my third (Yes 3rd) instalment of Paranoia and a Terminal! In this episode we will explore URL Forensics - for the Paranoid. In other terms, viewing a site or viewing a link, without falling victim to a social engineering attack if our spidey sense rings alarm bells. Scen&hellip;", "Hello my 0x00sec - Padawans! In this instalment of Paranoia and a Terminal, I am showing you how to create + use (my) AWESOME tmuxinator setup. Person: “Errrr. Whats that?” Me: “It’s a sort of automation package for tmux” Person: “Coool!.. So. Whats tmux?” Me: “Tmux is a Terminal Multiplexer, so&hellip;", "With the announcement of pupper and a few other things over these last few months, our collaborative effort is off to a nice start. Many of us regulars have been working together on a handful of projects. We’re now offering a place to put all those projects! In order to draw in more of you, the Adm&hellip;", "Hello, my 0x00’ers! You may have noticed @0x00pf’s awesome reverse engineering content, and you may have noticed he has posted raw binaries (without source), now, of course, it’s reverse engineering, the challenge is about not knowing the source. But how do you and I know that @0x00pf is not a mad &hellip;", "Lately I’ve been messing around with parrot and I ran into this awesome tool by the name of Golismero. When I first ran Golismero I was blown away at the awesomeness of this tool and now I’ve decided to create a cheet sheet for the tool itself. GolismeroFirst is of course the help page, type: sud&hellip;", "Are you a newbie who’d like to get into web penetration testing? This might be of help: https://pentesterlab.com/bootcamp", "When someone has too much time on their hands (and usually also has a lot of work to do), their productivity sometimes slips… and by “slips”, I mean it completely collapses into itself and implodes. ANYWAY, back to the focus of this thread, I decided to have some fun with my newly installed Windows&hellip;", "A question that @0x00pf may be able to answer: Why does the hack only possible with the Phison microcontroller? Is it the only one vulnerable or did no one create “hacks” for other microcontrollers? Anyway, great post!", "If you had read Part II of this series you may have missed a couple of details. Consider this post as a short addendum to Part II including those details. The first you may have noted is that there was no ARM or MIPS code in there. Actually, the paper was already quite long and, to be honest, I tho&hellip;", "Hello my lads. I take pride in using Linux, and I highly recommend it to anyone who wishes to become proficient in this industry. With Linux being my recommended OS, I also encourage Sana as your go OS when needing effective tools. Installing Sana aka. Kali Linux There are many ways to install thi&hellip;", "Hey mates, today I’ve got a much more interesting challenge for you to solve . We’ll reverse a CrackMe and expand our skills in MSIL Patching to dump the unpacked executable straight from within the program. This will be much more complicated than our copy &amp; paste solution from last time but when y&hellip;", "Yes. I know. When I edit the post it looks OK in the edit window, but when I submit the update, the tag is not processed. Do not know why", "Yes. I know. When I edit the post it looks OK in the edit window, but when I submit the update, the tag is not processed. Do not know why", "@0x00pf: The spoiler tags in your post don’t seem to work in my browser, while these in the comments do work. Could you check it? Screenshot:  [image]", "@0x00pf: The spoiler tags in your post don’t seem to work in my browser, while these in the comments do work. Could you check it? Screenshot:  [image]", "Hey mates! Maybe some of the elder members remember my series about C# CrackMe Challenges. After a little break where I focussed on other stuff I’m now back with an introduction to MSIL patching. Before you start with this post I recommend you to have a look at my other parts first . They teach som&hellip;", "LOL. Nice riddle!  How to get it: Open the site and take a look at the HTML-Code: &lt;html&gt;&lt;head&gt;&lt;script src=&quot;load.js&quot;&gt;&lt;/script&gt;&lt;/head&gt;&lt;body&gt;&lt;/body&gt;&lt;h1&gt; Hello! &lt;/h1&gt;&lt;p&gt; Can you find &lt;a href=&quot;#Nice-try-you-sucker&quot;&gt;me?&lt;/a&gt; ... &lt;/p&gt;&lt;/html&gt;After falling for the awesome trap, you’ll instantly&hellip;", "LOL. Nice riddle!  How to get it: Open the site and take a look at the HTML-Code: &lt;html&gt;&lt;head&gt;&lt;script src=&quot;load.js&quot;&gt;&lt;/script&gt;&lt;/head&gt;&lt;body&gt;&lt;/body&gt;&lt;h1&gt; Hello! &lt;/h1&gt;&lt;p&gt; Can you find &lt;a href=&quot;#Nice-try-you-sucker&quot;&gt;me?&lt;/a&gt; ... &lt;/p&gt;&lt;/html&gt;After falling for the awesome trap, you’ll instantly&hellip;", "LOL. Nice riddle!  How to get it: Open the site and take a look at the HTML-Code: &lt;html&gt;&lt;head&gt;&lt;script src=&quot;load.js&quot;&gt;&lt;/script&gt;&lt;/head&gt;&lt;body&gt;&lt;/body&gt;&lt;h1&gt; Hello! &lt;/h1&gt;&lt;p&gt; Can you find &lt;a href=&quot;#Nice-try-you-sucker&quot;&gt;me?&lt;/a&gt; ... &lt;/p&gt;&lt;/html&gt;After falling for the awesome trap, you’ll instantly&hellip;", "LOL. Nice riddle!  How to get it: Open the site and take a look at the HTML-Code: &lt;html&gt;&lt;head&gt;&lt;script src=&quot;load.js&quot;&gt;&lt;/script&gt;&lt;/head&gt;&lt;body&gt;&lt;/body&gt;&lt;h1&gt; Hello! &lt;/h1&gt;&lt;p&gt; Can you find &lt;a href=&quot;#Nice-try-you-sucker&quot;&gt;me?&lt;/a&gt; ... &lt;/p&gt;&lt;/html&gt;After falling for the awesome trap, you’ll instantly&hellip;", "LOL. Nice riddle!  How to get it: Open the site and take a look at the HTML-Code: &lt;html&gt;&lt;head&gt;&lt;script src=&quot;load.js&quot;&gt;&lt;/script&gt;&lt;/head&gt;&lt;body&gt;&lt;/body&gt;&lt;h1&gt; Hello! &lt;/h1&gt;&lt;p&gt; Can you find &lt;a href=&quot;#Nice-try-you-sucker&quot;&gt;me?&lt;/a&gt; ... &lt;/p&gt;&lt;/html&gt;After falling for the awesome trap, you’ll instantly&hellip;", "Hey lads! Somebody asked me earlier for a screenshot of my setup. I thought it would be a little too easy if I just gave him the link, so I decided to make a dead-simple CTF. However, a lot of people haven’t actually found the answer? So I present the challenge to you. Can you find the URL? https:&hellip;", "Yeah, I will do when I have some time.", "Yeah, I will do when I have some time.", "Sounds interesting! If you don’t mind, you could write a post about it!", "@SmartOne not quite. I didn’t use the teensy to do the same thing than you but I used the same concept.", "Hi @FFY00, Just want to ensure you didn’t get me wrong  My idea was to check if any plugged-in USB has the Phison microcontroller and the overwrite it with the BadUSB firmware. Did you accomplish this?", "I’ve already done this with the Teensy 3.2 You should check this also: https://github.com/samyk/usbdriveby", "Ahaha! Talking of this, have you heard of the redditor that was editing his paper in Latex and proceeded to get chucked out of Starbucks? The post has been deleted now, I don’t know if you guy’s can find the original? https://amp.reddit.com/r/linux/comments/qq8d3/chucked_out_of_starbucks_for_hacking&hellip;", "Still cannot believe this, but I was sitting in starbucks this morning writing up a research paper in latex, with some AUR packages compiling in a terminal… some woman walks past me and takes a look at my screen and then demands that I ‘stop hacking people’s passwords’, then runs off to fetch the m&hellip;", "Still cannot believe this, but I was sitting in starbucks this morning writing up a research paper in latex, with some AUR packages compiling in a terminal… some woman walks past me and takes a look at my screen and then demands that I ‘stop hacking people’s passwords’, then runs off to fetch the m&hellip;", "xD Some people are Such idiots", "Still cannot believe this, but I was sitting in starbucks this morning writing up a research paper in latex, with some AUR packages compiling in a terminal… some woman walks past me and takes a look at my screen and then demands that I ‘stop hacking people’s passwords’, then runs off to fetch the m&hellip;", "Still cannot believe this, but I was sitting in starbucks this morning writing up a research paper in latex, with some AUR packages compiling in a terminal… some woman walks past me and takes a look at my screen and then demands that I ‘stop hacking people’s passwords’, then runs off to fetch the m&hellip;", "Still cannot believe this, but I was sitting in starbucks this morning writing up a research paper in latex, with some AUR packages compiling in a terminal… some woman walks past me and takes a look at my screen and then demands that I ‘stop hacking people’s passwords’, then runs off to fetch the m&hellip;", "Glad to see you have come back to this humble course. Hope you are eager to get a lot more stuff to digest. Grab some coffee and relax. I have been claiming that this course is going to be different to all those that you find over the Internet. Right now, I should introduce a whole bunch of boring &hellip;", "Lets have a scrot party. This is why tiling wms rock!  [image]My i3 setup.", "A question that @0x00pf may be able to answer: Why does the hack only possible with the Phison microcontroller? Is it the only one vulnerable or did no one create “hacks” for other microcontrollers? Anyway, great post!", "Thank you for the clarification! I always had a dream of a “virus” that turns plugged in usb’s into bad usbs, but that doesn’t seem possible", "The USBarmory is a very neat device. It is more powerful that Arietta, but it cost more than 3 times more… Thanks for sharing the videos… Haven’t read the blog post yet", "Thank you for the clarification! I always had a dream of a “virus” that turns plugged in usb’s into bad usbs, but that doesn’t seem possible", "Hey @SmartOne, if you try to search for USB Flash controllers datasheets you will not find many that can be flashed over the USB interface. Many have some special interface (you have to hook up wires in those little pins) and most of them requires some proprietary tools that you only get if you are &hellip;", "The USBarmory is a very neat device. It is more powerful that Arietta, but it cost more than 3 times more… Thanks for sharing the videos… Haven’t read the blog post yet", "Hey Mates! This time I’ll tell you how you can build your own Bad USB for about 10$. It’s pretty easy, but requires a compatible USB Stick. RequirementsYou’ll need an USB Stick with the Phison 2303 (2251-03) microcontroller installed. Sadly you can’t just ask in your favourite hardware shop for &hellip;", "Thanks for sharing the Arietta board, looks very nice! I also find this video very interesting, because it shows the great possibilities of usb attacks!  The board used in the video also seems great. All in all, as always a high quality article by @0x00pf", "Hey @SmartOne, if you try to search for USB Flash controllers datasheets you will not find many that can be flashed over the USB interface. Many have some special interface (you have to hook up wires in those little pins) and most of them requires some proprietary tools that you only get if you are &hellip;", "Thanks for sharing the Arietta board, looks very nice! I also find this video very interesting, because it shows the great possibilities of usb attacks!  The board used in the video also seems great. All in all, as always a high quality article by @0x00pf", "Continuing the discussion from Plug In To Win - DIY Bad USB [Part 3/3]: You may have read the awesome “Plug In To Win” series from @TheDoctor. It make me recall some experiments I did time ago on HID injection. After some private chat, we agreed to release this extra post to present one more HW alt&hellip;", "Hey Mates! As promised I share a Powershell Keylogger with you, which can be used together with our Bad USB to be installed within just some seconds of physical access . This keylogger is not completly written by me! I used several ones on the internet and modified them to fit my needs . The origi&hellip;", "A question that @0x00pf may be able to answer: Why does the hack only possible with the Phison microcontroller? Is it the only one vulnerable or did no one create “hacks” for other microcontrollers? Anyway, great post!", "Yo. We aren’t NB xD We aren’t gonna censor this  If authorities want this gone then screw them!", "Would be great!", "Sorry, went off early yesterday, because I had to write an application for a work experience . I’ll have a look at both of them and try to figure out how it works . Maybe it’ll get a place as the fourth part?", "Sorry, went off early yesterday, because I had to write an application for a work experience . I’ll have a look at both of them and try to figure out how it works . Maybe it’ll get a place as the fourth part?", "True Story… I think teachers have nightmares of that little black box", "Looks nice!  I also found TwinDuck, which seems to do similar things (but there are some problems with it as some people write on the internet). Are you on the IRC?", "I’ve found this one . If I’m right this custom firmware is even able to be used as Mass Storage and Keyboard… Maybe I can find some further information on that .", "Nope, that’s not really what I wanted  Just a question: After the DuckyScript has been executed, can the device be used to store data?", "Yep, but that one is for identifying another plugged in USB Stick with the name ‘DUCKY’, where it then looks for a specific .exe, which is then executed . If you’re interested in it, I can write about it, but it require you to put in two Sticks (The Bad USB &amp; The Stick with the .exe).", "Don’t know much about the rubber ducky (planning to get one ), but did you have a look here?", "I thought about it too, but it seems there’s no way to use any files on the SD card. The Rubber Ducky emulates perfectly a normal keyboard and as such it can’t exchange data with the computer from it’s storage. I had two ideas to circumvent that: Write executables byte data hardcoded into the scri&hellip;", "Great Work! Can you also cover how to interact with executables stored on the internal sd card in the next tutorials?", "Hey Mates! This time I have a project of mine to share with you about the USB Rubber Ducky. Maybe some of you already heard of it, e.g. @Occupytheweb wrote an article about its use in Mr. Robot. At the end of this small series you should be able to write your own Scripts for hacking the box just w&hellip;", "Hi all, recently I have come across a couple of Open-Source Intel websites that I have come to find quite useful.  I do not know how old or common they are but I have just recently found them; https://www.punkspider.org - is a web application vulnerability search engine that scans for seven of the &hellip;", "Excellent tutorial! @0x00pf Can’t wait for part II!", "Excellent tutorial! @0x00pf Can’t wait for part II!", "If you are reading this is because you want to be a hacker. Therefore, you are automatically a wannabe. It does not sound that cool, but it is actually pretty cool. It means that you still have a lot of exciting things to discover!!! First things first. This is going to be a joint course on C and a&hellip;", "True Story… I think teachers have nightmares of that little black box", "Well most people I know have gotten in trouble with the school system for simply opening up command prompt. It’s hilarious.", "@Valentine I would really appreciate a tutorial about the Outlook thing you talked about", "@Valentine I would really appreciate a tutorial about the Outlook thing you talked about", "You wouldn’t like a post from me on how the Linux command-line works  Thanks for sharing your thoughts", "@Valentine I would really appreciate a tutorial about the Outlook thing you talked about", "Hello everyone. Valentine here with another tutorial. I would like to apologize for my absence for those that where interested in my last set of tutorials. I am back, for now. Anyways, on a more serious note. The topic of this tutorial is a very simple (not), but a very powerful tool, Google’s sear&hellip;", "I do have experience with AirVPN, and they are sufficient howvever take note they have servers in the US &amp; Europe which are two places there they could be demanded to hand over certain logs or have a forced closure.", "I do have experience with AirVPN, and they are sufficient howvever take note they have servers in the US &amp; Europe which are two places there they could be demanded to hand over certain logs or have a forced closure.", "Do you have any experience with www.airvpn.org? I think they are quite trustworthy", "What Is a VPN?VPN = Virtual Private NetworkIt’s a service that offers you anonymity to a certain extent. It creates a tunnel from your PC, to the server you are connecting to, and encrypts that tunnel so nobody can read whatever data is being transmitted. So you will be safe from eavesdropping, &hellip;", "I would greatly appreciate a tutorial on DLL-Injection! Big thanks for your Low-level series .", "Since we’ve recently covered DLLs and, in a timely manner, @0x00pf has given us a brilliant paper on infecting processes, I thought that I’d contribute my piece on IAT hooking using a method called DLL injection. In this paper, I will be detailing an implementation of a simple user mode rootkit as a&hellip;", "‘tmux’ is a terminal multiplexer for linux. It enables you easily switch between programs running in a terminal and to use a session-based approach to manage local and remote terminals (shells). I wholeheartedly encourage you to check this well written primer and make your terminal existence easier&hellip;", "I agree with @oaktree and @Defalt that dual/multi booting is one of the best options to try something directly on the hardware, BUT if you are completely new to the whole multi OS thing (which is completely ok) I would suggest to go with a VM, because of the following reasons: if you do not unde&hellip;", "Here’s a Cheat Sheet for the “interface” used at 0x00sec - Markdown", "Quassel is an IRC client which can be setup to have a core server, and a client, where the core is always up and running so that you are always available in IRC and also, ideally, have less connection issues etc, etc… Let’s just get right to it. Note: There won’t be a whole lot of explanation here,&hellip;", "Thats a pretty good reference! Good share.", "Here’s a Cheat Sheet for the “interface” used at 0x00sec - Markdown", "Thats a pretty good reference! Good share.", "Here’s a Cheat Sheet for the “interface” used at 0x00sec - Markdown", "Here’s a Cheat Sheet for the “interface” used at 0x00sec - Markdown", "Well, what about starting a wifi hotspot on your PC? P.S.: If your device is rooted (and your using Windows ), this application may work http://forum.xda-developers.com/showthread.php?t=1371345", "Well, what about starting a wifi hotspot on your PC? P.S.: If your device is rooted (and your using Windows ), this application may work http://forum.xda-developers.com/showthread.php?t=1371345", "Thanks @SmartOne . Really appreciate", "Thanks @SmartOne . Really appreciate", "Here’s a Cheat Sheet for the “interface” used at 0x00sec - Markdown", "In our walk in linux, there comes a point where we need to hack ( pentest ) in a safe environment. The first thing we usually do is install Virtualization Softwares and install all the distros our system can take. In stages of hacking, to compromise the victim machine, we need some sort of program t&hellip;", "Here’s a Cheat Sheet for the “interface” used at 0x00sec - Markdown", "EDIT, For up-to-date information on connecting to IRC: https://0x00sec.org/faq#irc Not sure if this is where I should post this, but couldn’t really pick an appropriate sub category of how-to and figured that this was best to be seen by every 0x00sec member as soon as they join so they can be part &hellip;", "What’s good, peeps? Initially, I was going to do a write up on an approach to programming an executable file infector (AKA a virus) however, I thought that it would be more interesting if we reversed and analyzed one. Throughout my journey with malware, I’ve never been quite able to grasp the mechan&hellip;", "(Yawn) Morning once again. Valentine here with another Nmap tutorial. This time I’m gonna talk about Scripts in Nmap. Scripts in Nmap are probably one of my favorite features. Not only can they figure out the users on the system but also bruteforce the password. I discovered these scripts not to lo&hellip;", "This was awesome; thank you! I love how the presenter was full of knowledge and kept the humor. An awesome talent!", "Well, as the site is accessible again, I think you resolved the error   If there are any other errors, I think we can’t help you without having the code posted.", "Watched the whole video! Definitely a good talk full of humor, but it also makes you think about the serious security problems. Anyway, great share!", "Hey y’all, I’ve recently stumbled onto securitytube.net’s MegaPrimer series. These videos are actually incredible introductions to a wide variety of security topics. What I’ve chosen to focus on is the Exploit Development series and since i’m in a bit of a lul at work I’ve decided to go through a&hellip;", "Well, as the site is accessible again, I think you resolved the error   If there are any other errors, I think we can’t help you without having the code posted.", "[TRANSLATION] [TITLE]  Question: Getting PHP Warning Error [BODY] Hi, So I have an eCommerce site (www.arganizylar.com) that i’m working on and i’m having an issue where users are unable to order anything. We keep getting the error: “TECHNICAL ERROR: unable to save account Details: Error throw&hellip;", "I somehow disagree with you. Why wouldn’t we use Phishing while doing a legitimate pentest?", "It’s cool, but I can’t find any compelling reason to use it instead of bash/perl/ruby/python?", "Nice very informational post!  Maybe this should also go under the news category, because it is sort of?", "[image]  Note: I am not suggesting this as replacement of your Linux shell, simply for learning purposes without having to boot into Windows, another tool in your belt. Here is an article by OTW on the subject of PowershellSo, Microsoft went to bed and bumped their head and now Powershell is ope&hellip;", "Looks like you aren’t registered. pick the nickname of your choice : /nick [yourname] then registering : /msg NickServ register [password] [email] replacing [password] and [email] with yours. also you might want to get a cloak by asking nicely to the ops. you can get a list of ops by typing : /&hellip;", "I somehow disagree with you. Why wouldn’t we use Phishing while doing a legitimate pentest?", "Hey mates! Just wanted to share this awesome DEFCON talk I found, about how a hacker found where his stolen desktop was and completely pwned the person who stole it! It’s pretty funny, and I’m sure if you haven’t seen it already you will enjoy it a lot! Link: https://www.youtube.com/watch?v=U4oB28&hellip;", "Well, this wasn’t obvious to me. Thanks for clearing things up!", "All bets are off in a legitimate pentest. As @EnergyWolf retorted, I did, in fact, mean maliciously.", "All bets are off in a legitimate pentest. As @EnergyWolf retorted, I did, in fact, mean maliciously.", "I somehow disagree with you. Why wouldn’t we use Phishing while doing a legitimate pentest?", "Well yes, but I’m sure @oaktree means maliciously.", "I somehow disagree with you. Why wouldn’t we use Phishing while doing a legitimate pentest?", "You should reply, but mess with him instead. Some guys of the Belgian national television once pulled this off, and it was funny as hell. -Phoenix750", "Hey guys! Check out this awful phishing attempt I received in my email! For OPSEC reasons, I’ve changed any occurrence of my name to “Doe.” Yes, he addressed me by my last name. Subject: Dear Doe,Message:Dear Doe, I am Barrister Fredrick Adonko, a Legal adviser to my late clientMr.D.E.Doe,a &hellip;", "This is awesome! I myself don’t know networking as much as I would like-  can’t wait for the first article!", "Hi ! Today I wanted to talk about how networks work. This is probably the first Tutorial of a Networking series. A lot of people on 0x00sec are good and have decent knowledge ( Programming, Social engineering or Networking ). This series is intended to Newbies and people who want to expand their k&hellip;", "Whoa, such a great Post!!  I knew about the Android Shell, but not that I could recompile it.", "You know. Spelling Matters.", "No chance of accessing wifi… Come on dude, are you a hacker or not?", "Watched the whole video! Definitely a good talk full of humor, but it also makes you think about the serious security problems. Anyway, great share!", "Here are just a few fresh security-related links from Twitter that look interesting: I Want to Know What Code Is Running Inside My BodyUDPack - An Extensible Generic UDP Packet ObfuscatorCertificate Bypass: Hiding and Executing Malware from a Digitally Signed Executable [PDF]AVLeak: Fingerprint&hellip;", "Watched the whole video! Definitely a good talk full of humor, but it also makes you think about the serious security problems. Anyway, great share!", "I really enjoyed this Defcon talk, because it’s about something that we all see and use everyday, but probably take for granted. And yet, there is a whole world of interesting vulnerabilities and potential for exploitation attached. It’s a good reminder to look for the stuff that hides in plain sigh&hellip;", "Let’s turn this into a series shall we. PersuasionWe want to convince our victim to conduct a certain action. In order to fulfill such tasks, we need to make them feel compelled to do so. How would we go about this without exposing our true intentions? First, let’s just grasp the true power of th&hellip;", "power greater in scope or magnitude than that which is considered natural or has previously existed. Hacking doesn’t sound like any of that. Hacking is a natural instinct in humans, even if it isn’t computer-related. so both the “natural” and “previously existed” arguments can be declared as inva&hellip;", "Such a decent argument. I’ve almost got no arguments left. But I’ll see how many more rounds of devils advocate I can play. Cooks aren’t super (no disrespect to cooks!) because a lot of them exist.  After all, the value of something is often defined by its scarcity. If everybody was a millionaire, &hellip;", "Hacking in my opinion is merely a skill. It’s how you use it that can make it a superpower. However it is a bit funny because people often think of hackers as having superpowers- but that’s only because of how the media portrays them.", "@pry0cc I wouldn’t underestimate the skills cooks have. And there are quite surprisingly many people who are capable of hacking. But I took cooks as an example. We could instead also say the same for martial artists, SAS soldiers, etc… While it is true that Bruce and Tony have spent a lot of time o&hellip;", "I think we can draw a conclusion already from this debate: Hacking itself is not a superpower, but it can be used to achieve superpower-like things. -Phoenix750", "Weird. It was working last night on my desktop, just tried now, not working (on mobile) I’ll have to see what that’s all about.", "Nope, doesn’t work  [image]", "Nope, doesn’t work  [image]", "They work for me? Try the top.rss one again?", "Just tried the links, but it says: Oops! That page doesn’t exist or is private. Can you fix that?", "[image] Shortly afterwards, @pry0cc found out that if you change your nickname to a command such as echo, then type in this: “@topic 882;something”, the command would be executed with “something” as an argument. The problem lied in the way the bot interfaced with discourse, by executing a shell co&hellip;", "I recently have just finished watching “The Internet’s own Boy”; a film about Aaron Swartz. He alone has achieved a lot in terms of politics and ‘hacking’ society before his tragic suicide. During the Documentary he and his brothers speak of Programming being a super power, as they are able to achi&hellip;", "I can see your reasoning and appreciate your point of view. The way we define if it is, or not, stems from our definition of super power. This dictionary puts it as [quote] &quot;power greater in scope or magnitude than that which is considered natural or has previously existed.[/quote] I don’t think po&hellip;", "Hacking is not a super power. It’s a skill. It’s as simple as that. Unless you can raise traffic barriers, bridges, explode helicopters, stop trains, etc. with just a single push on your phone, like you can in W_D, hacking is not a superpower. And let’s not forget that Aiden is NOT hacking with his&hellip;", "Whoa, such a great Post!!  I knew about the Android Shell, but not that I could recompile it.", "Py3 rewrite, idea credit goes to @pry0cc The only difference is that it displays full weather info (too lazy to crop). You can download the script from pastebin. --------------------------------------------------longitude: -122.0574latitude: 37.4192region_code: CAcountry_name: United States&hellip;", "Whoa, such a great Post!!  I knew about the Android Shell, but not that I could recompile it.", "Do you know your Android phone have a shell?. Do you know that it is a reduced version of busybox?. Do you know you can recompile it and add some important missing applets? If you don’t, keep reading. This is gonna be quick and easy! NOTE: This a rewrite of something I wrote some time ago for othe&hellip;", "I think it’s time I add: Counter-attacks are still attacks. As such, they will be treated as any other kind of hacking attempt, meaning there can be severe consequences. What you’re doing should only be a PoC.", "Well, letting it blindly bruteforce things could be a bit dangerous (especially if its the NSA who tried to hack you ) So I think at least a confirmation by the user would be better.", "The script is called HackBack because I wanted hack the hacker. I planned on doing a lot of thing : Get password tried by hacker to have some good worlistGet username tried by hacker to have some good worlistpossible feature Use proxy/vpn and/or tor to bruteforce Search if an exploit is a&hellip;", "Yes. Thats absolutely what I think should happen", "Well, letting it blindly bruteforce things could be a bit dangerous (especially if its the NSA who tried to hack you ) So I think at least a confirmation by the user would be better.", "Very very very nice  I once thought about this, but I never got round to it!  Perhaps upload on github?", "Hello World ! Today, I look the auth.log file from my VPS and I see a lot of bruteforce attempt. I decided to make a python Script called HackBack. This script will get the ip who failed to log in your server and do a passive recon with the shodan api. Here is the script : #!/usr/bin/python3.4im&hellip;", "Hello Hackers ! I’m back for a new tutorial on scripting with python, here I will teach you how to do web scraping. I needed to grab some proxy on internet to test proxychain so I decided to do a python script who will scrape the proxy for me. ProxyScrapingFirst of all you’ll need python and som&hellip;", "Bump. Updated information.", "Okay! All Done, now just remove your title, and set your full name name to your “title”.", "Welcome back command-line ninjas, I wanted to take a small break from Trix’ with Linux and decided to write myself a tool. I noticed nothing was really out that would give you a comprehensive overview of an IP, which is awesome for Recon, and being totally 1337  This tool is written in ruby and uti&hellip;", "It’s my first time using this service, so please warn me if something goes wrong. Here’s the link: https://mega.nz/#!XJYygKjZ I’ll PM you with the Decryption Key EDIT: If anyone else is interested, please let me know!", "Intro Hey guys, this post (as you can see from the title) is about how to use your Android device as a wireless adapter! It’s a really simple trick, although I’m sure you guys might like it. Having said that lets get right into it!  Just a Bit of Backstory So why would you need something like th&hellip;", "Some time ago, we explored the idea of a simple crypter for ELF files ( A simple Linux Crypter). In that post, we explored a simple technique to modify the code of a program at run-time. In that specific case to decrypt parts of the code that were crypted beforehand by an off-line tool. In this art&hellip;", "First post, I hope someone finds those usefull Quick accessalias aliases=&quot;nano ~/.config/zsh/.aliases&quot;alias i3config=&quot;nano ~/.config/i3/config&quot;Typo helpersalias l=&#39;ls -CF&#39;alias sl=&#39;P=(&quot; &quot; █ ░ ▒ ▓); while :; do printf &quot;\\e[$[RANDOM%LINES+1];$[RANDOM%COLUMNS+1]f${P[$RANDOM%5]}&quot;; done&#39;alias cd..&hellip;", "Nice share!", "Few weeks ago I ran into this tutorial series of an obviously experienced linux user. It starts assuming you know nothing and is meant to prepare you for  Linux Professional Institute’s 101 exam, however I find it as a good reference for many things, including inodes, globing, regex introduction, FH&hellip;", "Hi, it’s just a logic gate. It doesn’t really matter what the values are. It’s only true if one input is on and the other is off, true false, 1 0, etc. Thank you, -Fust3rCluck", "Hi, it’s just a logic gate. It doesn’t really matter what the values are. It’s only true if one input is on and the other is off, true false, 1 0, etc. Thank you, -Fust3rCluck", "Seems like it might be my solution to my computer sleeping when watching films xD  [image]", "Greetings, all. The following paper will be documenting an example of executable compression, AKA packers which I have developed over the past couple of days. Like crypters, I feel as though they are some form of hidden dark art of the underground communities. Though there are many publicly availabl&hellip;", "In my social engineering hypothetical short story, I introduced a file binder executable which I developed and under @pry0cc &#39;s request, here’s a how-to on using my file binder. Disclaimer: This is just a PoC so don’t expect anything amazing. First you want to load up Window’s command shell and fi&hellip;", "A Tumor Called MarlaHi everyone, today we will cover how to hide our malware from the user and run our malware as a service. When the Malware run for the first time it will hide the app icon from the user laucher, and run a service. The service only query the OS version for the moment, we will b&hellip;", "Let’s put away the serious stuff for a while and let’s have some fun. What about some hacking pranks!. Let’s start with something simple, the so called nervous mouse. Note: The code is a modification of some example from internet. I cannot recall where I got it, but it is, let’s say, the default ex&hellip;", "@L3akM3-0day No problem", "@L3akM3-0day No problem", "Yeah this is true. I found some free hosting thing https://www.assembla.com/, https://bitbucket.org/ or S^3 can host the collab thing ( This way it could be more private ) :). I just wanted to make a Topic too make it clear  ( Yeah I forget to mention @SmartOne, My bad  ).", "May I interject xD I believe @SmartOne originally had this idea, so lets just give the credit’s where it’s due  My thoughts were that S^3 could host it. Also, there is no law on creating malware that is fully evil, this is the internet, and this is offensive security. We are making it to help prote&hellip;", "#0x00SEC Tools : Collab Hey ! Some of you read the Android RAT ( by the way it is a really good post  ). Some member of the 0x00Sec suggested to make a 0x00SEC Git for collaboration. I think it can be a great thing :). We can make our own tool to help strenghten our security or trap hacker ( Pass&hellip;", "Yeah this is true. I found some free hosting thing https://www.assembla.com/, https://bitbucket.org/ or S^3 can host the collab thing ( This way it could be more private ) :). I just wanted to make a Topic too make it clear  ( Yeah I forget to mention @SmartOne, My bad  ).", "May I interject xD I believe @SmartOne originally had this idea, so lets just give the credit’s where it’s due  My thoughts were that S^3 could host it. Also, there is no law on creating malware that is fully evil, this is the internet, and this is offensive security. We are making it to help prote&hellip;", "Insanely cool idea! Perhaps S^3 can look at hosting it, they have a spare server lying around  @Sstrykerr @Suser", "So it would be to risky to get detected if you upload it to GitHub? Just an idea, but what about hosting a GitLab on 0x00sec for this sort of projects? @pry0cc", "Making a collaborative Git for 0x00sec’s devs sounds incredibly fun. I wonder what tools the community can create together…", "I think one of us is missing something  In the first example, in my opinion the text doesn’t match the boolean values: 1 0 = 1 True True = false Here, you say the first bool is true, which I agree with. The second Boolean, 0, is  false but in the text you say it’s true. Also, the result of that&hellip;", "So it would be to risky to get detected if you upload it to GitHub? Just an idea, but what about hosting a GitLab on 0x00sec for this sort of projects? @pry0cc", "Hey guys! I just wanted to introduce you to Metasploitable- An intentionally vulnerable Linux OS! (Somewhat similar to Nebula- what @L3akM3-0day had posted about). Now this OS was made to run from a VM, although if I’m correct you can also boot from a USB. Here’s the download: https://sourceforge.n&hellip;", "So it would be to risky to get detected if you upload it to GitHub? Just an idea, but what about hosting a GitLab on 0x00sec for this sort of projects? @pry0cc", "Welcome back my trainee command-line ninjas! In this guide we will be covering some basic concepts and tricks to sending files to computers in the Linux shell. This can be extremely useful when you’re trying to share a backdoored executable to a machine on the same network, but don’t want to have t&hellip;", "So it would be to risky to get detected if you upload it to GitHub? Just an idea, but what about hosting a GitLab on 0x00sec for this sort of projects? @pry0cc", "A droplet of water shatters like glass upon your nose as the murky sky roars dominantly overhead. You gladly respect the sky gods’ anger and continue picking up your pace since you’ve still a while to go until you’re home. 3:30 PM. Though it took you 20 minutes to jog home from school. Surprisingly&hellip;", "Nice introduction @pry0cc. My two cents The ~ is almost equivalent to $HOME: cd ~/Documentscd $HOME/Documents But what you can also do is to specify a username cd ~pico/DocumentsWill change directory to /home/pico/Documents or whatever other location the home directory is set for user pico. &hellip;", "Welcome to Trix’ with Linux, the first installment of this series! In this series you will become my trainee command-line ninjas and in this guide we will be covering basic Linux use. I will cover Ubuntu/Mint (these will also work for Kali). If you’re using another distro and want help, just comment&hellip;", "Hello once again 0x00’ers, Today I will write up a short guide on binary and hexadecimal. Binary is a number system based on powers of 2. The only “numbers” are 1 and 0(on and off for electrical currents). We normally use decimal on a day to day basis which is powers of 10 (10, 100, 1000,…) Bina&hellip;", "I think one of us is missing something  In the first example, in my opinion the text doesn’t match the boolean values: 1 0 = 1 True True = false Here, you say the first bool is true, which I agree with. The second Boolean, 0, is  false but in the text you say it’s true. Also, the result of that&hellip;", "Sweet guide!", "Hi, I’t could be that but i’ts basically saying the same thing, just in a different order", "Hi there, Maybe I get you wrong, but shouldn’t this 1 0 = 1 True True = false 0 0 = 0 False True = True be this? 1 0 = 1 True False = True 0 0 = 0 False False = False I think this table would fit in better here: Input        OutputA       B000011101110Best regards, Sm&hellip;", "Hi there, Maybe I get you wrong, but shouldn’t this 1 0 = 1 True True = false 0 0 = 0 False True = True be this? 1 0 = 1 True False = True 0 0 = 0 False False = False I think this table would fit in better here: Input        OutputA       B000011101110Best regards, Sm&hellip;", "Hello 0x00’ers! In this series I will be covering Linux, basic tips and tricks and some badass shell stuff. Linux is second nature to me, and it’s mandatory for any self respecting hacker to know Linux and how to use the Bash shell. So before I get started, I’d love to know what you want to see fir&hellip;", "Sweet guide!", "If you don’t know what Kubernetes is, but would like to know, check this simple, but nice, intro to the topic…", "(This is a repost of the link given in the ‘Linux Category Proposal’. Reason: proper categorisation.) “Learn the ways of Linux-fu, for free.” https://linuxjourney.com/", "We all mess around with our .bash*, *rc and .profile files, but sometimes we are not sure what the whole deal is about… This article from Linux Journal (posted 22 June &#39;16) does a good job of explaining the topic: https://www.linuxjournal.com/content/profiles-and-rc-files", "Hi there, Maybe I get you wrong, but shouldn’t this 1 0 = 1 True True = false 0 0 = 0 False True = True be this? 1 0 = 1 True False = True 0 0 = 0 False False = False I think this table would fit in better here: Input        OutputA       B000011101110Best regards, Sm&hellip;", "Hey mates, no that’s not a bad plagiarism . I wrote with @L3akM3-0day and we’ll try to work together on this series. My part will be to translate his Java codes to C#, which I’ll try to do as good as I can, although I’m not that experienced with Android programming . I would also add the part of An&hellip;", "You should. In theory, you should be able to decode WEP and WAP if you know the keys. At least wireshark can do it so I think it is possible", "@SmartOne: of course, but sniffing with monitor mode on a WPA2 network, to which your machine is not authenticated, you’re not going to accomplish much.", "Videos and memes are worth a petabyte of words =) Happy sysadmin day to all troopers out there, may the Murphy not be with you!", "[image] [image] [image]", "Alas! It’s time for the next iteration of my Crypto Algs series. Now, a lot of what’s to be seen this time around is founded upon what I’ve said in past articles. In order to be best prepared for this article’s teachings, you should start from the beginning. The Vigenere Cipher is often referred to&hellip;", "If we are listening to the wifi traffic via monitor mode, can’t we decode the contents of the packets if it’s an open AP?", "I believe that most of us are here to share information and learn. Also, it is to be expected that not all of us are proficient with linux in general. So I would like to propose to open up a “Linux” or “General Linux” category under ‘Reference Database’ or ‘Computer Science’ (that’s why I put */Lin&hellip;", "@pry0cc I disagree. If you exploit a Windows/OSX machine, what are you going to do next? Exactly, post exploitation. Knowing how Windows/OSX works can be a great boost in this. Example: getting a shell on Windows but not being able to use the Windows command prompt leaves you stranded. 0x00sec shou&hellip;", "Yes, I will talk about utilizing root exploits. Feel free to help me if I miss something", "Yes, I will talk about utilizing root exploits. Feel free to help me if I miss something", "Will you also talk about utilizing root exploits such as towelroot?", "Will you also talk about utilizing root exploits such as towelroot?", "I have gotten through about half of this. I recommend it for anyone interested in AI.", "#Introduction to the Android Malware Series - 0x00Hey everyone and welcome to the introduction of my Android Hacking series! Nowadays, who doesn’t have a smarphone? People have their eyes fixed on their phone, what makes them vulnerable : Malware and Exploit. This series will aid you in the proces&hellip;", "Thanks for the reply! I’ll stick with that in the meantime", "Is there a appropiate way to hide code? Using spoiler tags, it doesn’t work very well: Example: &lt;?php print(&quot;Hi there, I should be hidden&quot;) ?&gt;", "If there’s not a major bug in the Android OS, you’ll definitely need root. As soon as you have root permissions, you can install your app as a system app (by copying it to /system/app). Once you are a system app, set your service as persistent In order to make it harder to remove your app, you cou&hellip;", "Hey mates, this time just a short post about Center of Math’s problem of the week, which I think could be a sweet programming challenge. The Exercise [image]I thought of a brute-forcing program, which calculates the different positions of the 3 hands and tests if they overlap. This challenge co&hellip;", "I think you got it right now", "I think that you have to consider the space between the marks in the clock. The key word is analog. As the second-hand advances, the minute-hand moves from one minute to the next one. As the minute-hand advances the hour-hand moves from one hour to the next one. Therefore, 3:15:15 is not a solution&hellip;", "I kind of got trapped by this, because I immediately thought of a program to solve the problem, without thinking how an analog clock actually works  Though, there wouldn’t have been so much programming fun with just one solution. Anyway, thanks for the heads up!", "I kind of got trapped by this, because I immediately thought of a program to solve the problem, without thinking how an analog clock actually works  Though, there wouldn’t have been so much programming fun with just one solution. Anyway, thanks for the heads up!", "If I understand you right, only 00:00:00 is the solution? Or do I get you wrong?", "I think you got it right now", "If I understand you right, only 00:00:00 is the solution? Or do I get you wrong?", "Hi there, Here is my solution in C#: static void Main(string[] args)        {            Dictionary&lt;string, double&gt; hand_angle = new Dictionary&lt;string, double&gt;();            List&lt;string&gt; results = new List&lt;string&gt;();                        for (int hour = 0; hour &lt;= 12; hour++)            {&hellip;", "I think that you have to consider the space between the marks in the clock. The key word is analog. As the second-hand advances, the minute-hand moves from one minute to the next one. As the minute-hand advances the hour-hand moves from one hour to the next one. Therefore, 3:15:15 is not a solution&hellip;", "It shouldn’t be hard, because it’s nothing different than executing commands/scripts as su. A neat method to check for root in Xamarin: https://forums.xamarin.com/discussion/comment/67904/#Comment_67904", "Hi there, Here is my solution in C#: static void Main(string[] args)        {            Dictionary&lt;string, double&gt; hand_angle = new Dictionary&lt;string, double&gt;();            List&lt;string&gt; results = new List&lt;string&gt;();                        for (int hour = 0; hour &lt;= 12; hour++)            {&hellip;", "You don’t even really need a program to do this; just look at a clock.", "Thanks for the reply! I’ll stick with that in the meantime", "No there doesn’t appear to be any way of doing that. Yet.", "I believe we should have a specific parent category made for OS s as a whole. And inside we could fit Windows, Linux, OSX, Sun, etc. Sub categories. Instead of putting it into something like “Computer Science” or “Reference Database”.", "Thanks, great share! It’s my first Android app, so getting root within it could be a bit difficult for me, but we’ll see what I can do .", "It shouldn’t be hard, because it’s nothing different than executing commands/scripts as su. A neat method to check for root in Xamarin: https://forums.xamarin.com/discussion/comment/67904/#Comment_67904", "Is there a appropiate way to hide code? Using spoiler tags, it doesn’t work very well: Example: &lt;?php print(&quot;Hi there, I should be hidden&quot;) ?&gt;", "Hi there, Here is my solution in C#: static void Main(string[] args)        {            Dictionary&lt;string, double&gt; hand_angle = new Dictionary&lt;string, double&gt;();            List&lt;string&gt; results = new List&lt;string&gt;();                        for (int hour = 0; hour &lt;= 12; hour++)            {&hellip;", "Thanks, great share! It’s my first Android app, so getting root within it could be a bit difficult for me, but we’ll see what I can do .", "If there’s not a major bug in the Android OS, you’ll definitely need root. As soon as you have root permissions, you can install your app as a system app (by copying it to /system/app). Once you are a system app, set your service as persistent In order to make it harder to remove your app, you cou&hellip;", "If there’s not a major bug in the Android OS, you’ll definitely need root. As soon as you have root permissions, you can install your app as a system app (by copying it to /system/app). Once you are a system app, set your service as persistent In order to make it harder to remove your app, you cou&hellip;", "In this last part of this series, we are going to see how to build a pretty stealth remote shell. This remote shell usually also have better chances to avoid detection systems like firewalls and IDS. As described above, it sounds like the definitely remote access tool. Doesn’t it?. Well, actually s&hellip;", "There are UAC bypasses available to acquire administrative access. What you require is a technique called DLL Hijacking and it is detailed here by our @Joe_Schmoe on Null Byte - Bypass UAC Using DLL Hijacking.", "Hi fellas, today is my first article of a long series dedicating to CAPTCHAs. I will show you how to properly analyze and bypass several types of CAPTCHA. You can find below, a list, but not exhaustive, of the subjects that will be approached : OCRRandomness applicabilityaudio CAPTCHA3DreCAPTC&hellip;", "Hacking John Doe:A fictional tutorial about social engineering, recon, exploitation, and a complete lack of ethics. By @Ninja243 It’s a cold, dark night in your room. You know you shouldn’t be up this late, but you are, yet again. To pass time, and to wait for the erratic buzz of caffeine to wear&hellip;", "One question: If you run a geolocation on a cell phone IP, would you ever be able to get the location of it? That would be a very serious privacy issue! And, though I know it’s only a story and you maybe wanted to keep your post short, only a skiddy would mess up the routers settings, when you could&hellip;", "Hope this won’t happen in europe!  Referring to the story, in this case you could still get his location through an browser exploit or social engineering (e.g. sending him a link to a website which has a valid reason to retrieve his location through the HTML5 geolocation API)", "Ohhh mannn! This is so good. I literally love this so much. I would pay to read something like this. Once I picked it up I couldn’t put it down. Nice work!", "One question: If you run a geolocation on a cell phone IP, would you ever be able to get the location of it? That would be a very serious privacy issue! And, though I know it’s only a story and you maybe wanted to keep your post short, only a skiddy would mess up the routers settings, when you could&hellip;", "Hope this won’t happen in europe!  Referring to the story, in this case you could still get his location through an browser exploit or social engineering (e.g. sending him a link to a website which has a valid reason to retrieve his location through the HTML5 geolocation API)", "One question: If you run a geolocation on a cell phone IP, would you ever be able to get the location of it? That would be a very serious privacy issue! And, though I know it’s only a story and you maybe wanted to keep your post short, only a skiddy would mess up the routers settings, when you could&hellip;", "Aah, I didn’t think about that, thanks", "Hope this won’t happen in europe!  Referring to the story, in this case you could still get his location through an browser exploit or social engineering (e.g. sending him a link to a website which has a valid reason to retrieve his location through the HTML5 geolocation API)", "Thanks! About the phone, it happens every once in a while. I tried tracking my own phone using GeoIP on Mobile data, and I can confidently say that you do get the location of it if the phone is in Namibia. As soon as you go to South Africa though, GeoIP returns the carrier’s location, so the short &hellip;", "Hope this won’t happen in europe!  Referring to the story, in this case you could still get his location through an browser exploit or social engineering (e.g. sending him a link to a website which has a valid reason to retrieve his location through the HTML5 geolocation API)", "Thanks! About the phone, it happens every once in a while. I tried tracking my own phone using GeoIP on Mobile data, and I can confidently say that you do get the location of it if the phone is in Namibia. As soon as you go to South Africa though, GeoIP returns the carrier’s location, so the short &hellip;", "One question: If you run a geolocation on a cell phone IP, would you ever be able to get the location of it? That would be a very serious privacy issue! And, though I know it’s only a story and you maybe wanted to keep your post short, only a skiddy would mess up the routers settings, when you could&hellip;", "One question: If you run a geolocation on a cell phone IP, would you ever be able to get the location of it? That would be a very serious privacy issue! And, though I know it’s only a story and you maybe wanted to keep your post short, only a skiddy would mess up the routers settings, when you could&hellip;", "Yes, @airth is right. In general running setuid programs is dangerous. If a vulnerability appears in such a program, an attacker can get full access to the system. Using the capabilities approach will just allow the attacker to create sockets RAW, but not access system files for instance. My unders&hellip;", "Yes, @airth is right. In general running setuid programs is dangerous. If a vulnerability appears in such a program, an attacker can get full access to the system. Using the capabilities approach will just allow the attacker to create sockets RAW, but not access system files for instance. My unders&hellip;", "Thanks for the explanation! I am just wondering what’s the “dangerous thing” in running Wireshark as root? It can’t be only a precaution for newbies like @airth said, can it?", "Maybe a silly beginner question, but why do we have to call our program with root permissions, while e.g. Wireshark even alerts us not to do so? Nice post BTW", "Did you read /usr/share/doc/wireshark-common/README.Debian? When you install wireshark you can chose to enable non-root users to capture packets. That basically means that: If you kernel does not support capabilities, the capture back-end, a process called dumpcap, will be setuid and therefore ex&hellip;", "You shouldn’t run the program as root. You should set up a wireshark group and then add yourself to that.", "Maybe, I was just curious why every time I fire up Wireshark as root, this window pops up [image]", "Maybe, I was just curious why every time I fire up Wireshark as root, this window pops up [image]", "@SmartOne, especially Wireshark requires root permission in order to work properly on my machine.", "Maybe a silly beginner question, but why do we have to call our program with root permissions, while e.g. Wireshark even alerts us not to do so? Nice post BTW", "&quot;I just got my new lambo, and I loooove it, but I tried putting my Prius motor in it and it doesn’t seem to work? Any ideas? I could use my lambo engine, but I really don’t want to. I like my Prius electric motor&quot;", "to stay secure, you dont just need Tor, and a VPN. You need good browsing habits. ** What are Browsing Habits?** Let me tell explain. Its basically how you behave on the internet, what websites you click, your language pattern (how you speak), what websites you are registered to, pretty much any&hellip;", "For everyone who likes google but still wants to stop using it: Startpage.com It sends search queries through a proxy and tunnels the answer back through it. Google can still collect data, but it doesn’t get to link it with anyone’s identity.", "Usability of a hostname is a relative thing; from generic ones, which seldom hold any meaning, to production ones, which can even tell you a physical location of a server. But all hostnames have one thing in common: they get logged. Around the site you’ll find various topics on why you should care &hellip;", "Link: http://www.9tut.com/ This is a documentation regarding beginner-advanced networking topics.", "I think Wireshark would also be a good fit in your series", "Sure, sniffers will come… actually in two different flavors", "I think Wireshark would also be a good fit in your series", "Nice Intro! Made me looking forward to the next post.  I would also be very interested on a specific post about rootkits!", "Thanks mate, rootkits seem like a fun post to write! Although it may take a while to really write about them in full depth.", "Nice Intro! Made me looking forward to the next post.  I would also be very interested on a specific post about rootkits!", "Nice Intro! Made me looking forward to the next post.  I would also be very interested on a specific post about rootkits!", "Don’t get fooled by the title. The link below doesn’t teach you how to code a complete OS. I thought it would be an interesting read for the low-level members of 0x00sec. Here you go: http://tutorialsbynick.com/writing-an-os-baby-steps/", "BRACE YOURSELVES because, this is a very long post and, i’ve gathered my pasts pointers to this entire topic and, with social-engineering being one of my primary special endeavors, I have now decided to give all of my pointers to you in one page. There are a lot that’s been covered, so i’m sure a th&hellip;", "Its cool, he can join.", "Great! Can’t wait to work with you!", "0x00sec is proud to announce the new and upcoming CTF sponsored and hosted by s^3! DetailsThe CTF will be beginning within the next few weeks, however the time and date is not yet final. This post will be updated when new infomation becomes final. The details to the CTF server will be PM’d to you &hellip;", "I think @Wawa appreciates new members; however, I’m just his bitch, so he’s the one who has to agree", "I would be pleased to join one of you great guys and learn by watching you doing your work. I may not be a big help, but it would be a rewarding experience to me!  Is there a place left in BazicBitches or Crash BandiROOT?", "It could sound simple for those who already have some knowledge about hacking. But for beginners (like me) this task could be a mystery. To discover or resolve an IP address from a domain is quite simple, in Linux systems you can just open your terminal and type: host &quot;domain name&quot; dig “domain n&hellip;", "In this post, I will uncover the mysteries torward finding hidden login panels and portals, something critical to finding low hanging fruit, uncovering larger vulnerabilities. ReconassianceIn this multipart series, I will be demonstrating and explaining the basics of reconaissance, something that &hellip;", "A Discrete Mathematics professor has a class of  N students. Frustrated with their lack of discipline, he decides to cancel class if fewer than K students are present when class starts. Given the arrival time of each student, determine if the class is canceled. InputFirst take in T, the number o&hellip;", "Today well be learning how to do a simple ARP Spoof or ARP Poison in python. ARP spoofing can be used for a few things, DoS, MitM, Session Hijacking,Stripping SSL(technically mitm). Today well be using it for a basic Man in the Middle attack. So lets get started with some quick background info. &hellip;", "Hey everyone! I just thought I would share this little technique, because it was unknown to me after a year of programming experience! int a = 5, b = 6;// swapping now:a = a + b; // a = 11b = a - b; // b = a + b - b// b = a// b = 5a = a - b; // a = a + b - (a + b - b)// a = b// a = 6&hellip;", "Great post! I think this is something very important to understand since most people think that using Tor or a VPN will is enough to protect their privacy. Personally, I use the following extensions: Disable WebRTC Disconnect HTTPS Everywhere uBlock Origin ZenMate Security, Privacy &amp; &hellip;", "There’re a few things: You can use netdiscover, arp-scan, or nmap to seek out another MAC. Finding out which MACs are able to access the internet can be simple brute force. If anything, you could write a program to parse the netdiscover result and then apply changes until you can get, let’s say, an&hellip;", "Great post! I also like to use Pixelknot when I’m on Android", "Thanks! I’ve heard of it, but I actually never tried it.", "Great post! I also like to use Pixelknot when I’m on Android", "Great post! I also like to use Pixelknot when I’m on Android", "** What Is Search Queries Again?** When you type something into Google, or whatever you are using, you for obvious reasons don’t get all the results on your search, because that would simply be way too much data for your computer to handle. hence: that is why Google have so many and such big ser&hellip;", "Hey, thanks for a great article! To stay under the radar, I use some, umm, unorthodox methods. There are some old CTF servers I found like this one that have levels on the server. To solve the levels and get the flags, the user has to SSH into the server. To anonymise myself, I SSH into the CTF se&hellip;", "#SOCIAL ENGINEERING - PART 2 - ELICITATION# Elicitation is a conversation where you subtely try to extract information. However, this conversation needs to look casual and innocent. It’s all about asking the right questions. The goal here is to manipulate the behaviour of your target in order to ac&hellip;", "Hello everyone of 0x00! I figured why not make my first contribution, so heres a quick one  Today, im going to brush the topic of proxies, followed by how to set up ProxyChains to make being tracked a bit harder. So first things first. What is a proxy? In computer networks, a proxy server is a s&hellip;", "The following paper documents a possible PE file infection technique which covers a high level overview and the low level code of how both the infection and the resulting payload is executed. Please note that some of the following material may not be suited for beginners as it requires: Proficiency&hellip;", "Will mention the forum to some friends to help reaching the goal", "Welcome, to a guide on crypters and their technology. I’ve always thought and felt that crypters were a form of mysterious dark art in this hacking world, some sort of black magic, something that’s quite obscure in terms of being able to find information and do research. Of course, it has become ver&hellip;", "Awesome! Any help is appreciated!", "Will mention the forum to some friends to help reaching the goal", "Will mention the forum to some friends to help reaching the goal", "We did it! 100 users!Hello 0x00’ers! A couple of weeks ago, this community started off as a fun new place to teach, learn and discuss Infomation Security, following the swift decline in activity at Nullbyte. Between three humble hackers on the #nullbyte IRC channel; Me, @oaktree and @unh0lys0da wor&hellip;", "That’s one of the reasons why I use Keepass"]}