{"user": "srrpub", "history": ["Thanks for writing this article and sharing this technique. I tried to recreate the simple demonstration that was provided above, wherein curl is called, but I am getting timeout errors and I am not quite sure why. I followed each of the steps that were listed, and I even signed up for FrootVPN just&hellip;", "Hi @srrpub I am having the same problem as you. Did you manage to connect to the internet from inside docker containers? Thanks", "Register your nick. Because it’s getting off-topic, please PM IRC Staff (group message) if you have any more troubles.", "I’m not getting past the “Joining channel…” message. The server bot had the following to say. 12:03:45ⓘ srrpub set mode +iwxz srrpub 12:03:45ⓘ [477] #0x00sec, You need a registered nick to join that channel.", "Sure thing, I am joining now.", "Hmm, interesting… DNS is already configured with the start script, would you be able to join irc, irc.0x00sec.org, I’ll be on the main channel #0x00sec.", "curl is already installed in my Ubuntu host. I thought that this would make curl accessible to each container, but running which curl from within any docker container returns nothing. When I try to  run apt-get update &amp;&amp; apt-get install curl -y from within a docker container (e.g. from brave_davinci&hellip;", "curl is already installed in my Ubuntu host. I thought that this would make curl accessible to each container, but running which curl from within any docker container returns nothing. When I try to  run apt-get update &amp;&amp; apt-get install curl -y from within a docker container (e.g. from brave_davinci&hellip;", "Since it is based on Ubuntu, run the following commands: sudo apt-get update &amp;&amp; sudo apt-get -y install curlThis will install curl. Would you be able to run ifconfig as well please?", "Thanks for getting back to me @pry0cc. I double-checked my VPN configuration using the steps from this article - I had forgotten to remove the “sketchy” characters from my .ovpn file names. I verified that the VPN files were configured properly by running sudo openvpn VPN/vpnfile.ovpn. I took the a&hellip;", "Hi @srrpub, can you verify the tunnel is open? Run docker ps and see the port maps manually. Can you also verify that you can connect to the VPN’s from within the docker container? Find a docker container that is running, find it’s name, and run docker exec -ti &quot;container_name&quot; bashOnce in, atte&hellip;", "Thanks for writing this article and sharing this technique. I tried to recreate the simple demonstration that was provided above, wherein curl is called, but I am getting timeout errors and I am not quite sure why. I followed each of the steps that were listed, and I even signed up for FrootVPN just&hellip;", "Thanks for writing this article and sharing this technique. I tried to recreate the simple demonstration that was provided above, wherein curl is called, but I am getting timeout errors and I am not quite sure why. I followed each of the steps that were listed, and I even signed up for FrootVPN just&hellip;"]}