{"user": "Techno_Forg", "history": ["I think there’s a tool written in Python that can do this job… let me see if I can find it (it’s saved to my drive)… (Five hours later) Alright, I’m back… found the github link after saving the world from aliens. On a more series note… this I think should be worth  looking into. It does ALMOST &hellip;", "Watching Doja cat on YouTube? @REal0day", "Or other questionable activities… and we all know what I mean… xD", "I always thought that the incognito mode was just to keep your gf from seeing your porn history.", "To answer the question in the title… no. XD", "Welcome to the inaugural Leap Security and 0x00sec CTF!! We have teamed up with the guys at Leap Security to bring you this challenging fun-filled event. The CTF has no limitations on participants as it is open to anyone (no registration required) – think of it as our gift back to the community!  [&hellip;", "I like it except as a college student I don’t have a lot of time to play around… I just wish I had more time.", "To answer the question in the title… no. XD", "First of all, I want to congratulate @pry0cc for making this partnership happen. And, of course, the others involved and HackTheBox for offering an excellent platform for us to have fun; improve creativity and pentest skills. This whole thing is awesome! I’m new to the pentesting area. I came from &hellip;", "Here is what worked for me… I took a notebook and well, almost everyday I wrote down a To Do List. The only flaw is that I never looked at the list again. XD", "I understand that… the issue from IRC is getting a shell, no? Also, found this: “Another limitation: only vulnerable versions of libssh running in server mode are vulnerable, while the client mode is unaffected.” According to this article, shodan showed 6,351 sites using libssh. I would think t&hellip;", "Alright, so after examining a few scripts… I’ve discovered several factors to try to exploit it. anything greater than 0.7.6 and greater than 0.8.4 are not affected hence the low amount of possible vulnerable machines. Basically all you gotta do is send: MSG_USERAUTH_SUCCESS This is actuall&hellip;", "GIthub has shit tons of repos like this", "If I needed more malware I’d disable my virus protection and download some porn. xD", "Here is what worked for me… I took a notebook and well, almost everyday I wrote down a To Do List. The only flaw is that I never looked at the list again. XD", "I haven’t done too much on htb yet mostly due to lack of time. Also I find people messing up the boxes and resets can be a pain. I’ve heard people say that some of the htb boxes are similar to OSCP and some were inspired by OSCP boxes, though I’ve also heard people say it’s a bit more ctf-y than OS&hellip;", "To be clear, we’d never have this partnership if it wasn’t for the awesome content the contributors here put out. It’s all cyclical. If people contribute well and produce interesting discussion and content, we become a better platform, and we get the ability to form partnerships and support our har&hellip;", "To be clear, we’d never have this partnership if it wasn’t for the awesome content the contributors here put out. It’s all cyclical. If people contribute well and produce interesting discussion and content, we become a better platform, and we get the ability to form partnerships and support our har&hellip;", "Awesome job @pry0cc. I will try to be more active since I’m the owner of the channel on IRC. Also, join #htb.", "Awesome job @pry0cc. I will try to be more active since I’m the owner of the channel on IRC. Also, join #htb.", "Well, here is my two cents. I think that is a good opportunity for our community. It is, without doubt, the best CTF platform available nowadays and will certainly help people who want to skill up their hacking skills. However, I doubt that professionals are willing to “waste” time on CTF whereas &hellip;", "Your opinion is very valuable here. I do however disagree in some areas. Vulnerabilities found are definitely found in the wild, perhaps less extreme ways. I know many professionals that use it to expand their knowledge and for fun, also. CTF’s allow you to test new types of shells, binaries. You’&hellip;", "I got your idea and I agree with you in some ways. However, do such a platform prepare you to handle cloud based infrastructures assessment? What about AWS, Azure attack vectors? More and more companies are migrating to cloud based providers, modifying our daily job paradigm. This move can be antic&hellip;", "Sure - I do think however your issue is not one with HackTheBox itself, but rather an issue with CTF platforms period. They have their place, and they’re very good for isolated exercises and learning how to exploit things such as code execution, XXE, XSS, SQL Injection, enumeration and the like. HT&hellip;", "Awesome job @pry0cc. I will try to be more active since I’m the owner of the channel on IRC. Also, join #htb.", "Woah, big news! Thanks a lot @pry0cc for making this possible  I’ve been absent for some weeks finishing my master’s thesis. I’ll try to catch up with HTB as soon as I have some time to spare.", "That’s some pretty awesome news! I really need to try HTB, those labs look amazing. Did anyone here tried rastalabs? I heard it’s amazing for sharpening AD skills, but I’m a bit reluctant to jump right in, because I have almost no experience in windows environments.", "I finally broke in to HTB so I’ll be trying more of their labs now. Excited for this partnership!", "I like it except as a college student I don’t have a lot of time to play around… I just wish I had more time.", "I like it except as a college student I don’t have a lot of time to play around… I just wish I had more time.", "Hello, 0x00ers! As you may have heard me talk about before, I am a strong advocate of using labs and CTF platforms for learning to hack and learning the skills involved in performing pentests from day to day. I believe they’re a great way to learn new skills, practice and validate your enumeration&hellip;", "Thank you!!! I will look into this!!!", "I think the best way to do so would be setting up a simple app on an external VPS that will just return your IP address. You could use publicly available services to do so, but I personally would not trust them. Here is a simple flask app that would do exactly that: from flask import Flaskfrom fl&hellip;", "Yes… sadly it’s been abused, bots scraping LOTS of content. It even made our server go down a few times. As soon as we shut down the tor listener the site is much faster and more stable. I’m still exploring more ways we can utilise tor, perhaps cloudflare?", "Photoshop, running in wine, on Arch", "Let’s not call BS on it quite yet… the scripts thus far could incomplete. I still need to study a bit longer. Please bear with me.", "@Techno_Forg Photoshop…  …Adobe Illustrator possibly -Archangel", "Let’s not call BS on it quite yet… the scripts thus far could incomplete. I still need to study a bit longer. Please bear with me.", "Let’s not call BS on it quite yet… the scripts thus far could incomplete. I still need to study a bit longer. Please bear with me.", "Ight, so my script is ready and it can be used for multiple different purposes. Please use it, but also edit it as need be… currently gonna add a scanner for libssh if need be but we should be fine… only issue with current scripts for a scanner is that they’d have to take file input. Also, a note on&hellip;", "f0rg, Run it first. It looks good so far. If you want you can try to create an ‘elif statement’ to make sure there aren’t any duplicate IP addresses in your code. It would go in between the ‘if statement’ and the ‘else statement’. But if you want to get even more complicated: use TRUE with the ‘if&hellip;", "Yo, f0rg here with yet another question. I’m busy creating a script in Python. Basically the issue lies in using ToR as a way to change the IP as the stem lib documentation states: “An important thing to note is that a new circuit does not necessarily mean a new IP address. Paths are randomly selec&hellip;", "It’s fine here for now. I don’t think it warrants another post.", "It’s fine here for now. I don’t think it warrants another post.", "Are you mass scanning them?", "Are you mass scanning them?", "I’m still testing all 6300 server automatically of @occupi list with my script since yesterday.", "Ight, so my script is ready and it can be used for multiple different purposes. Please use it, but also edit it as need be… currently gonna add a scanner for libssh if need be but we should be fine… only issue with current scripts for a scanner is that they’d have to take file input. Also, a note on&hellip;", "Ight… let me see what I can do.  I payed the one time fee.", "If total servers on Shodan are only 6.000  and only 3000 are vulnerable , so someone that have credits on Shodan could search and download till 10.000 result for credit , so with 1 credit we can get all available servers then, with a bash script and a loop we can test each server with my script, or &hellip;", "How do yall create these awesome wallpapers?", "I understand that… the issue from IRC is getting a shell, no? Also, found this: “Another limitation: only vulnerable versions of libssh running in server mode are vulnerable, while the client mode is unaffected.” According to this article, shodan showed 6,351 sites using libssh. I would think t&hellip;", "I’m assuming that there’s something missing from what you’re doing. Don’t know what though since I’m not there on your machine (and thank God for that  ).", "I understand that… the issue from IRC is getting a shell, no? Also, found this: “Another limitation: only vulnerable versions of libssh running in server mode are vulnerable, while the client mode is unaffected.” According to this article, shodan showed 6,351 sites using libssh. I would think t&hellip;", "I’m trying all in local so it’s useless port forward, I can make a try but it should work anyway and nope I didn’t modified docker build. It’s strange that it doesn’t work for you. I made this script few days ago but only now it definitely works. @Techno_Forg What you wrote it’s correct  but assume&hellip;", "Alright, so after examining a few scripts… I’ve discovered several factors to try to exploit it. anything greater than 0.7.6 and greater than 0.8.4 are not affected hence the low amount of possible vulnerable machines. Basically all you gotta do is send: MSG_USERAUTH_SUCCESS This is actuall&hellip;", "Alright, so after examining a few scripts… I’ve discovered several factors to try to exploit it. anything greater than 0.7.6 and greater than 0.8.4 are not affected hence the low amount of possible vulnerable machines. Basically all you gotta do is send: MSG_USERAUTH_SUCCESS This is actuall&hellip;", "I was just reading about this vulnerability but as soon as they mentioned that it’s not the standard SSH that’s affected I kinda glazed over. It’s still very interesting if you can find the right device as @pry0cc said but you’re better off setting up a vulnerable instance of your own to try it out &hellip;", "This probably deserves its own article. The vulnerability known as CVE-2018-10933 is largely overhyped, many memes have been made about it and infact it has been confused with its bigger brother, openssh. Libssh only really affects about 3000 devices on the entire internet, which isn’t very much c&hellip;", "Alright, so after examining a few scripts… I’ve discovered several factors to try to exploit it. anything greater than 0.7.6 and greater than 0.8.4 are not affected hence the low amount of possible vulnerable machines. Basically all you gotta do is send: MSG_USERAUTH_SUCCESS This is actuall&hellip;", "This is extremely useful. I will look into setting up a attack vector or something along those lines. Of course in my own network.", "“Fuck off” - f0rg", "I find that statement to be very difficult to overcome in any debate. It is like the neutron bomb of communication.", "I find that statement to be very difficult to overcome in any debate. It is like the neutron bomb of communication.", "“Fuck off” - f0rg", "“Fuck off” - f0rg", "“It takes 5 million years for a diamond to shine. I did it in 21 because I’m ahead of my time” - Logic “The deeper it gets, boy, the pressure increases But pressure make diamonds” - Big Sean Some quotes I like.", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "I’ve seen this kind of stuff also on twitter. It’s probably really rare like a Pokeman… XD With jokes aside… I haven’t tried so not been able to help that much. I can probably look online and see if I can find a PoC or a paper on it if anyone is interested in it? ~Cheers! –Techno Forg–", "I’ve been lurking and well, I think it’s time I gave my reply. First off, hacking saved my life also. I was lucky, but felt like a outcast. I started playing games with computers when I was about 7 or 8 give or take. When I was 10, I lost a friend to a disease in his neck. Basically he couldn’t bre&hellip;", "You might wanna check out the theory and explanation behind a hash and a salt in cryptography. Here’s a couple of links I found that I thought explained it quite well.", "Well, you are not really using SHA1MD5 with and without salt but plain SHA1/MD5 and bcrypt (which is completely different hashing method). If you want to implement a simple bruteforce, you can use python’s itertools: from itertools import productfrom hashlib import md5test_hash = &#39;098f6bcd4621d&hellip;", "Hi y &#39;all. So I am currently trying to do a project in python2 and python3. Basically I’m trying to study how to bruteforce a encrypted ‘password’ in lets say SHA-1 and MD5. I’m not asking for the answer, but I’m trying to understand why it’s important to use hashes and salts along with the hashes. &hellip;", "I’ve been lurking and well, I think it’s time I gave my reply. First off, hacking saved my life also. I was lucky, but felt like a outcast. I started playing games with computers when I was about 7 or 8 give or take. When I was 10, I lost a friend to a disease in his neck. Basically he couldn’t bre&hellip;", "Damn dude… this is cool. Nice share. As pry0cc suggested, please do a write up. That would be awesome!", "Hi y &#39;all. So I am currently trying to do a project in python2 and python3. Basically I’m trying to study how to bruteforce a encrypted ‘password’ in lets say SHA-1 and MD5. I’m not asking for the answer, but I’m trying to understand why it’s important to use hashes and salts along with the hashes. &hellip;", "You guys are gonna make me cry with how wholesome this thread is. @maderas any time you comment I feel like I’m a direct witness to history, if you catch my drift. @Techno_Forg I agree re: fucked up childhoods. I think what @maderas said about pressure forging diamonds sums it up beautifully.", "@maderas, I feel ya man. That’s why a lot of members part of the CSO Club here in my college are skiddies or wannabes. I’m sorry, but it’s true. I’ve found  a common trend with haxxors. We had fucked up childhood and even adulthood (in rare cases). Computers is our way of communicating. Anyways, wh&hellip;", "Hi y &#39;all. So I am currently trying to do a project in python2 and python3. Basically I’m trying to study how to bruteforce a encrypted ‘password’ in lets say SHA-1 and MD5. I’m not asking for the answer, but I’m trying to understand why it’s important to use hashes and salts along with the hashes. &hellip;", "@Techno_Forg You have an older brother here man. You need anything in digital or meatspace, you just let know. I mean it.", "@Techno_Forg You have an older brother here man. You need anything in digital or meatspace, you just let know. I mean it.", "@maderas, I feel ya man. That’s why a lot of members part of the CSO Club here in my college are skiddies or wannabes. I’m sorry, but it’s true. I’ve found  a common trend with haxxors. We had fucked up childhood and even adulthood (in rare cases). Computers is our way of communicating. Anyways, wh&hellip;", "I’ve been lurking and well, I think it’s time I gave my reply. First off, hacking saved my life also. I was lucky, but felt like a outcast. I started playing games with computers when I was about 7 or 8 give or take. When I was 10, I lost a friend to a disease in his neck. Basically he couldn’t bre&hellip;", "@Techno_Forg I am sorry about your friend. We have a very similar path my friend…I lost a friend to leukemia when I was in third grade. I’ve lost so many people that it feels like my life has been a series of stepping over bodies and learning to move on…life is beautiful, but sometimes it require&hellip;", "I’ve been lurking and well, I think it’s time I gave my reply. First off, hacking saved my life also. I was lucky, but felt like a outcast. I started playing games with computers when I was about 7 or 8 give or take. When I was 10, I lost a friend to a disease in his neck. Basically he couldn’t bre&hellip;", "I’ve been lurking and well, I think it’s time I gave my reply. First off, hacking saved my life also. I was lucky, but felt like a outcast. I started playing games with computers when I was about 7 or 8 give or take. When I was 10, I lost a friend to a disease in his neck. Basically he couldn’t bre&hellip;", "I’ve been lurking and well, I think it’s time I gave my reply. First off, hacking saved my life also. I was lucky, but felt like a outcast. I started playing games with computers when I was about 7 or 8 give or take. When I was 10, I lost a friend to a disease in his neck. Basically he couldn’t bre&hellip;", "For those interested in robotics and following from Robot Vulnerability Scoring System (RVSS) and Robot hacking: the Robot Security Framework (RSF), I’m happy to share a recent work we’ve made available called the Robotics CTF (or simple RCTF for short):  [image]The Robotics CTF is a platform for&hellip;", "I’m thinking of creating a IRC channel for this except I don’t want to be OP… lol. @0x6e756c6c should be the OP since he is the creator of this thread (I also don’t know how to setup the IRC channel). Will talk to fraq about this being a potential and will update in the comments of this thread if I &hellip;", "So This is my first post even thought= I’ve been a member since OTW fell of with null-byte:WHT.  So Hi All, names is n0SiS, My question is which IP Grabber websites do you all find to have the best domain name to help with SE? -N0SiS", "Realmode Assembly - Writing bootable stuffPart 7: Let’s write a small game (2/2)What is this?This is going to be a walk-through in writing an Operation System in assembly which operates purely in Realmode. Goal will be writing different kernels from a simple “Hello World” over small terminal pr&hellip;", "Note: Multiple edits for typos (the ghost of a learning disability mostly overcome) and additional image upload occurred between 21:10 EST, 9/30/18 &amp; 22:23 EST 9/30/18 Last year I released the essay Shared thoughts after 6+ years in pentesting: (Shared thoughts after 6+ years in Pentesting). I dec&hellip;", "This seems very similar to Forg’s  Wiki and Your Complete, Unbudgeted Toolkit. Good content but a suggestion for the future… you can edit WiKis in the WiKi category. I believe this was done for this exact purpose. So yeah… –Techno Forg–", "This week’s guest: @REal0day!Professional career and adviceHello REal0day. Thanks for participating today! For starters, can you tell us a bit about yourself and your current role/job/work? I’m a Security Researcher at a startup that specializes in asset discovery and vulnerability assessment f&hellip;", "[5jTwN3d.png]TheReaver it’s a tool written in bash born to execute  WPS attacks and based on the output of pins of 3wifi stascorp com service testing with the famous software reaver. 3wifi.stascorp.com is an html page that has javascript code also working offline (already on github) to calculate i&hellip;", "Wow Man! This is awesome. Good job @leeky!", "@Leeky CONGRATS!!! You TOTALLY earned it! I hope you do a write-up!", "@Leeky CONGRATS!!! You TOTALLY earned it! I hope you do a write-up!", "@Leeky, congrats man. Now @nugget and I would want to give you a special present.", "@Leeky, congrats man. Now @nugget and I would want to give you a special present.", "Everyone give a big hands up, thump up, sexual massage or big lovin to our resident matey boy @Leeky for REKIN flare-on check his scores!  [ef3090676d0c76993e98ca1c3504629b]Leeky&gt; 250 hours over 2 months! I have never been so sore but it was worth it in the end, even if it did end up so sticky L&hellip;", "I’m thinking of creating a IRC channel for this except I don’t want to be OP… lol. @0x6e756c6c should be the OP since he is the creator of this thread (I also don’t know how to setup the IRC channel). Will talk to fraq about this being a potential and will update in the comments of this thread if I &hellip;", "Hey all a small c# challenge RE I made for leeky and lkw on IRC, they appeared to like it! so I thought I would post it here. My first try at writing one of these so feedback welcome  https://1drv.ms/u/s!AkvwG6Qrk79x3Th-paeLebwfmC_y Good luck have fun  The archive type is 7zip availible here: ht&hellip;", "Fastest time so far, is leeky with 2 hours 30 minutes", "We all are busy at the moment with most of us going back to school. Don’t worry, we aren’t dead yet. I for one have been busy asf lately since college has started and I’m suspecting a lot of people are having this issue, but school comes first. Just stick around.", "We all are busy at the moment with most of us going back to school. Don’t worry, we aren’t dead yet. I for one have been busy asf lately since college has started and I’m suspecting a lot of people are having this issue, but school comes first. Just stick around.", "Sure it is! There may be dead hours but eventually someone will pop up", "I’m going to necrobump this article, apologies if you’ve read this one before. It would be really cool if we could mix this dropper with this shell, https://github.com/audibleblink/gorsh. Anybody up for the challenge? EDIT: Ok, so I’ve figured out how to incorporate them together. Expect an articl&hellip;", "@Nitrax- Thank you for this brother… This tool provides an option where the chances of detection are generally going to be low while the pay off  is potentially huge. During engagements, many times I have been faced with a challenge where my most apparent options had me clawing within my own mind&hellip;", "Thanks mate. I lost hope to see a comment about this tool  It is, indeed, a quite contextual approach for tricky vulnerability exploitation but it is completely worth it when you know that it can allow you to reach RMI endpoint and so on which often lead to RCE ahaha. By the same token, I agree wi&hellip;", "I’m in your IRC pic… lololololol. Anyways, pretty dope setup right there. Might just give Arch a go again, but meh… might not either. I have a lot of shit atm that I need to backup first.", "I’m in your IRC pic… lololololol. Anyways, pretty dope setup right there. Might just give Arch a go again, but meh… might not either. I have a lot of shit atm that I need to backup first.", "Github Open-source tool I wrote that uses Shodan (a search-engine for the Internet of things) to automate the discovery of potentially vulnerable routers running outdated firmware which can be exploited in order to target every device on the network. Any thoughts?", "DISCLAIMER: Article originally published on immunIT. Hi fellas, Today, I will introduce you to a new tool, developed for the sake of one of my pentesting engagement, named XIP. XIP claims to provide an efficient way to generate a list of IP addresses, using a set of mutations, in order to bypas&hellip;", "So basically @pry0cc was necrobumping? lolololol… Anyways, I believe it’s a great topic since all communities are built upon n00bs. That’s my two sense.", "What’s up, everyone? This tutorial will show you how to configure your own vulnerable CTF server manually. There exist some scripts which do this job for you but it’s much better when you understand why these vulnerabilities work.  Before we start I recommend you document every change/step. Write &hellip;", "figured it out… lolololol… It’s a silly error. :S But since I’m borked I can’t run my script…", "Reverse Engineering and Crackme challengesThis topic is an aggregation of Crackme and reverse engineering challenges developed for 0x00sec. Please discuss the challenges in the thread they were originally posted or on IRC in #challenges This curation is based entirely on my own whim and not a comp&hellip;", "Hi A while ago I did a presentation on reverse engineering for a group at a local uni. I thought the slides and binaries I used could be useful, so I’m posting it here. I’d like to point out that many of the binaries I used are not mine, many came from skidophrenia which was hosted on ctfd.io by @&hellip;", "It’s a error in the code I believe… I will look for a solution sometime in the near future. In the mean time, I will play around with your code. I think it’ll be cool to add several different vulnerabilities to search for, but that’s just a thought. lololol. ~Cheers!", "Nice job man… I’ve looked at your code briefly and well, I decided to mess around with shodan a bit in Python and found a error that I can’t seem to resolve… basically when I do: try:#do stuffexcept shodan.APIError as error:#do stuffThere’s a error thrown at ‘except shodan.APIError as error:’ &hellip;", "How can people learn if they have a shitty desktop? Ever thought of that?", "I was speaking of ASLR, but couldn’t recall the exact name… lololol. I will look into Protostar since I have heard much great things about it.", "Are you using a valid Shodan API key? You can get a Shodan API key for free by creating a free account at https://account.shodan.io/register. If you’re using a valid API key and getting a shodan.APIError then my guess would be that you’re trying to use a method that is only usable by accounts of p&hellip;", "There are hardware protections such as the NX bit but they are supported by x86 architectures as well, they’re not exclusives of x64. If you want to practice buffer overflows on an unprotected system you should try Protostar, but you’ll have to write all your exploits for a x86 system. It’s also pos&hellip;", "There are a certain numbers of protections in modern systems, also for 32 bit architectures. In my post I don’t explain too much since the compilation flags used to generate the binary are such that the simplest memory configuration is created (i.e. executable stack, not randomized address, etc…) a&hellip;", "Hi, just wondering this but doesn’t x64 architecture have a protection against shellcode or something like that? Been working on The Art of Exploitation and they’ve mentioned something about a protection in the kernel to prevent abuse or something… don’t quote me on that. lololol.", "Nice job man… I’ve looked at your code briefly and well, I decided to mess around with shodan a bit in Python and found a error that I can’t seem to resolve… basically when I do: try:#do stuffexcept shodan.APIError as error:#do stuffThere’s a error thrown at ‘except shodan.APIError as error:’ &hellip;", "Damn dude… this is cool. Nice share. As pry0cc suggested, please do a write up. That would be awesome!", "There’s also a handful of supremely average folk in their late 20’s.", "Hi guys… been a while since I’ve last posted. Welp, here we go. What I have today is a pretty cool practice website to practice SQLi’s on (SQL Injections). The site in question is: http://leettime.net/sqlninja.com/ If you don’t know what a SQLi is, OWASP has a pretty decent explanation and a coupl&hellip;", "I’m going to re-edit the Original post as these questions have been sent quite a bit.", "I’m thinking of creating a IRC channel for this except I don’t want to be OP… lol. @0x6e756c6c should be the OP since he is the creator of this thread (I also don’t know how to setup the IRC channel). Will talk to fraq about this being a potential and will update in the comments of this thread if I &hellip;", "My advice… even if you don’t need the points… jump at every opportunity. There’s no shortcuts to getting a certificate and honestly, it’s better to play it safe than be sorry. Just for future reference. Other than that one hiccup, dude, mad respect… you’ll get it next time. lol.", "Clientside Exploitation - Tricks of the Trade 0x01 - Sharpshooter + SquibblyTwoHi! I hope you’re well, today I am going to show you something that is common knowledge in the red teaming community, people use this kind of thing every day without thinking about it. However, if you’re new to security,&hellip;", "My advice… even if you don’t need the points… jump at every opportunity. There’s no shortcuts to getting a certificate and honestly, it’s better to play it safe than be sorry. Just for future reference. Other than that one hiccup, dude, mad respect… you’ll get it next time. lol.", "My advice… even if you don’t need the points… jump at every opportunity. There’s no shortcuts to getting a certificate and honestly, it’s better to play it safe than be sorry. Just for future reference. Other than that one hiccup, dude, mad respect… you’ll get it next time. lol.", "Just create a account and send a PM to @0x6e756c6c on here or on the IRC.", "Just create a account and send a PM to @0x6e756c6c on here or on the IRC.", "Just create a account and send a PM to @0x6e756c6c on here or on the IRC.", "NiHwk CTF https://ctf2018.nihwk.net/ 25 Aug., 08:00 UTC — 26 Aug. 2018, 23:00 UTC Shoutout of the week goes to Pyhscript for their hard work in creating a writeup for last weeks CTF on a web attack involving a Directory Traversal Come join the fun and learning experience! All noobs and skids we&hellip;", "Nice writeup… kudos to you. Nice well use of already pre-existing tools.", "Nice writeup… kudos to you. Nice well use of already pre-existing tools.", "This weekend we participated in Whitehatvn Grandprix CTF and this is one of the 2 real challenges we managed to solve. Big thanks to @L0k1 for executing exploit while challenge was officially down, getting us flag quicker (and for being help in brainstorming). Description: manhndd is running a s&hellip;", "We now have a newly created 0x00sec team on HackTheBox. Direct message me on 0x00sec or join #htb on IRC and leave a message with the regulars if you want to be added to the team. Notes: You cannot join more than one team on HTBThere is zero entry requirements to join our team. Just being an 0x&hellip;", "If you’ve never done a CTF before, this is your chance! They are security challenges people create to up your skills. THIS is how you get better at security. THE GRIND!!! This appears to be a beginner CTF. Categories include: RE, pwnable, cryptography, forensics, websec, misc Pick one you want&hellip;", "[image] [image] [image]dotfiles: https://github.com/l0x6c/dotfiles", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "What’s up boys &amp; girls? Before we enter the world of pentesting, first of all we have to prepare for that. It’s important to know how to learn. The reason for this is the quantity of the information you will collect and you have to work with. Furthermore it’s important to structure your thoughts, n&hellip;", "Ah! I solved this challenge just yesterday so it’s nice to see this, it was a fun new technique to learn, and I can talk a little bit about it as requested by @pry0cc, even if… well… that wasn’t directed to me, but still, I want to contribute. This is a deserialization flaw, what this means is that&hellip;", "I wish I could go, but not this year.  Maybe next time.", "Hi all, f0rg here with another tutorial. Since most of us frequent IRC, lately some if not all the Tor exit nodes have been banned. I’m not claiming that this works 100% of the time, but it should work most of the time. Anyways, This is my work around of their ban of Tor exit nodes because lately m&hellip;", "[grafik]Heyho all, upon Phoenix750 request I create this tutorial. Here I will show you how install Parrot Security and how to change the desktop environment of Parrot from MATE to XFCE. Content:What is Parrot Security?Installation of Parrot SecurityChange your DE.What is Parrot Security?P&hellip;", "Hey thanks, I’ve been meaning to practice SQLi. I’ll dig through my links for tutorials and post them here when I find them, if that’s acceptable. These links were of use to me, hopefully to you all too: https://www.w3schools.com/sql/sql_injection.asp https://www.incapsula.com/web-application-sec&hellip;", "Hi guys… been a while since I’ve last posted. Welp, here we go. What I have today is a pretty cool practice website to practice SQLi’s on (SQL Injections). The site in question is: http://leettime.net/sqlninja.com/ If you don’t know what a SQLi is, OWASP has a pretty decent explanation and a coupl&hellip;", "Hi guys… been a while since I’ve last posted. Welp, here we go. What I have today is a pretty cool practice website to practice SQLi’s on (SQL Injections). The site in question is: http://leettime.net/sqlninja.com/ If you don’t know what a SQLi is, OWASP has a pretty decent explanation and a coupl&hellip;", "Thank you so much i will be joining soon", "The IRC is irc.0x00sec.org:6697+ and there’s currently no discord atm.", "Hi guys… been a while since I’ve last posted. Welp, here we go. What I have today is a pretty cool practice website to practice SQLi’s on (SQL Injections). The site in question is: http://leettime.net/sqlninja.com/ If you don’t know what a SQLi is, OWASP has a pretty decent explanation and a coupl&hellip;", "Hi guys… been a while since I’ve last posted. Welp, here we go. What I have today is a pretty cool practice website to practice SQLi’s on (SQL Injections). The site in question is: http://leettime.net/sqlninja.com/ If you don’t know what a SQLi is, OWASP has a pretty decent explanation and a coupl&hellip;", "Glad to hear you’re interested in it man - I’m getting started on a write-up now!", "Glad to hear you’re interested in it man - I’m getting started on a write-up now!", "Damn dude… this is cool. Nice share. As pry0cc suggested, please do a write up. That would be awesome!", "Ok, I’m done customizing my final setup. Here are some screenshots. Would like to hear @pry0cc’s and @fi6uh’s rating especially! I run ArcoLinuxB, which is basically Arch Linux with some themes and configs included. I debloated it using their BYOI project and further customized my shell with zsh an&hellip;", "Damn dude… this is cool. Nice share. As pry0cc suggested, please do a write up. That would be awesome!", "https://github.com/colental/byob Built this to teach myself Python. Any thoughts?", "Hey! You could open http://gen.lib.rus.ec/ and search for “python network” and download hundreds of books to this Topic. I tried “python scrapy” and it found: Learning Scrapy: Learn the art of eficient web scraping and crawling with PythonIf you want to build a botnet, don´t rely on those “how t&hellip;", "[olddd]", "[old]", "Thanks! I actually used m2crypto to generate the p and g parameters for diffie-hellman, since that was something I didn’t want to implement myself. I know m2crypto can do the whole process, but what @lkw said is correct, I wanted to try doing it myself so I could learn. It’s a great library though,&hellip;", "Thanks! I actually used m2crypto to generate the p and g parameters for diffie-hellman, since that was something I didn’t want to implement myself. I know m2crypto can do the whole process, but what @lkw said is correct, I wanted to try doing it myself so I could learn. It’s a great library though,&hellip;", "This probably could sound retarded, but, I was curious if you could use something like m2crypto? I saw the implementation briefly with another program in Python, but that’s a long story. Maybe something worth looking into? Btw, nice post man… thank you for finishing it up and welcome back. With tha&hellip;", "I think part of the point of the post was to implement the crypto to see how it could work instead of using an openssl wrapper.", "I think part of the point of the post was to implement the crypto to see how it could work instead of using an openssl wrapper.", "This probably could sound retarded, but, I was curious if you could use something like m2crypto? I saw the implementation briefly with another program in Python, but that’s a long story. Maybe something worth looking into? Btw, nice post man… thank you for finishing it up and welcome back. With tha&hellip;", "Aye p33ps! Seeing as WannaCry took the world by storm recently, I thought that it’s probably a good time to introduce the world of malware analysis to this forum. In this post, I will write about how you guys can join in on the mayhem and play with some fire (and hopefully not get burnt in the proce&hellip;", "@FinFlag : this could be a great project for 0x00sec (looks @pry0cc). @REal0day : nice post, I will definitely look into this stuff and will RE the hell out of it… I assuming most of these are for Windows and adware or a RAT?", "", "I don’t know the error… so what’s the error?", "Here’s all the malware I’ve been collecting from my honeypot. Enjoy the Park! [image]", "@FinFlag : this could be a great project for 0x00sec (looks @pry0cc). @REal0day : nice post, I will definitely look into this stuff and will RE the hell out of it… I assuming most of these are for Windows and adware or a RAT?", "I build my own exploits…  JK… I rarely ever use exploitdb/whatever-those-kids-are-using-these-days, but I used to use 0day. ~Cheers! –Techno Forg–", "Hello, my 0x00’ers! You may have noticed @0x00pf’s awesome reverse engineering content, and you may have noticed he has posted raw binaries (without source), now, of course, it’s reverse engineering, the challenge is about not knowing the source. But how do you and I know that @0x00pf is not a mad &hellip;", "You can’t beat me and my 1337 haxxor setup that I’ve upgraded from plain black to orange… I win hands down.", "Interesting… interesting indeed. I believe that the ‘hackers’ that don’t have a degree are the most well respected. Btw, clearly I have low esteem so I just crack a dirty joke and I feel better. lololol.", "I will look into it… doubt I will come up with much though &#39;cuz I’m just a scrub. lololol.", "Could set it up at home, but I’m not sure the safest way of doing this. Much iptable rules.", "Interesting… now what to do if you don’t have a CC (and not for the lack of trying)?", "CC? Credit card? Don’t use a VPS then. Portforward it like a maniac.", "Interesting… now what to do if you don’t have a CC (and not for the lack of trying)?", "As requested by @pry0cc, well, not really a request… more like I threw out there a idea and pry volunteered me to do a tutorial. Ok, fine, I guess. Anyways, with that all being said and done as the name suggests this is how to securely connect to IRC using Hexchat and ToR. It isn’t that complicated,&hellip;", "Great post… but WHY THE HELL AM I NOT ON THE POLL!!! Jk… I’m a scrub. lolololol. Jokes aside. This is really a great post and hopefully this’ll help me dox everyone… (evil laughter).", "Great post… but WHY THE HELL AM I NOT ON THE POLL!!! Jk… I’m a scrub. lolololol. Jokes aside. This is really a great post and hopefully this’ll help me dox everyone… (evil laughter).", "As requested by @pry0cc, well, not really a request… more like I threw out there a idea and pry volunteered me to do a tutorial. Ok, fine, I guess. Anyways, with that all being said and done as the name suggests this is how to securely connect to IRC using Hexchat and ToR. It isn’t that complicated,&hellip;", "Greetings from space, It’s great to post once in a while and help share knowledge. This series is an android series. We will develop spying features into our app. I’m naming the app AMUNET but you are free to of course name it as you please. The idea originated from the God’s Eye hacking program in&hellip;", "Oh lordy… this depends on whether or not you want to spend $10 bucks or $100 bucks… I got a new one for my RPi and I’m grateful that I got it. Why? My Windows box doesn’t have the drivers for the wireless card that I use for my Linux’s box, installed properly that is. My mind remembered that I got a&hellip;", "As requested by @pry0cc, well, not really a request… more like I threw out there a idea and pry volunteered me to do a tutorial. Ok, fine, I guess. Anyways, with that all being said and done as the name suggests this is how to securely connect to IRC using Hexchat and ToR. It isn’t that complicated,&hellip;", "I build my own exploits…  JK… I rarely ever use exploitdb/whatever-those-kids-are-using-these-days, but I used to use 0day. ~Cheers! –Techno Forg–", "I build my own exploits…  JK… I rarely ever use exploitdb/whatever-those-kids-are-using-these-days, but I used to use 0day. ~Cheers! –Techno Forg–", "Can’t ignore your waifu! It’s too cute", "The ‘hexchat dark theme’ is actually my system theme.", "Here’s a update since I’m too lazy to edit my post (more like scroll up)… I’ve decided to have a bit of fun with GTK 2.0 themes. Enjoy!                                                                                  [Album] Imgur                                                  [Imgur]    &hellip;", "Here’s a update since I’m too lazy to edit my post (more like scroll up)… I’ve decided to have a bit of fun with GTK 2.0 themes. Enjoy!                                                                                  [Album] Imgur                                                  [Imgur]    &hellip;", "Yeah I get it and it is normal… I was fourteen/fifteen when I started delving into coding and hacking… I wasn’t very good but I stuck to it. That’s the key. So many quit because it’s hard, but hard work pays off. I can relate. I am now eighteen years old and going to college for software engineer. T&hellip;", "Wow… cmder is really nice. Good share!", "As requested by @pry0cc, well, not really a request… more like I threw out there a idea and pry volunteered me to do a tutorial. Ok, fine, I guess. Anyways, with that all being said and done as the name suggests this is how to securely connect to IRC using Hexchat and ToR. It isn’t that complicated,&hellip;", "Dude that’s a cool ass setup… but my LXDE setup is cooler.", "Dude that’s a cool ass setup… but my LXDE setup is cooler.", "Dude that’s a cool ass setup… but my LXDE setup is cooler.", "I think I will give a small youtube on my plans because who cares, probably with adjoined hangouts so people can join next week, will see if I can rope fraq etc in", "That is why it is under a project header my idea is to create this as a general distributed project, when an attack is detected its sig will be distributed to the client list connected. so everyone can write their own retaliatory attack against anything  Its a community whitehat(kinda) project", "That is why it is under a project header my idea is to create this as a general distributed project, when an attack is detected its sig will be distributed to the client list connected. so everyone can write their own retaliatory attack against anything  Its a community whitehat(kinda) project", "This was an absolutely amazing example of catching malware in the wild and reversing it. However, I’d like to address what i’m seeing in the comments: Let’s discuss the work that @lkw and friends performed here and not use this as a support thread to ask for help with the malware you discovered. Ta&hellip;", "DISCLAIMER: The following post contains a virus sample. If you decide to mess with it you do so at your own risk. Do not go running it on your computer, at least use a VM. Some random new “user” called @the_heat_man posted some files on the forums multiple times (after being deleted by mods) calimi&hellip;", "I would love to help out, but I don’t know how much I could help. XD Anyways, great idea and ~Cheers! –Techno Forg–", "Good day all, I have a fun project I would like to invest some time into and am interested if anyone would like to join me on the voyage. Quite simply it is an extension of a honeypot, though one with an odd response. When an inbound attack is sent it is caught and run through an engine I will de&hellip;", "The core would likely be prototyped in csharp or perl but the actual idea is infrastructure based there is no reason anyone could not for instance add a handler for a specific attack vector signature in php or vb  distribution being the king and all", "Hopefully not perl…", "@pry0cc, share your dot files… I want to see your i3wm config file specifically.", "Below is a curated list of member projects. These are not officially endorsed by 0x00sec. Instead, it’s merely a collection of software projects our members contribute to or own. If you’re looking for something to get involved with, here’s a great place to start. Want to see your name on this list? &hellip;", "As requested by @pry0cc, well, not really a request… more like I threw out there a idea and pry volunteered me to do a tutorial. Ok, fine, I guess. Anyways, with that all being said and done as the name suggests this is how to securely connect to IRC using Hexchat and ToR. It isn’t that complicated,&hellip;", "As requested by @pry0cc, well, not really a request… more like I threw out there a idea and pry volunteered me to do a tutorial. Ok, fine, I guess. Anyways, with that all being said and done as the name suggests this is how to securely connect to IRC using Hexchat and ToR. It isn’t that complicated,&hellip;", "As requested by @pry0cc, well, not really a request… more like I threw out there a idea and pry volunteered me to do a tutorial. Ok, fine, I guess. Anyways, with that all being said and done as the name suggests this is how to securely connect to IRC using Hexchat and ToR. It isn’t that complicated,&hellip;", "As requested by @pry0cc, well, not really a request… more like I threw out there a idea and pry volunteered me to do a tutorial. Ok, fine, I guess. Anyways, with that all being said and done as the name suggests this is how to securely connect to IRC using Hexchat and ToR. It isn’t that complicated,&hellip;", "As requested by @pry0cc, well, not really a request… more like I threw out there a idea and pry volunteered me to do a tutorial. Ok, fine, I guess. Anyways, with that all being said and done as the name suggests this is how to securely connect to IRC using Hexchat and ToR. It isn’t that complicated,&hellip;", "As requested by @pry0cc, well, not really a request… more like I threw out there a idea and pry volunteered me to do a tutorial. Ok, fine, I guess. Anyways, with that all being said and done as the name suggests this is how to securely connect to IRC using Hexchat and ToR. It isn’t that complicated,&hellip;", "As requested by @pry0cc, well, not really a request… more like I threw out there a idea and pry volunteered me to do a tutorial. Ok, fine, I guess. Anyways, with that all being said and done as the name suggests this is how to securely connect to IRC using Hexchat and ToR. It isn’t that complicated,&hellip;", "Oh lordy… ok so… the only issue with that is that I’m lazy. Lets ask @suser to do it. XD Fine… I will do it once I’m done with my ‘pentest’ so see it in like 5 months.", "You can make one! Thanks for volunteering!", "Who talk about security when using IRC?", "I think there should also be a post for how to securely connect to IRC using proxies/ToR. Just saying since cloaks don’t hide you well enough and only provide a false sense of security.", "So a lot of people seem confused about where we are, let’s just go through exactly where our IRC is. We are not on freenode anymore. We were, and then we were kindly donated a server by @L0k1 We are however at: irc.0x00sec.org 6697+. And cloaks are enabled by default. If you want to access the we&hellip;", "@pry0cc, share your dot files… I want to see your i3wm config file specifically.", "My Surface setup.                       [image]           I have a desktop PC as well but I am not at home at the moment.", "Here is my badA$s setup  [image]", "Comprehensive article with an emphasis on those who don’t know hardware all too well. Am I glad that you started this series so I won’t have to!", "FINALLY!!! Something that I understand instead of these weirdos posting RE stuff (RE sucks (jk))… I’m excited to do more projects with my Arduino Uno. Good job! I will do a more thorougher reading later since I’m busy atm, but I see from a fast scrolling how well in detail this is. Oh btw, @Evalion &hellip;", "My Kali box has a skull where the menu is… I might edit my post later once I find time with my Kali setup.", "My Kali box has a skull where the menu is… I might edit my post later once I find time with my Kali setup.", "This looks really cool @Techno_Forg, I like what you’ve done with it.", "My Introduction First, I would like to thank 0x00sec for providing such a great community. I would also like to thank Arrogant Bastard, Sierra Nevada and Deathwish Coffee for providing the sustenance necessary for starting and completing the following series. Not only should you get drunk while com&hellip;", "FINALLY!!! Something that I understand instead of these weirdos posting RE stuff (RE sucks (jk))… I’m excited to do more projects with my Arduino Uno. Good job! I will do a more thorougher reading later since I’m busy atm, but I see from a fast scrolling how well in detail this is. Oh btw, @Evalion &hellip;", "This looks really cool @Techno_Forg, I like what you’ve done with it.", "Ok so… I’m not gonna post any pictures (just might do one), but I’m very limited with what I can run. First off, I’ve decided to install Debian again and this time I’m running lx as my DE (lxde), but it’s very light yet very customizable. On my Kali box, which is on another hard drive, I’ve decided &hellip;", "@pry0cc, share your dot files… I want to see your i3wm config file specifically.", "Ok so… I’m not gonna post any pictures (just might do one), but I’m very limited with what I can run. First off, I’ve decided to install Debian again and this time I’m running lx as my DE (lxde), but it’s very light yet very customizable. On my Kali box, which is on another hard drive, I’ve decided &hellip;", "@pry0cc and @fraq  recently announced that 0x00sec will be reformed. They did this in an internal thread in the VIP loungue. I am not the right person to explain it to the big public (the staff will do in the near future probably), but basically we want 0x00sec to be more varied instead of being sol&hellip;", "Yo, can you add me to the list of 0x00secHelpers?", "I see now. Sorry for misinterpreting.", "This seems like people are misunderstanding how this works. This is pulling names from LinkedIn, and guessing email addresses from those names. Assuming they have an email address for their company.", "Hm… interesting stuff, but couldn’t you just create your own email ‘wordlist’ using a script instead of scraping google? I mean that would be time consuming but if you know the pattern then doing that should be easier. Maybe something to look into? P.S. I could do this using Perl if need be or use &hellip;", "OSINT 0x02 - LinkedIn is not just for jobsSup 0x00’ers, that’s right, I am back with another banger of an article, ready? If you read my last article on OSINT, you’ll know a little bit on how to find dirt on companies, their assets, and how to do all of that passively. Well now I am going to show &hellip;", "What exactly is the purpose here? Just curious.", "I was already there, but somehow my client is not able to connect…therefore - after my vacation - I thought it is freenode. FML!", "Note: We&#39;re not on freenodeThe network is  irc.0x00sec.org:6697 . It’s up and running and inhabitated", "I think there’s a tool written in Python that can do this job… let me see if I can find it (it’s saved to my drive)… (Five hours later) Alright, I’m back… found the github link after saving the world from aliens. On a more series note… this I think should be worth  looking into. It does ALMOST &hellip;", "I think there’s a tool written in Python that can do this job… let me see if I can find it (it’s saved to my drive)… (Five hours later) Alright, I’m back… found the github link after saving the world from aliens. On a more series note… this I think should be worth  looking into. It does ALMOST &hellip;", "Thank you for helping.I am searching and learning new module.If i face any problem i will send message you", "Thank you for helping.I am searching and learning new module.If i face any problem i will send message you", "Ok so… I suggest you look at other Web Scanners specifically Nikto since I believe this is what you’re looking at. Looking at other source code could help, but despite this, nikto is written in Perl so if you need any help please either throw a PM to me @Techno_Forg or throw a PM to @nugget. Nikto b&hellip;", "I will try ToR/VPN, but it is showing up as filtered. So I don’t know. Proxychains still returns filtered with Nmap but that could be because it’s proxychains. I will try to use AnonSurf using ParrotSec to see what happens. Btw, my command is: nmap -sV -A -Pn -p 21,22 (IP) I believe so. I honestly&hellip;", "Hello 0x00sec… I’ve ran into a really suspicious process that I’m asking for help with. Ok so, here goes my rant… Basically I’ve found a IP with FTP open and decided to boot in Kali (Yeah I know, I’m a scrub). Seeing if I can crack a login with Medusa since Hydra sucks. Now everything and I mean ev&hellip;", "Ok so… that’s kermit’s and suser’s doing. lol. (I actually have no idea) –Techno Forg–", "What exactly is the purpose here? Just curious.", "I didn’t see the repo, but why you would want this?", "Yea I’ve seen this kind of thing done with Javascript before a long time ago when chrome first started hitting the scene. Plus it’s a bit ridiculous doing it in python but it’s fun to mess with (for a developer at least)", "Yea I’ve seen this kind of thing done with Javascript before a long time ago when chrome first started hitting the scene. Plus it’s a bit ridiculous doing it in python but it’s fun to mess with (for a developer at least)", "I’m no dev in Python but just curious if you could replicate this using Beautiful Soup or use Selenium or even PhantomJS?", "Well, it depends of what learning materials means to you. Indeed, there are several types of people in this vast world. Some of them needs practice to assimilate new concepts and that is what those projects have been uploaded for. Moreover, having guideline and starting a project from scratch can b&hellip;", "Well, it depends of what learning materials means to you. Indeed, there are several types of people in this vast world. Some of them needs practice to assimilate new concepts and that is what those projects have been uploaded for. Moreover, having guideline and starting a project from scratch can b&hellip;", "Hi fellas, It’s sharing time! With this wave of new comers who want to learn how to develop in C, I selected a few projects from my ex-uni that could be valuable to anyone wanting to dive in the C world. Those exercices can be downloaded through the following URL: https://0x0.st/UIG.zip Note: Ea&hellip;", "Wouldn’t it just be easier to just code as you need to? Like for example, I personally script in Perl when I’m haxing or too lazy to click a button and automate everything… lulz. Personally I find that more helpful in the long run instead of doing projects all at once and mind that most of our atten&hellip;", "Oh and for the record: Webchat/Kiwi IRC is now at https://webchat.0x00sec.org", "Suser being suser again? Anyways… hm… this’ll be somewhat inconvenient but I also don’t have to hear suser for a bit…  I hope everything goes smoothly with the updates.", "Suser would like for me to say that he was here, but he never gets on the forum, so he wasn’t.", "PrefaceThis quick article will give a short introduction on what fuzzers are, how they work and how to properly setup the afl - american fuzzy lop fuzzer to find flaws in arbitrary projects. Well known alternatives to afl (for the same or other purposes): boofuzz: Network Protocol Fuzzing for Hu&hellip;", "Hi @haalim, Thanks for reading my posts. I’m glad to hear they were useful  Answering your questions:  actually, if you feel like that, it means that you are going in the right direction. Take that as an indication that you are doing well. Whenever you believe that you know everything, that usua&hellip;", "@haalim, I can only assist you on the hardware part here. If you are serious about hardware, then buy either an Arduino, RPI, some PIC microcontrollers and some basic components and make something with them and program them. You could use some tutorials as a starting point but after that you should&hellip;", "As alot of people mention in here, never stop searching. I started wheb i was 12 and I started with C++ it took me a long time to really understand it. Every now and then I saw speed coding videos and every little thing I didnt ubderstand I reseaech it. I also read CTF walktroughs even if I wasnt do&hellip;", "When I started out I didn’t have as much as most have today in the way of resources, (elitehackers.com in the late 90’s), but I did find it beneficial to set a task and complete it. Such as, writing a Perl script that does a particular task or in your case, writing something that can propagate a net&hellip;", "Yeah I get it and it is normal… I was fourteen/fifteen when I started delving into coding and hacking… I wasn’t very good but I stuck to it. That’s the key. So many quit because it’s hard, but hard work pays off. I can relate. I am now eighteen years old and going to college for software engineer. T&hellip;", "A few months ago I wrote up a silly project to implement purely in memory SO (shared object) loading via the memfd_create syscall. I forgot to include y’all in the fun and I am sorry . Sho’ nuff’ this is possible in just a few lines of python. I wrote it up as a class and it still is less than 20&hellip;", "I might look at the code after I’m done with my current project (top secret), but if it’s anything like nikto than I probably can figure out how it works… although, it’s written in python. Maybe I could try re-writing it in Perl for those that prefer Perl? Just a thought. –Techno Forg–", "Seems like a great idea except what you’re asking is probably primarily should be asked to the Window’s guru: @dtm (Yes I summoned you). Anyways… feel free to ask whatever you wish and I’m sorry that’s how you feel like this. I personally don’t think as a community we have a lack of understanding of&hellip;", "so basically this is a fail because i suck at maths. I thought cubing meant to do it by the same number, once i changed pow($a[$i], 3); it worked just fine and satisfied all test cases. Thanks @CGMS, maybe I need to take a tour through some khan academy courses. My math is seriously fucked, like pr&hellip;", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "um… I suck at math, but I suggest grab a calculator… lol. Double check your math. Your last comment for some reason doesn’t look right…", "um… I suck at math, but I suggest grab a calculator… lol. Double check your math. Your last comment for some reason doesn’t look right…", "No problem. Glad to help.", "I grew up with Windows but I’ve only recently made the switch over to Linux so I really can’t make any comparisons between the two yet. I guess it depends on what you want to learn about Windows. If you’re just looking for a high-level abstracted understand of the operating system ((special) direct&hellip;", "Thanks for the reply and the summon", "Seems like a great idea except what you’re asking is probably primarily should be asked to the Window’s guru: @dtm (Yes I summoned you). Anyways… feel free to ask whatever you wish and I’m sorry that’s how you feel like this. I personally don’t think as a community we have a lack of understanding of&hellip;", "Seems like a great idea except what you’re asking is probably primarily should be asked to the Window’s guru: @dtm (Yes I summoned you). Anyways… feel free to ask whatever you wish and I’m sorry that’s how you feel like this. I personally don’t think as a community we have a lack of understanding of&hellip;", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "Yeah… the Wiki category allows the community to collaborate and edit the Wikis together. I haven’t edited my wiki in a while and will add more links soon (been busy), but… please feel free to combine some of the content and please give credit to those that deserve it. –Techno Forg–", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "Recently I moved into a new suburban neighborhood littered with default router access points. One day, I decided I wanted to test my luck and see what I could get by using a simple but very effective Wordlist A few years ago I use to work as a cable installation technician. I’ve noticed most techni&hellip;", "I don’t know the internals of ngrok enough to know if this is a good idea. But anyways, I tried a bit around with it and got it a working connection through torify ./ngrok http 80 I would assume connecting through tcp would work as well? I’m a bit confused by that. Next I read a bit through the d&hellip;", "This seems very similar to Forg’s  Wiki and Your Complete, Unbudgeted Toolkit. Good content but a suggestion for the future… you can edit WiKis in the WiKi category. I believe this was done for this exact purpose. So yeah… –Techno Forg–", "Have you had a look at ToR’s documentation? I personally think your answer lies in the design of ToR itself, but this may or may not help you. I also feel like there is a piece missing here… or is that just me?", "Psssst… I shall mention we have a IRC at irc.0x00sec.org port 6697. It’s great how I see people collaborating but just a thought for the future. ; )", "Well, in theory, yes … However, this is not how Drupal or its associated hardening plugins works. Moreover, web applications follow the HTTP RFC consequently, protected contents often return a 403 status code, 404 for unexisting one and so on. It is the respect of this norm which allows us to perfo&hellip;", "You are right, but installing TOR at victim’s side is a pain. I was trying to do something which gives the same result (anonymous link to the victim) but away from installing TOR at victim’s side 1- I buy a domain (using TOR) from NGROK 2- Hardcode it in the victim code 3- Run NGROK on my TailsO&hellip;", "Well, in theory, yes … However, this is not how Drupal or its associated hardening plugins works. Moreover, web applications follow the HTTP RFC consequently, protected contents often return a 403 status code, 404 for unexisting one and so on. It is the respect of this norm which allows us to perfo&hellip;", "I’m slightly confused and here’s a quick thought… I remember somewhere that WannaCrypt used ToR in order to say anonymous… Is that what you’re trying to accomplish?", "Hm… Ok so… sorry for my lack of understanding, but… I read somewhere that even though that a webpage or whatever you’re trying to test… if it returns a status code of lets say 200, couldn’t it still be unreliable?", "DISCLAIMER: Article originally published on immunIT. Hi fellas, Today, I will introduce you a new tool, developed for the sake of my penetration testing activities, named Drupwn which claims to provide a reliable and efficient way to perform enumerations on Drupal web applications. You may thin&hellip;", "Hello all, Nestor10 here to share a couple things I’ve learned in my day job as an infosec samurai. If you want to know some vague things about me, you can check out my introduction. So a few months ago, I noticed some emails coming in with really sketchy attachments - a few dozen had been delivere&hellip;", "Oh lordy… simple, BURN IT!!! On a more serious note… play with it. The limit is the sky (?)", "Maltego is a really cool script (?) that uses several different other existing tools (e.g. TheHarvester, Nikto, and Nmap). Might be worth looking into.", "This is my solution to the Basic Pentesting: 1 challenge by Josiah Pierce. His challenge can be found on VulnHub at: https://www.vulnhub.com/entry/basic-pentesting-1,216/ Let’s get started. 0x00 DetailsWe are not provided the IP address of our target machine, so we had to use other means to look&hellip;", "I have little experience with python, but… I think you’d benefit from looking at STELF’s source code on gitlab, specifically the compile script. This is a older version of STELF, but @Joe_Schmoe  also has stelfier which is Python converted to C version of STELF. Hopefully this helps you out… Happy&hellip;", "I have little experience with python, but… I think you’d benefit from looking at STELF’s source code on gitlab, specifically the compile script. This is a older version of STELF, but @Joe_Schmoe  also has stelfier which is Python converted to C version of STELF. Hopefully this helps you out… Happy&hellip;", "Thank’s for giving a hand of help can you explain to me his idea? will it convert it into C like cython ? or take it all the way to a neat exe ?", "Maltego is a really cool script (?) that uses several different other existing tools (e.g. TheHarvester, Nikto, and Nmap). Might be worth looking into.", "I have little experience with python, but… I think you’d benefit from looking at STELF’s source code on gitlab, specifically the compile script. This is a older version of STELF, but @Joe_Schmoe  also has stelfier which is Python converted to C version of STELF. Hopefully this helps you out… Happy&hellip;", "PrefaceYo! It’s been a long time since I last posted anything here. Life kept me more than busy, but now I’ve got a little more time on my hands. I decided to do a write up on the following binary, because it taught me some new things, compared to the easy reversemes I did before. Furthermore &hellip;", "Oh lordy… simple, BURN IT!!! On a more serious note… play with it. The limit is the sky (?)", "What do you mean… one isn’t clean? For conversations like these… they’re nice and all but we do have a irc; irc.0x00sec.org/6697", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "Oh lordy… I don’t mean to advertise here but check out my Wiki. Other than that… I’m outta ideas. lol.", "burn it live on youtube.", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "WWW::Mechanize library is what I use in Perl. Basically WWW::Mechanize is kind of like a browser in a script. (@nugget please correct me if I’m wrong). Documentation: http://search.cpan.org/~oalders/WWW-Mechanize-1.86/lib/WWW/Mechanize.pm This is quick and dirty as @pry0cc stated, but I would thi&hellip;", "How do I or you make a living? Good question and there’s number of answers. I’ve been looking at jobs for several companies and most of them surprisingly only require that you’re 18 or older and at least willing to learn, but of course the ignorant require BS. There’s also such thing as freelancing &hellip;", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "IRC is back to normal as far as I know. Please join #0x00sec at irc.0x00sec.org/6697", "First of all, thanks for all the answers!  @fxbg Yes, I’m searching and learning about that. But my concern is about the IP leakage when Nmap bypasses the Proxychain during the part of the execution, as mentioned here @Nitrax Do you have any guide/link about that in hands to share? I would real&hellip;", "Have you looked into FIN scan or a connection less scan? It’s all based upon how the packets work (correct me if I’m wrong).", "How do I or you make a living? Good question and there’s number of answers. I’ve been looking at jobs for several companies and most of them surprisingly only require that you’re 18 or older and at least willing to learn, but of course the ignorant require BS. There’s also such thing as freelancing &hellip;", "Techno_Forg - Thank you. You are welcome. I don’t get to give back here as much as I’d like, so when I can, I am glad to read members here are finding it of value. -maderas", "Awesome read! Really nice… thank you for posting.", "Hello SmartOne and thank you. To be honest, I only really began working on penetrating web applications because that is becoming the best way to gain ingress. I am more a grasp a bunch of things and get what I need guy; I’m like a half blind lab rat that always finds the cheese… There are people &hellip;", "We Need Hackers Now More Than EverI“Yes, I am a criminal. My crime is that of curiosity.” In the years since The Hacker Manifesto was first typed out, much of the internet has changed. It has grown in both size and scope. New protocols have been invented. The web was born. It is altogether diffe&hellip;", "Hm… interesting. This sounds like fun. Thanks for this contest admins! I think since I am working on a project anyways, this’ll turn into a great way to show what I’ve learned, but of course I will still post it anyways despite this contest. Cheers! –Techno_Forg–", "Hm… interesting. This sounds like fun. Thanks for this contest admins! I think since I am working on a project anyways, this’ll turn into a great way to show what I’ve learned, but of course I will still post it anyways despite this contest. Cheers! –Techno_Forg–", "How do I or you make a living? Good question and there’s number of answers. I’ve been looking at jobs for several companies and most of them surprisingly only require that you’re 18 or older and at least willing to learn, but of course the ignorant require BS. There’s also such thing as freelancing &hellip;", "Hm… interesting. This sounds like fun. Thanks for this contest admins! I think since I am working on a project anyways, this’ll turn into a great way to show what I’ve learned, but of course I will still post it anyways despite this contest. Cheers! –Techno_Forg–", "LYNXI have been into web scraping for a long time, since the first time I realized people will pay for large neatly organized data. I came across something interesting and wanted to pass some knowledge onto others. Lynx is a command line based browser. I first discovered it when I had my first Linu&hellip;", "WWW::Mechanize library is what I use in Perl. Basically WWW::Mechanize is kind of like a browser in a script. (@nugget please correct me if I’m wrong). Documentation: http://search.cpan.org/~oalders/WWW-Mechanize-1.86/lib/WWW/Mechanize.pm This is quick and dirty as @pry0cc stated, but I would thi&hellip;", "If you’re familiar with the Damn Vulnerable Web App (DVWA) then you will love this. It’s called Hackazon and in its own words: Hackazon is a free, vulnerable test site that is an online storefront built with the same technologies used in today’s rich client and mobile applications. Hackazon has an&hellip;", "I just noticed that too. Maybe they just want to get sued by Netflix maybe? Actually, it looks cool. Nice share @fraq.", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "It’s a wiki. So you should be able to edit it and add it.", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "#Overview This is my Wiki that I’ve gathered over the years. This is by no means complete and if some links are a repeat… please edit it at your leisure. Disclaimer: All content is at your own risk not mine. If you get arrested by the three-letter-organizations, don’t come whining to me. #Books: &hellip;", "Since some of us are teenagers earning $40 a week, there’s a backpack I just ordered that I think, serves my purposes:  Ok yes it isn’t as cool as: https://www.razerzone.com/store/razer-tactical-pro-backpack but I can put anything in it that I need. Including but not limited to: My zombie apoc&hellip;", "Since some of us are teenagers earning $40 a week, there’s a backpack I just ordered that I think, serves my purposes:  Ok yes it isn’t as cool as: https://www.razerzone.com/store/razer-tactical-pro-backpack but I can put anything in it that I need. Including but not limited to: My zombie apoc&hellip;", "Since some of us are teenagers earning $40 a week, there’s a backpack I just ordered that I think, serves my purposes:  Ok yes it isn’t as cool as: https://www.razerzone.com/store/razer-tactical-pro-backpack but I can put anything in it that I need. Including but not limited to: My zombie apoc&hellip;", "I’ve decided to get a hoodie for myself once I get paid, but before that, I want to make sure it is secure. Thanks! –Techno Forg–", "Well than, skimmed it briefly and saw that it looked good. Only suggestion is maybe less pictures. Looks good! –Techno_Forg–", "Instead of getting rid of sub categories completely… maybe add proper way to categorize in the Code of Conduct and if a user doesn’t follow the code, unlist it for a time and send a message instead? Just a suggestion. ~Cheers!", "@pry0cc   thank you  too", "yep they light help us for thinking", "@Techno_Forg and your welcome thank you man", "@Techno_Forg and your welcome thank you man", "thank you brother", "Interesting article. I have been working with LEDs with my arduino and they amaze me how simple yet intriguing they are. Nice article and welcome to the community! ~Cheers!", "Interesting article. I have been working with LEDs with my arduino and they amaze me how simple yet intriguing they are. Nice article and welcome to the community! ~Cheers!", "In the future, is there a possibility that you or somebody else maybe go into… lets say, worms for android?  Not suggesting anything. Clearly. ~Cheers!", "Warning: This is a really long and boring post ##Introduction: Most of my time has been dedicated to getting a new smart phone that’s both affordable and also well, unlockable and also rootable (I’ve concluded if it’s unlockable, it’s rootable, but I could be wrong). Anyways, after much searching &hellip;", "I’ve been rooting loads of phones lately for work and I’ve been following this exact process. But what made you use Resurrection Remix OS? I’ve been loading Lineage OS on the phones I’ve been doing, even the dev builds and was just wondering what the decision was there.", "Okay thats reasonable enough there is a dev build for the moto e4 thats out right now that I found if you were still wanting lineage os", "Long? Really? Good effort on this post forg.", "Long? Really? Good effort on this post forg.", "@fraq has confirmed to me on IRC that our opinion on this has been noted and they will make a system with this thread in their head. compromises will be made because it is impossible to please everyone, but i hope they’ll make a decision to please the majority of the community, which i assume they &hellip;", "Okay thats reasonable enough there is a dev build for the moto e4 thats out right now that I found if you were still wanting lineage os", "I wanted Lineage OS but there wasn’t a official version, but I did found in Google, Resurrection OS. It is a beauty. I guess, impulse?", "I have noticed the issue of closing of threads… it’ll be way easier to just remove from home screen. This way if anyone is like me and get bored, search up topics when need be. I mean, google is helpful for questions but I prefer this community than google and ugly posts that are in the search engin&hellip;", "Warning: This is a really long and boring post ##Introduction: Most of my time has been dedicated to getting a new smart phone that’s both affordable and also well, unlockable and also rootable (I’ve concluded if it’s unlockable, it’s rootable, but I could be wrong). Anyways, after much searching &hellip;", "The idea is that what I say is as comprehensible as possible and that better than detailing everything with images, however thanks", "Well than, skimmed it briefly and saw that it looked good. Only suggestion is maybe less pictures. Looks good! –Techno_Forg–", "Hi 0x00ers. This is my first post and my goal in it is to share and detail how you can exploit a buffer overflow by doing a detailed analysis of the executable and for that I will solve a challenge proposed by ricnar in its reversing course, it is clear that i just started on the subject of reversi&hellip;"]}