{"user": "Virgula", "history": ["I’m trying all in local so it’s useless port forward, I can make a try but it should work anyway and nope I didn’t modified docker build. It’s strange that it doesn’t work for you. I made this script few days ago but only now it definitely works. @Techno_Forg What you wrote it’s correct  but assume&hellip;", "I’m trying with https://github.com/hackerhouse-opensource/cve-2018-10933 and it works in local for me… check out and test with this my own modified working script here: https://github.com/Virgula0/POC-CVE-2018-10933 [68747470733a2f2f692e696d6775722e636f6d2f6f48476f4373582e706e67]", "The system in the showcase video was running Ubuntu 18.04 with Gnome and the theme used was materia-dark with FlatIcons.", "The system in the showcase video was running Ubuntu 18.04 with Gnome and the theme used was materia-dark with FlatIcons.", "It looks very interesting… Good share but personally I prefer ConfuserEx that does not interact with any server. P.s what distro of linux did you use in the video? I liked it very much", "Let’s not call BS on it quite yet… the scripts thus far could incomplete. I still need to study a bit longer. Please bear with me.", "All right, I tested all 6300 servers of Shodan, all servers that have vulnerable versions of libssh are ALL unexploitable. Most common exceptions and reasons are: ·Secsh channel 0 open FAILED: : Administratively prohibited =&gt; So Undefinied Exception. Probably channel is closed or not PortForwarde&hellip;", "I’m still testing all 6300 server automatically of @occupi list with my script since yesterday.", "Are you mass scanning them?", "Are you mass scanning them?", "I’m still testing all 6300 server automatically of @occupi list with my script since yesterday.", "Ight… let me see what I can do.  I payed the one time fee.", "Ugh, okay. Uploaded the results to one of our webhosts for now: https://bit.ly/2Rc5giU", "File does not exist anymore on the server", "Voila, in CSV format (and gzipped for compression) http://www.fast-files.com/getfile.aspx?file=176052", "I’m not sure but I don’t want let you to waste credits. so grab only libssh (https://www.shodan.io/search?query=libssh) because should already have product:libssh query results itself", "I’m not sure but I don’t want let you to waste credits. so grab only libssh (https://www.shodan.io/search?query=libssh) because should already have product:libssh query results itself", "Do you want me to grab both sets separately or just the product:libssh set?", "https://www.shodan.io/search?query=product%3Alibssh parameter is: product:libssh but I don’t know why only 3,553 servers are shown and/or found. with only libssh query servers looks like 6000 https://www.shodan.io/search?query=libssh", "I have credits but I what search parameters am I using? Trying out the libssh banners produced nothing for me.", "If total servers on Shodan are only 6.000  and only 3000 are vulnerable , so someone that have credits on Shodan could search and download till 10.000 result for credit , so with 1 credit we can get all available servers then, with a bash script and a loop we can test each server with my script, or &hellip;", "I understand that… the issue from IRC is getting a shell, no? Also, found this: “Another limitation: only vulnerable versions of libssh running in server mode are vulnerable, while the client mode is unaffected.” According to this article, shodan showed 6,351 sites using libssh. I would think t&hellip;", "Perhaps it is how I am doing it. I’m running against 127.0.0.1:2222, is this what you’re doing?", "Perhaps it is how I am doing it. I’m running against 127.0.0.1:2222, is this what you’re doing?", "I’m trying all in local so it’s useless port forward, I can make a try but it should work anyway and nope I didn’t modified docker build. It’s strange that it doesn’t work for you. I made this script few days ago but only now it definitely works. @Techno_Forg What you wrote it’s correct  but assume&hellip;", "This script looks dope, have you modified your docker build in anyway from stock? Guessing you’ve enabled portforwarding?", "I’m trying with https://github.com/hackerhouse-opensource/cve-2018-10933 and it works in local for me… check out and test with this my own modified working script here: https://github.com/Virgula0/POC-CVE-2018-10933 [68747470733a2f2f692e696d6775722e636f6d2f6f48476f4373582e706e67]", "I’m trying with https://github.com/hackerhouse-opensource/cve-2018-10933 and it works in local for me… check out and test with this my own modified working script here: https://github.com/Virgula0/POC-CVE-2018-10933 [68747470733a2f2f692e696d6775722e636f6d2f6f48476f4373582e706e67]", "Thanks for all infos guys now I’m understanding why I was not able to exploit this vulnerability. Anyway I’m gonna test that GitHub vulnerable docker…", "Thanks for all infos guys now I’m understanding why I was not able to exploit this vulnerability. Anyway I’m gonna test that GitHub vulnerable docker…", "I was just reading about this vulnerability but as soon as they mentioned that it’s not the standard SSH that’s affected I kinda glazed over. It’s still very interesting if you can find the right device as @pry0cc said but you’re better off setting up a vulnerable instance of your own to try it out &hellip;", "Yeahhh. I’m starting to notice that. As with the case of F5, you can theoretically pwn many other devices that do not include libssh in their banner, such as the scanner from Leap Security / Jbroche that does banner grab. For example there are likely other embedded devices using Libssh that do not&hellip;", "Thanks for all infos guys now I’m understanding why I was not able to exploit this vulnerability. Anyway I’m gonna test that GitHub vulnerable docker…", "This probably deserves its own article. The vulnerability known as CVE-2018-10933 is largely overhyped, many memes have been made about it and infact it has been confused with its bigger brother, openssh. Libssh only really affects about 3000 devices on the entire internet, which isn’t very much c&hellip;", "I’m trying to exploit libssh vulnerability and ignoring an installation of libssh in local do you know an online server to make tries with this vulnerability?", "[5jTwN3d.png]TheReaver it’s a tool written in bash born to execute  WPS attacks and based on the output of pins of 3wifi stascorp com service testing with the famous software reaver. 3wifi.stascorp.com is an html page that has javascript code also working offline (already on github) to calculate i&hellip;", "EvilTwin Attack is an attack completely different from WPS Attack. That is a social engineering attack. To explore it you can use some scripts such as Fluxion Linset or wifiphisher. Your comment is off topic", "some modern routers are still affected by these vulnerabilities… trust me… if you have a WPS PIN you can crack whatever password of whatever router, you have to get only the wps pin except for router that only uses button for WPS. How can I say this? Read this example: my neighbor didn’t have wifi t&hellip;", "I’m using only WPS attack and I have an high success rate in attacks especially in Pixie Dust attack that TheReaver already have… Social Engineering attacks are completely different from WPS attacks and in IMHO completely useless… you can’t compare them man…", "@chaos_knight’s answer is far for being pointless. Indeed, whatever the method used, WPS Pin Cracking or social engineering, the end goal is still the same. Moreover, such SE attacks have a better chance to succeed in the wild. As @pry0cc said, and according to my own experience, it’s been a while s&hellip;", "EvilTwin Attack is an attack completely different from WPS Attack. That is a social engineering attack. To explore it you can use some scripts such as Fluxion Linset or wifiphisher. Your comment is off topic", "Yeah it works, alghorithms are solid and valid. pm me to get all info and pictures about an example of a vulnerable NETGEAR router near my house.", "[5jTwN3d.png]TheReaver it’s a tool written in bash born to execute  WPS attacks and based on the output of pins of 3wifi stascorp com service testing with the famous software reaver. 3wifi.stascorp.com is an html page that has javascript code also working offline (already on github) to calculate i&hellip;", "[5jTwN3d.png]TheReaver it’s a tool written in bash born to execute  WPS attacks and based on the output of pins of 3wifi stascorp com service testing with the famous software reaver. 3wifi.stascorp.com is an html page that has javascript code also working offline (already on github) to calculate i&hellip;", "[5jTwN3d.png]TheReaver it’s a tool written in bash born to execute  WPS attacks and based on the output of pins of 3wifi stascorp com service testing with the famous software reaver. 3wifi.stascorp.com is an html page that has javascript code also working offline (already on github) to calculate i&hellip;", "[5jTwN3d.png]TheReaver it’s a tool written in bash born to execute  WPS attacks and based on the output of pins of 3wifi stascorp com service testing with the famous software reaver. 3wifi.stascorp.com is an html page that has javascript code also working offline (already on github) to calculate i&hellip;", "[5jTwN3d.png]TheReaver it’s a tool written in bash born to execute  WPS attacks and based on the output of pins of 3wifi stascorp com service testing with the famous software reaver. 3wifi.stascorp.com is an html page that has javascript code also working offline (already on github) to calculate i&hellip;"]}