{"user": "zSec", "history": ["Great article @pry0cc!  Fun fact: In one of my recent pentests I was able to do a DNS zone transfer. I have to admit, I was quiet shocked to see it work in a real scenario. Like you already mentioned, it is pretty rare nowadays.", "Hello again!It’s been a while since the last Knowing Null. For those of you knew to the series, my name is skidd0 and Knowing Null is an interview series where I pester and prod the top minds of 0x00sec about themselves and then post it all publicly–a dream come true for us paranoid hackers! Today&hellip;", "I just used a VPN + Changed my User agent and that was enough to fool it.", "DISCLAIMER: Article originally published on immunIT  Hi fellas, I’m exiting to introduce you to a new vulnerability found by my colleague (Xel) and me during one of our pentesting engagements  I almost had my first CVE on Wordpress a year ago but now here we are! Vulnerability summaryDue to &hellip;", "Note: Multiple edits for typos (the ghost of a learning disability mostly overcome) and additional image upload occurred between 21:10 EST, 9/30/18 &amp; 22:23 EST 9/30/18 Last year I released the essay Shared thoughts after 6+ years in pentesting: (Shared thoughts after 6+ years in Pentesting). I dec&hellip;", "I’m going to necrobump this article, apologies if you’ve read this one before. It would be really cool if we could mix this dropper with this shell, https://github.com/audibleblink/gorsh. Anybody up for the challenge? EDIT: Ok, so I’ve figured out how to incorporate them together. Expect an articl&hellip;", "DISCLAIMER: Article originally published on immunIT. Hi fellas, Today, I will introduce you to a new tool, developed for the sake of one of my pentesting engagement, named XIP. XIP claims to provide an efficient way to generate a list of IP addresses, using a set of mutations, in order to bypas&hellip;", "Clientside Exploitation - Tricks of the Trade 0x01 - Sharpshooter + SquibblyTwoHi! I hope you’re well, today I am going to show you something that is common knowledge in the red teaming community, people use this kind of thing every day without thinking about it. However, if you’re new to security,&hellip;", "Welcome Back to Knowing Null!This week, you voted to bring in ricksanchez! Let’s just jump right into it.First, I’d like to thank you for joining this series of course, anytime  If people really feel the urge to get toknow more about me this is the perfect chance! Can you tell me and the read&hellip;", "Welcome back to Knowing NullKnowing Null is a series of interviews randomly conducted on the 0x00sec IRC server and compiled here for your convenience. Today’s guest is the ever present pry0cc! But, first, a poll! Who do you want to see next time?fraqdtmricksanchezzSecsprtn0x00pfPhoenix&hellip;", "Exploitation in 2018 - How Pentesting Has ChangedHi 0x00sec! This is the next installment of my pentesting series. If you missed my last two articles, you can read the first one here and the second one here. They are heavily OSINT focussed, and naturally, the next article should be about active rec&hellip;", "As already said in IRC yesterday: great idea @skidd0 ! I think it’ll help to create somewhat of an identity behind the of pseudonym which is nice  I gladly take part in the interview if people want to know. Otherwise adding @0x00pf, @sprtn and @zSec to the vote is a must for sure. We probably are&hellip;", "Agreed. I want to see @fraq and @ricksanchez, but I’m interested really to see @zSec and @sprtn, these guys are where I want to be in industry, and I don’t know their story, yet.", "@pry0cc, Well, inbound and outbound connections are handle by the fortigate so, … ^^ Cheers mate. The hardware appliance is fucking expensive not the one included in your forticloud licence", "@pry0cc, Well, inbound and outbound connections are handle by the fortigate so, … ^^ Cheers mate. The hardware appliance is fucking expensive not the one included in your forticloud licence", "Isn’t the sandbox feature crazy expensive? But all in all, pretty good setup", "Well, first, thanks for the summon @pry0cc. I will take this opportunity to explaining you guys what is the perfect setup for me. I’m not caring so much about fancy widgets or shiny desktop, I’m well more concerned about the maintainance and enhancement aspect of my workingstations. Through this m&hellip;", "Isn’t the sandbox feature crazy expensive? But all in all, pretty good setup", "Yep, you got the idea  and yes I stealed the i3 theme from someone  I must make one, this is on my todolist. I indeed purchased the whole bundle with: Deep SSL encryptionWeb filteringAntivirusForticloud sandboxDNS filteringIt’s a great product!", "OSINT 0x02 - LinkedIn is not just for jobsSup 0x00’ers, that’s right, I am back with another banger of an article, ready? If you read my last article on OSINT, you’ll know a little bit on how to find dirt on companies, their assets, and how to do all of that passively. Well now I am going to show &hellip;", "Dope article mate. Love it. Didn’t know about shodan nmap script  Could be useful to import result whithin metasploit which provides a nice way to handle detected services. By the same token, have you ever heard about virustotal passive DNS replication? It’s redoubtable, you will thanks me later  h&hellip;", "I’d love to do that. Sadly I’m currently really busy as well and I have to travel quiet a lot. That’s why I’m currently rarely on here as well. But If I find the time I hope to write something regarding pentesting", "I’d love to do that. Sadly I’m currently really busy as well and I have to travel quiet a lot. That’s why I’m currently rarely on here as well. But If I find the time I hope to write something regarding pentesting", "A few of the pentests I have done, we got DNS zone transfers. It’s worth trying. I’m glad you enjoyed the article. As a fellow pentester, I would love to see your take on important parts of a pentest. Maybe we can expect a pentesting series from @zSec’s perspective?", "Great article @pry0cc!  Fun fact: In one of my recent pentests I was able to do a DNS zone transfer. I have to admit, I was quiet shocked to see it work in a real scenario. Like you already mentioned, it is pretty rare nowadays.", "Great article @pry0cc!  Fun fact: In one of my recent pentests I was able to do a DNS zone transfer. I have to admit, I was quiet shocked to see it work in a real scenario. Like you already mentioned, it is pretty rare nowadays.", "Great article @pry0cc!  Fun fact: In one of my recent pentests I was able to do a DNS zone transfer. I have to admit, I was quiet shocked to see it work in a real scenario. Like you already mentioned, it is pretty rare nowadays.", "OSINT - Passive Recon and Passive Discovery Of AssetsSup 0x00’ers, to kick this badass series off, I am going to begin with the most important aspect of pentesting. Passive Recon and OSINT. Now, do not let the word ‘passive’ fool you. This is no light recon, you can uncover vast amounts of infomati&hellip;", "Hello, fellow 0x00’ers! First off, I lied. It’s not a botnet. But it enables you to achieve botnet-like abilities. Today I am going to show you something that has been kept a secret for a long time in the hacker community and has never really been made accessible to the average hobbyist. With this&hellip;", "DISCLAIMER: Article originally published on immunIT. Hi fellas, Today, I will introduce you a new tool, developed for the sake of my penetration testing activities, named Drupwn which claims to provide a reliable and efficient way to perform enumerations on Drupal web applications. You may thin&hellip;", "Firstly, due to my insane schedule, I do not get to interact with all of you as I would like. Let me take this opportunity to state that many of you are doing incredible work with the content of your posts; I do read just about everything released here on the Big 0; I am proud to be here among such&hellip;", "The Social Engineering Toolkit is simply great! There are many ways one can use it to get someones credentials or whatever you desire. Also it is really simple to create a payload which is embedded in a PDF or other media type. SET can be a really powerful tool.", "Hi 0x00’ers, and all those that took part in 0x00ctf 2017! First off, we want to thank all of our challenge creators, admins, and participants. CTFs are a great opportunity for us as a community to sharpen our skills, challenge ourselves and each other with new problems, and meet new people who sha&hellip;", "I always used KeePass and never had problems with it. It is a really simple password manager and what I really like about it is the Auto-Type function. Sadly I don’t have any comparisons to other password manager tools…", "I would probably be breaking protocol for writing this way and I ask that the admins and users of the platform turn a blind eye to the unstructured tutorial ( not actually one, this is actually a story ) they are about to read. As most of you realized that I had halted the tutorial of the reverse t&hellip;", "Hey! A very quick little tutorial here, (really not advanced at all), but may save you a tonne of time. Big scary disclaimer: I don’t advise pirating blah blah, I cannot be held responsible for the billions of dollars of “theft” you do with this. Blah Blah. Don’t sue me. Here’s the deal - You’re a&hellip;", "I came accross this pretty good URL scanner called urlscan. It is still in beta but it works pretty good and is accurate and can obtain a lot of information. Plus it is a passive recon tool, meaning you don’t touch the target directly. +5 stealth! Just a quick find I wanted to share https://urlsca&hellip;", "Some weeks ago I found [this interesting article] (https://blog.gdssecurity.com/labs/2017/9/5/linux-based-inter-process-code-injection-without-ptrace2.html), about injecting code in running processes without using ptrace. The article is very interesting and I recommend you to read it, but what caugh&hellip;", "Hello 0x00’ers! As many of you are aware, we are very fortunate to be able to offer 0x00sec as an ad-free service, hopefully forever. As this community grows, it will eventually require more and more just to keep it running. At the present, we receive a minimal amount from Amazon affiliates, anyti&hellip;", "&gt; PrefaceNote: As always the following is just a digest of all the things I could observe by working on printers myself or facts from stuff I read about recently. Since this thread about the HP printer promo videos caught some attention I will try to shed some light onto the field which was displa&hellip;", "@Sirius mentioned this in IRC but doesn’t want to post it himself. TL;DW: this is a vuln that allows an attacker to spread malware across devices, so long as they have Bluetooth enabled, without even formally pairing. Here’s a paper about it: http://go.armis.com/hubfs/BlueBorne%20Technical%20Whit&hellip;", "Just an FYI…", "For a few weeks now we have been watching the production of https://wacksec.com get better and better. We have seen multiple community members work hard into making this show great as well as informing the community and ordinary people of news and topics in infosec. Over the past few weeks, we have&hellip;", "@ricksanchez I’m not a coder as well, but this is the reason why I started learning python. And already with 1 hour of python experience I was able to write a module. Of course I couldn’t do it without the help of our extremely talented people like @fraq and @Nitrax (thanks again guys!), but I bet &hellip;", "@ricksanchez I’m not a coder as well, but this is the reason why I started learning python. And already with 1 hour of python experience I was able to write a module. Of course I couldn’t do it without the help of our extremely talented people like @fraq and @Nitrax (thanks again guys!), but I bet &hellip;", "For those of you following Legobot’s progress, here’s a quick update: Version 1.1.3 was released today. See changelog below. https://github.com/Legobot/Legobot/blob/develop/CHANGES.md @Nitrax and @zSec have jumped in and been a tremendous help lately. We’ve pushed through a few bugs, tightened up&hellip;", "Hi fellas, I found an interesting docker image on Docker Hub, dedicated to TOR hidden service deployement. The README is self explainatory and worth a try.  https://hub.docker.com/r/goldy/tor-hidden-service/ Take your chance to create the new silk road  Best, Nitrax", "Hi fellas, Let me introduce you my last tool, ORFinder ORFinder claims to be able to find any smtp services, exposed over the internet, vulnerable to open relay attack. Such attack relies on the fact that the sender / receiver addresses are not checked by the underlying mail server, allowing to p&hellip;", "Hi fellas, A few days ago, I decided to start my adventure in the reverse engineering domain. I was quickly overwhelmed by a bunch of information and op codes that confused me a lot, even with solid knowledge in assembly and programming. Reverse engineering can seem complex at the first glance, ho&hellip;", "Ello Badass 0x00’ers! “Use a VPN!”, “Use Tor!”, “What, you don’t use a VPN?” These are probably just some of the phrases you have heard thrown about privacy. Using a VPN will help you stay safer from adversaries attempting to discover your identity. Perhaps you wish to remain anonymous from corpor&hellip;", "You are right, it is working again! Sadly the target has to be online, otherwise it won’t work. @Nitrax a year ago or so it wasn’t working anymore, haven’t checked it out since then. But apparently they update it.", "@VVid0w I never heard about the WhatsAppSniffer. Is that working for real? And how does it work technically? Otherwise this is a great list of tools, thanks for the write up!", "You are right, it is working again! Sadly the target has to be online, otherwise it won’t work. @Nitrax a year ago or so it wasn’t working anymore, haven’t checked it out since then. But apparently they update it.", "But if my target doesn’t know me they won’t just click at that link, unless they are pretty stupid. This could be really useful in a blackbox pentest. Many companies use Skype for business. With that I could easily get the public IP of their internet outbreak.", "Just send them an IP grabber link using good old reliable SE.", "Yes, sadly. Do you know any alternatives?", "MAN. This page has exploded! There is so much here! I think I am going to bookmark this now before I loose it…", "It has exploded indeed! I really like this overview. It can be extremely useful if one needs information or a tool for a specific purpose. Imagine how this page might look in a year or so. I’m going to add everything useful I can think of and know about! I’m really happy that this idea worked ou&hellip;", "Hello 0x00’ers! @zSec gave us the idea to make a Wiki with working services for things such as email relays, SMS spoofing and the like. Feel free to edit this and add things you have tried and tested. The more we add in useful things, with a very quick way to access them, the more useful this page w&hellip;", "Hello 0x00’ers! @zSec gave us the idea to make a Wiki with working services for things such as email relays, SMS spoofing and the like. Feel free to edit this and add things you have tried and tested. The more we add in useful things, with a very quick way to access them, the more useful this page w&hellip;", "Aye p33ps! Seeing as WannaCry took the world by storm recently, I thought that it’s probably a good time to introduce the world of malware analysis to this forum. In this post, I will write about how you guys can join in on the mayhem and play with some fire (and hopefully not get burnt in the proce&hellip;", "It’s coming! eventually lol Don’t you worry!", "Nicely done! Really looking forward for some Eternalblue and DoublePulsar action", "Nicely done! Really looking forward for some Eternalblue and DoublePulsar action", "Note: I did not do the original work for this. This is an adaptation from Sheila A. Berta’s Exploit DB guide and mdiazcl from github on how to do it. With out further ado, let’s get right on into it shall we?! So, everyone by now (unless you live under a rock) has heard about the NSA tools leaked&hellip;", "When I joined NB 3-4 years ago I didn’t expect things to turn out the way they did! 0x00 surely is a large improvement over the original NB, but we still have a lot to live up to. In terms of projects, articles aimed at all skill levels, etc. That is why I am calling out to the 0x00sec community to&hellip;", "0x00sec turns 0x01!We made it, guys! 0x00sec is a year old. We went from a simple Jekyll blog with only three articles to a respectably-sized, full-on forum with over 500 users. Each day, one or more people took a chance and signed up. [image] Countless Introductions showcase our diversity of int&hellip;", "Ha “beginner friendly tasks” Reverse Engineering is hard. That’s definitely true when you’re just starting out. @Evalion, we need to figure out a way to bridge the gap between complete beginner and intermediate. I am struggling with this myself. When we break it we should share our findings.", "IntroductionFirst and foremost, I’d like to note that this is not an all encompassing article. You WILL have to use your creativity and think out of the box when hacking. What will this article entail? It will not have any code whatsoever, and is not meant to teach you how to hack anything specif&hellip;", "@zSec Ofcourse it is better than CEH when you look at it technically because CEH is a joke. But ironically many jobs require you to have the cert. I’m not interested in his certs, but more in his articles on SCADA hacking because I work in EE in industrial environments. -Phoenix750", "You set up a protonmail and he will reply to all your questions within 24 hours. Like a personal stack overflow.", "The only thing I did was the CWA Certification for 99$. I’m looking forward for the next level certs, CWE and CWP. The CWA is a very good entry level cert for whit hat hackers and is (in my point of view) already better then the CEH by EC-Counsil. I’m really looking forward for the next ones beca&hellip;", "Hey Mates! This time I’ll tell you how you can build your own Bad USB for about 10$. It’s pretty easy, but requires a compatible USB Stick. RequirementsYou’ll need an USB Stick with the Phison 2303 (2251-03) microcontroller installed. Sadly you can’t just ask in your favourite hardware shop for &hellip;", "Hey Mates! This time I have a project of mine to share with you about the USB Rubber Ducky. Maybe some of you already heard of it, e.g. @Occupytheweb wrote an article about its use in Mr. Robot. At the end of this small series you should be able to write your own Scripts for hacking the box just w&hellip;", "You should reply, but mess with him instead. Some guys of the Belgian national television once pulled this off, and it was funny as hell. -Phoenix750", "Hey guys! Check out this awful phishing attempt I received in my email! For OPSEC reasons, I’ve changed any occurrence of my name to “Doe.” Yes, he addressed me by my last name. Subject: Dear Doe,Message:Dear Doe, I am Barrister Fredrick Adonko, a Legal adviser to my late clientMr.D.E.Doe,a &hellip;", "A superpower is when you are capable of something which is not considered possible by humans. Computers are built to work in a specific way, and to understand other devices depending on their language. Just like we as humans, can communicate with other humans depending on their languages. I agree d&hellip;", "Hacking is not a super power. It’s a skill. It’s as simple as that. Unless you can raise traffic barriers, bridges, explode helicopters, stop trains, etc. with just a single push on your phone, like you can in W_D, hacking is not a superpower. And let’s not forget that Aiden is NOT hacking with his&hellip;", "@TheDoctor This looks really cool! Have to try it soon  And I like the idea with web.de, have some accounts on there too", "@TheDoctor This looks really cool! Have to try it soon  And I like the idea with web.de, have some accounts on there too", "Hey mates! After roughly 30 hours of work, I’m now finished with my own Android Remote Administration Tool . It was my holiday project, which I planned several weeks before. Argus - RAT is of course named after the giant in the Greek mythology. But… I think that’s not interesting for you . Let’s di&hellip;", "So we’re not far off xD 171 is close enough right?", "I remember playing around with metasploit and the android meterpreter I ran into the same issue. The device needed to be rooted to do a persistence. I have to get into that again, hacking android devices is really fun. But I have to work on my programming skills first  Let me know when your persis&hellip;", "I remember playing around with metasploit and the android meterpreter I ran into the same issue. The device needed to be rooted to do a persistence. I have to get into that again, hacking android devices is really fun. But I have to work on my programming skills first  Let me know when your persis&hellip;", "I remember playing around with metasploit and the android meterpreter I ran into the same issue. The device needed to be rooted to do a persistence. I have to get into that again, hacking android devices is really fun. But I have to work on my programming skills first  Let me know when your persis&hellip;", "Sure, I’ll get right to it.", "@Cromical, I’m interested in making my own as well, would be great if you can forward me that how to as well", "A MethodologyAs you may have seen OTW describe in the past back at the despicable NB, as a hacker you must know these 6 steps to penetrate a system successfully: Passive ReconnaissanceActive ReconnaissanceFootprinting &amp; EnumerationExploitationPrivilege EscalationCovering Your TracksAs crit&hellip;", "The Social Engineering Toolkit is simply great! There are many ways one can use it to get someones credentials or whatever you desire. Also it is really simple to create a payload which is embedded in a PDF or other media type. SET can be a really powerful tool.", "IntroductionHello Everyone! I am @the_c0nd0r. This is my first post here…so…wohooo!! This post is going to be a little illustrative. Although in the future posts, I’ll keep it short and up to the point so that it doesn’t become boring. Alright! Today, we will be setting up a fake Facebook login p&hellip;", "BRACE YOURSELVES because, this is a very long post and, i’ve gathered my pasts pointers to this entire topic and, with social-engineering being one of my primary special endeavors, I have now decided to give all of my pointers to you in one page. There are a lot that’s been covered, so i’m sure a th&hellip;", "@oaktree To answer you questions from my experiences I made: No, you don’t get the same IP adress, a normal router would recognize this and throw a duplicated IP error. Furthermore you will get strange symptoms when two systems on the same subnet have the same IP address, cause the packets are n&hellip;", "Yep, that’s a pretty good way to get free WiFi. Did that some times too, works like a charm. Most of these Wifi’s you can connect to at first (because there is no password for the WiFi itself). But afterwards you are prompted in a browser to enter the credentials to access the internet. So you can&hellip;", "I love about InfoSec that there is always something new, we will never stop learning. There will be always new vulnerabilites, breaches, new methods to hack/crack/do something. It’s an ongoing adventure where no finish line exists. It’s not something like being a normal admin who has a few applicat&hellip;", "I couldn’t agree more.", "I love about InfoSec that there is always something new, we will never stop learning. There will be always new vulnerabilites, breaches, new methods to hack/crack/do something. It’s an ongoing adventure where no finish line exists. It’s not something like being a normal admin who has a few applicat&hellip;", "I love about InfoSec that there is always something new, we will never stop learning. There will be always new vulnerabilites, breaches, new methods to hack/crack/do something. It’s an ongoing adventure where no finish line exists. It’s not something like being a normal admin who has a few applicat&hellip;", "@oaktree To answer you questions from my experiences I made: No, you don’t get the same IP adress, a normal router would recognize this and throw a duplicated IP error. Furthermore you will get strange symptoms when two systems on the same subnet have the same IP address, cause the packets are n&hellip;", "@oaktree To answer you questions from my experiences I made: No, you don’t get the same IP adress, a normal router would recognize this and throw a duplicated IP error. Furthermore you will get strange symptoms when two systems on the same subnet have the same IP address, cause the packets are n&hellip;", "Yep, that’s a pretty good way to get free WiFi. Did that some times too, works like a charm. Most of these Wifi’s you can connect to at first (because there is no password for the WiFi itself). But afterwards you are prompted in a browser to enter the credentials to access the internet. So you can&hellip;", "Yep, that’s a pretty good way to get free WiFi. Did that some times too, works like a charm. Most of these Wifi’s you can connect to at first (because there is no password for the WiFi itself). But afterwards you are prompted in a browser to enter the credentials to access the internet. So you can&hellip;", "There’re a few things: You can use netdiscover, arp-scan, or nmap to seek out another MAC. Finding out which MACs are able to access the internet can be simple brute force. If anything, you could write a program to parse the netdiscover result and then apply changes until you can get, let’s say, an&hellip;", "Yep, that’s a pretty good way to get free WiFi. Did that some times too, works like a charm. Most of these Wifi’s you can connect to at first (because there is no password for the WiFi itself). But afterwards you are prompted in a browser to enter the credentials to access the internet. So you can&hellip;", "I’m sure we have the potential", "Hell yeah we made it! Next state, 1000 users at the end of Juli?", "Hell yeah we made it! Next state, 1000 users at the end of Juli?", "We did it! 100 users!Hello 0x00’ers! A couple of weeks ago, this community started off as a fun new place to teach, learn and discuss Infomation Security, following the swift decline in activity at Nullbyte. Between three humble hackers on the #nullbyte IRC channel; Me, @oaktree and @unh0lys0da wor&hellip;", "SET is great when you have a short space of time at hand, however sometimes you want to know whats actually going on under the hood or have found a site you can’t clone with SET. Step 1: Select Your Target!The First Thing You’re Going to Want to Do Is Select the Site Login You Wish to Clone! For T&hellip;", "Great How-To! Too many people nowadays underestimate the power of search engines. There are many operators you can use to get the needed information quite quickly from your target.", "Great How-To! Too many people nowadays underestimate the power of search engines. There are many operators you can use to get the needed information quite quickly from your target.", "What Is DoXing?DoXing is a term we hackers use when gathering information on a target such as a company or more likely an individual. DoXing is usually meant for malicious intents, however this can most definitely also be used in a very good way, such as tracking down terrorists, and wanted black h&hellip;", "You should indeed, hacking is fun!", "Thank you! I’m already looking forward to the next stage", "I also want to congratulate you my fellow hacker!", "@ghost Thanks! It helps me a lot. I’m still a beginner when it comes to hacking but I’m really interested and want to learn more about it. Further I’d like to get a job in the Pentesting or IT Forensic field. But since I don’t have that much experience yet I will have to learn a lot. With some luck&hellip;", "@zSec, I forgot to congratulate you on Twitter when OTW announced this. Congratulations on passing, I do hope it helps you secure work. ghost_", "It is really awesome this community sticks together! At first I was a bit afraid that after the WHT debacle everything would fall apart, but it’s not, and this is simply great. This proves that this community is not just a little community, it becomes unique, it becomes a family  Furthermore I can&hellip;", "Just in case anyone doesn’t get the joke. My title is “Shakespeare of Programming” because I’m good at scripting. -Defalt", "It is really awesome this community sticks together! At first I was a bit afraid that after the WHT debacle everything would fall apart, but it’s not, and this is simply great. This proves that this community is not just a little community, it becomes unique, it becomes a family  Furthermore I can&hellip;", "Has it landed you a job anywhere?", "It is really awesome this community sticks together! At first I was a bit afraid that after the WHT debacle everything would fall apart, but it’s not, and this is simply great. This proves that this community is not just a little community, it becomes unique, it becomes a family  Furthermore I can&hellip;", "I somehow knew you would do something like that, but it’s good", "I somehow knew you would do something like that, but it’s good", "I suprised you alright.", "I can’t decide  What do you think fits better? “The Thoughtful”“The SecAdmin”Surprise me with one of them", "It is really awesome this community sticks together! At first I was a bit afraid that after the WHT debacle everything would fall apart, but it’s not, and this is simply great. This proves that this community is not just a little community, it becomes unique, it becomes a family  Furthermore I can&hellip;", "It is really awesome this community sticks together! At first I was a bit afraid that after the WHT debacle everything would fall apart, but it’s not, and this is simply great. This proves that this community is not just a little community, it becomes unique, it becomes a family  Furthermore I can&hellip;", "Awesome! I would love to work in infosec!", "Well there isn’t much to say. I’m actually pretty new to Pentesting but I’m really interested and want to learn more about hacking. I’m currently employed in InfoSec and mainly work with firewalls, proxy, 2FA, mail security and so on. So nothing special", "Well there isn’t much to say. I’m actually pretty new to Pentesting but I’m really interested and want to learn more about hacking. I’m currently employed in InfoSec and mainly work with firewalls, proxy, 2FA, mail security and so on. So nothing special", "Just joined this community, I’m originally from Null Byte too. Really looking forward for an awesome community about ITSec/Hacking! -zSec", "Awesome! We’d love to see an introduction from you  post your interests, skills and languages (programming + spoken)", "Just joined this community, I’m originally from Null Byte too. Really looking forward for an awesome community about ITSec/Hacking! -zSec", "Just joined this community, I’m originally from Null Byte too. Really looking forward for an awesome community about ITSec/Hacking! -zSec"]}